#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Anniversary

#include "Basic.hpp"

#include "DataTableUtilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "SpecialEventUtilities_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTagUtilities_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class Anniversary.CrownPickupInteraction
// 0x0050 (0x0790 - 0x0740)
class UCrownPickupInteraction final : public UChargeableInteractionDefinition
{
public:
	uint8                                         Pad_740[0x30];                                     // 0x0740(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   _attachToSocketName;                               // 0x0770(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           _pickupScoreEvent;                                 // 0x077C(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInteractionChargeComplete;                      // 0x0788(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_789[0x7];                                      // 0x0789(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrownPickupInteraction">();
	}
	static class UCrownPickupInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrownPickupInteraction>();
	}
};
static_assert(alignof(UCrownPickupInteraction) == 0x000010, "Wrong alignment on UCrownPickupInteraction");
static_assert(sizeof(UCrownPickupInteraction) == 0x000790, "Wrong size on UCrownPickupInteraction");
static_assert(offsetof(UCrownPickupInteraction, _attachToSocketName) == 0x000770, "Member 'UCrownPickupInteraction::_attachToSocketName' has a wrong offset!");
static_assert(offsetof(UCrownPickupInteraction, _pickupScoreEvent) == 0x00077C, "Member 'UCrownPickupInteraction::_pickupScoreEvent' has a wrong offset!");
static_assert(offsetof(UCrownPickupInteraction, _isInteractionChargeComplete) == 0x000788, "Member 'UCrownPickupInteraction::_isInteractionChargeComplete' has a wrong offset!");

// Class Anniversary.CrownPillarInteractable
// 0x00D8 (0x0428 - 0x0350)
class ACrownPillarInteractable final : public ARespawnableInteractable
{
public:
	struct FDBDTunableRowHandle                   _crownPillarInteractionSecondsToCharge;            // 0x0350(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _crownPillarInteractionSecondsToChargeKiller;      // 0x0378(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _offeringEnabledAuraVisibilityDistance;            // 0x03A0(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _anniversaryOfferingTag;                           // 0x03C8(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCrownPickupInteraction*                _crownPillarInteraction;                           // 0x03D8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCrownPickupInteraction*                _crownPillarInteractionKiller;                     // 0x03E0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChargeableComponent*                   _crownPillarInteractionChargeable;                 // 0x03E8(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChargeableComponent*                   _crownPillarInteractionChargeableKiller;           // 0x03F0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInteractor*                            _crownPillarInteractor;                            // 0x03F8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPrimitiveComponent*                    _crownPillarInteractionZone;                       // 0x0400(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   _crownPillarStaticMesh;                            // 0x0408(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDBDOutlineComponent*                   _outlineComponent;                                 // 0x0410(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UNearTrackedActorComponent*             _nearTrackedActorComponent;                        // 0x0418(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCrownPillarOutlineUpdateStrategy*      _crownPillarOutlineUpdateStrategy;                 // 0x0420(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Cosmetic_OnInteractionCancelled();
	void Cosmetic_OnInteractionCompleted(class ADBDPlayer* interactingPlayer);
	void Cosmetic_OnStartedInteracting(class ADBDPlayer* interactingPlayer, float interactionDuration);
	void Cosmetic_OnStoppedInteracting();
	void Local_OnIntroCompleted();

	bool IsLocallyObservedPlayerEquippedWithAnniversaryOffering() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrownPillarInteractable">();
	}
	static class ACrownPillarInteractable* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACrownPillarInteractable>();
	}
};
static_assert(alignof(ACrownPillarInteractable) == 0x000008, "Wrong alignment on ACrownPillarInteractable");
static_assert(sizeof(ACrownPillarInteractable) == 0x000428, "Wrong size on ACrownPillarInteractable");
static_assert(offsetof(ACrownPillarInteractable, _crownPillarInteractionSecondsToCharge) == 0x000350, "Member 'ACrownPillarInteractable::_crownPillarInteractionSecondsToCharge' has a wrong offset!");
static_assert(offsetof(ACrownPillarInteractable, _crownPillarInteractionSecondsToChargeKiller) == 0x000378, "Member 'ACrownPillarInteractable::_crownPillarInteractionSecondsToChargeKiller' has a wrong offset!");
static_assert(offsetof(ACrownPillarInteractable, _offeringEnabledAuraVisibilityDistance) == 0x0003A0, "Member 'ACrownPillarInteractable::_offeringEnabledAuraVisibilityDistance' has a wrong offset!");
static_assert(offsetof(ACrownPillarInteractable, _anniversaryOfferingTag) == 0x0003C8, "Member 'ACrownPillarInteractable::_anniversaryOfferingTag' has a wrong offset!");
static_assert(offsetof(ACrownPillarInteractable, _crownPillarInteraction) == 0x0003D8, "Member 'ACrownPillarInteractable::_crownPillarInteraction' has a wrong offset!");
static_assert(offsetof(ACrownPillarInteractable, _crownPillarInteractionKiller) == 0x0003E0, "Member 'ACrownPillarInteractable::_crownPillarInteractionKiller' has a wrong offset!");
static_assert(offsetof(ACrownPillarInteractable, _crownPillarInteractionChargeable) == 0x0003E8, "Member 'ACrownPillarInteractable::_crownPillarInteractionChargeable' has a wrong offset!");
static_assert(offsetof(ACrownPillarInteractable, _crownPillarInteractionChargeableKiller) == 0x0003F0, "Member 'ACrownPillarInteractable::_crownPillarInteractionChargeableKiller' has a wrong offset!");
static_assert(offsetof(ACrownPillarInteractable, _crownPillarInteractor) == 0x0003F8, "Member 'ACrownPillarInteractable::_crownPillarInteractor' has a wrong offset!");
static_assert(offsetof(ACrownPillarInteractable, _crownPillarInteractionZone) == 0x000400, "Member 'ACrownPillarInteractable::_crownPillarInteractionZone' has a wrong offset!");
static_assert(offsetof(ACrownPillarInteractable, _crownPillarStaticMesh) == 0x000408, "Member 'ACrownPillarInteractable::_crownPillarStaticMesh' has a wrong offset!");
static_assert(offsetof(ACrownPillarInteractable, _outlineComponent) == 0x000410, "Member 'ACrownPillarInteractable::_outlineComponent' has a wrong offset!");
static_assert(offsetof(ACrownPillarInteractable, _nearTrackedActorComponent) == 0x000418, "Member 'ACrownPillarInteractable::_nearTrackedActorComponent' has a wrong offset!");
static_assert(offsetof(ACrownPillarInteractable, _crownPillarOutlineUpdateStrategy) == 0x000420, "Member 'ACrownPillarInteractable::_crownPillarOutlineUpdateStrategy' has a wrong offset!");

// Class Anniversary.CrownPillarOutlineUpdateStrategy
// 0x0010 (0x00D0 - 0x00C0)
class UCrownPillarOutlineUpdateStrategy final : public UOutlineUpdateStrategy
{
public:
	struct FLinearColor                           _offeringEnabledAuraColor;                         // 0x00C0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrownPillarOutlineUpdateStrategy">();
	}
	static class UCrownPillarOutlineUpdateStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrownPillarOutlineUpdateStrategy>();
	}
};
static_assert(alignof(UCrownPillarOutlineUpdateStrategy) == 0x000008, "Wrong alignment on UCrownPillarOutlineUpdateStrategy");
static_assert(sizeof(UCrownPillarOutlineUpdateStrategy) == 0x0000D0, "Wrong size on UCrownPillarOutlineUpdateStrategy");
static_assert(offsetof(UCrownPillarOutlineUpdateStrategy, _offeringEnabledAuraColor) == 0x0000C0, "Member 'UCrownPillarOutlineUpdateStrategy::_offeringEnabledAuraColor' has a wrong offset!");

// Class Anniversary.CrownPlayerComponent
// 0x00B0 (0x02D0 - 0x0220)
class UCrownPlayerComponent final : public USceneComponent
{
public:
	bool                                          _hasInteractedWithCrownPillarThisGame;             // 0x0218(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  _crownVFXParticleDeactivateTags;                   // 0x0220(0x0020)(Edit, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  _unhookGameEvents;                                 // 0x0240(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FTagStateBool                          _isCrownEventActive;                               // 0x0260(0x0030)(Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_290[0x40];                                     // 0x0290(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_SetVFXParticlesVisibility(bool isVisible);
	void OnRep_hasInteractedWithCrownPillarThisGame();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrownPlayerComponent">();
	}
	static class UCrownPlayerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrownPlayerComponent>();
	}
};
static_assert(alignof(UCrownPlayerComponent) == 0x000010, "Wrong alignment on UCrownPlayerComponent");
static_assert(sizeof(UCrownPlayerComponent) == 0x0002D0, "Wrong size on UCrownPlayerComponent");
static_assert(offsetof(UCrownPlayerComponent, _hasInteractedWithCrownPillarThisGame) == 0x000218, "Member 'UCrownPlayerComponent::_hasInteractedWithCrownPillarThisGame' has a wrong offset!");
static_assert(offsetof(UCrownPlayerComponent, _crownVFXParticleDeactivateTags) == 0x000220, "Member 'UCrownPlayerComponent::_crownVFXParticleDeactivateTags' has a wrong offset!");
static_assert(offsetof(UCrownPlayerComponent, _unhookGameEvents) == 0x000240, "Member 'UCrownPlayerComponent::_unhookGameEvents' has a wrong offset!");
static_assert(offsetof(UCrownPlayerComponent, _isCrownEventActive) == 0x000260, "Member 'UCrownPlayerComponent::_isCrownEventActive' has a wrong offset!");

}

