#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AudioUtilities

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class AudioUtilities.SplineAudioEmitterActor
// 0x0020 (0x0250 - 0x0230)
class ASplineAudioEmitterActor final : public AActor
{
public:
	class USceneComponent*                        _root;                                             // 0x0230(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USplineComponent*                       _theSpline;                                        // 0x0238(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAkComponent*                           _emitter;                                          // 0x0240(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_248[0x8];                                      // 0x0248(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SplineAudioEmitterActor">();
	}
	static class ASplineAudioEmitterActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASplineAudioEmitterActor>();
	}
};
static_assert(alignof(ASplineAudioEmitterActor) == 0x000008, "Wrong alignment on ASplineAudioEmitterActor");
static_assert(sizeof(ASplineAudioEmitterActor) == 0x000250, "Wrong size on ASplineAudioEmitterActor");
static_assert(offsetof(ASplineAudioEmitterActor, _root) == 0x000230, "Member 'ASplineAudioEmitterActor::_root' has a wrong offset!");
static_assert(offsetof(ASplineAudioEmitterActor, _theSpline) == 0x000238, "Member 'ASplineAudioEmitterActor::_theSpline' has a wrong offset!");
static_assert(offsetof(ASplineAudioEmitterActor, _emitter) == 0x000240, "Member 'ASplineAudioEmitterActor::_emitter' has a wrong offset!");

}

