#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActorWaypoint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ActorWaypoint.BP_ActorWaypoint_C.ExecuteUbergraph_BP_ActorWaypoint
// 0x00A0 (0x00A0 - 0x0000)
struct BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ActorWaypoint_C*                   K2Node_DynamicCast_AsWBP_Actor_Waypoint;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_ObjectToString_ReturnValue;          // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0078(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint) == 0x000008, "Wrong alignment on BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint");
static_assert(sizeof(BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint) == 0x0000A0, "Wrong size on BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint");
static_assert(offsetof(BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint, EntryPoint) == 0x000000, "Member 'BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000008, "Member 'BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint, K2Node_DynamicCast_AsWBP_Actor_Waypoint) == 0x000010, "Member 'BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint::K2Node_DynamicCast_AsWBP_Actor_Waypoint' has a wrong offset!");
static_assert(offsetof(BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00001C, "Member 'BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint, CallFunc_GetAttachParentActor_ReturnValue) == 0x000040, "Member 'BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint, CallFunc_Conv_ObjectToString_ReturnValue) == 0x000050, "Member 'BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint::CallFunc_Conv_ObjectToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint, K2Node_CreateDelegate_OutputDelegate_1) == 0x000078, "Member 'BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000090, "Member 'BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000098, "Member 'BP_ActorWaypoint_C_ExecuteUbergraph_BP_ActorWaypoint::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");

}

