#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActorController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ActorController.BP_ActorController_C.ExecuteUbergraph_BP_ActorController
// 0x0858 (0x0858 - 0x0000)
struct BP_ActorController_C_ExecuteUbergraph_BP_ActorController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0040(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_2;        // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_3;        // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue_1;             // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_4;        // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0134(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C5[0x3];                                      // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x01D4(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x026C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0284(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_2;     // 0x029C(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_2;        // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_3;     // 0x0330(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_3;        // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WasInputKeyJustPressed_ReturnValue;       // 0x03C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WasInputKeyJustReleased_ReturnValue;      // 0x03C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C3[0x1];                                      // 0x03C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInputMouseDelta_DeltaX;                // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInputMouseDelta_DeltaY;                // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x03E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x03F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F5[0x3];                                      // 0x03F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x03F8(0x0014)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetInputAnalogStickState_StickX;          // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInputAnalogStickState_StickY;          // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_3;        // 0x0418(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_5;        // 0x0424(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_6;        // 0x0430(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetRightVector_ReturnValue_2;             // 0x043C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_2;           // 0x0448(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_4;       // 0x0454(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0460(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x046C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x0478(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInputAnalogStickState_StickX_1;        // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInputAnalogStickState_StickY_1;        // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_4;     // 0x048C(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_4;        // 0x051C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51D[0x3];                                      // 0x051D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_5;       // 0x0524(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_7;        // 0x0530(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_5;           // 0x053C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x054C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_5;     // 0x0554(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_5;        // 0x05E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E5[0x3];                                      // 0x05E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInputAnalogStickState_StickX_2;        // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInputAnalogStickState_StickY_2;        // 0x05EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasInputKeyJustPressed_ReturnValue_1;     // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F1[0x3];                                      // 0x05F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x05F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_7;        // 0x05F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_8;        // 0x05FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0604(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_8;        // 0x060C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0618(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0624(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_1;        // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_631[0x3];                                      // 0x0631(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_6;       // 0x0634(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x0640(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_6;           // 0x064C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_9;        // 0x0658(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_6;     // 0x0664(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_6;        // 0x06F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F5[0x3];                                      // 0x06F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetUpVector_ReturnValue_1;                // 0x06F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_7;        // 0x0704(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_7;       // 0x0710(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_7;           // 0x071C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasInputKeyJustPressed_ReturnValue_2;     // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_729[0x3];                                      // 0x0729(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_7;     // 0x072C(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_7;        // 0x07BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WasInputKeyJustReleased_ReturnValue_1;    // 0x07BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WasInputKeyJustReleased_ReturnValue_2;    // 0x07BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7BF[0x1];                                      // 0x07BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_10;       // 0x07C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x07CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x07D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x07D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasInputKeyJustPressed_ReturnValue_3;     // 0x07D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D9[0x3];                                      // 0x07D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x07DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_2;        // 0x07E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WasInputKeyJustReleased_ReturnValue_3;    // 0x07E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7EA[0x2];                                      // 0x07EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x07EC(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0800(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_801[0x7];                                      // 0x0801(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_4;        // 0x0808(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasInputKeyJustPressed_ReturnValue_4;     // 0x0810(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0811(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WasInputKeyJustReleased_ReturnValue_4;    // 0x0812(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0813(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WasInputKeyJustPressed_ReturnValue_5;     // 0x0814(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0815(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WasInputKeyJustReleased_ReturnValue_5;    // 0x0816(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WasInputKeyJustPressed_ReturnValue_6;     // 0x0817(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0818(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_WasInputKeyJustReleased_ReturnValue_6;    // 0x082C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82D[0x3];                                      // 0x082D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_5;        // 0x0830(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasInputKeyJustPressed_ReturnValue_7;     // 0x0838(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WasInputKeyJustReleased_ReturnValue_7;    // 0x0839(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WasInputKeyJustPressed_ReturnValue_8;     // 0x083A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83B[0x1];                                      // 0x083B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x083C(0x0014)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_6;        // 0x0850(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController) == 0x000008, "Wrong alignment on BP_ActorController_C_ExecuteUbergraph_BP_ActorController");
static_assert(sizeof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController) == 0x000858, "Wrong size on BP_ActorController_C_ExecuteUbergraph_BP_ActorController");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, EntryPoint) == 0x000000, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000038, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, K2Node_CreateDelegate_OutputDelegate_2) == 0x000040, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000058, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, K2Node_Event_DeltaSeconds) == 0x000060, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000064, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x000070, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_GetForwardVector_ReturnValue) == 0x00007C, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_GetForwardVector_ReturnValue_1) == 0x000088, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000094, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000A0, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_GetActorRotation_ReturnValue_2) == 0x0000AC, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_GetActorRotation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_GetActorRotation_ReturnValue_3) == 0x0000B8, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_GetActorRotation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_GetRightVector_ReturnValue) == 0x0000C4, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_GetRightVector_ReturnValue_1) == 0x0000D0, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_GetRightVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0000DC, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0000E8, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_GetActorRotation_ReturnValue_4) == 0x0000F4, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_GetActorRotation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000100, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_BreakRotator_Roll) == 0x000104, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_BreakRotator_Pitch) == 0x000108, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_BreakRotator_Yaw) == 0x00010C, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000110, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Add_VectorVector_ReturnValue) == 0x00011C, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000128, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000134, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0001C4, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0001C8, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_SetActorLocation_SweepHitResult_1) == 0x0001D4, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_SetActorLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_SetActorLocation_ReturnValue_1) == 0x000264, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_SetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000268, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x00026C, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Multiply_VectorFloat_ReturnValue_3) == 0x000278, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Multiply_VectorFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000284, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000290, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_SetActorLocation_SweepHitResult_2) == 0x00029C, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_SetActorLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_SetActorLocation_ReturnValue_2) == 0x00032C, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_SetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_SetActorLocation_SweepHitResult_3) == 0x000330, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_SetActorLocation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_SetActorLocation_ReturnValue_3) == 0x0003C0, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_SetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_WasInputKeyJustPressed_ReturnValue) == 0x0003C1, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_WasInputKeyJustPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_WasInputKeyJustReleased_ReturnValue) == 0x0003C2, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_WasInputKeyJustReleased_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_GetInputMouseDelta_DeltaX) == 0x0003C4, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_GetInputMouseDelta_DeltaX' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_GetInputMouseDelta_DeltaY) == 0x0003C8, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_GetInputMouseDelta_DeltaY' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0003CC, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0003D0, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Add_FloatFloat_ReturnValue) == 0x0003D4, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0003D8, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_FClamp_ReturnValue) == 0x0003DC, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_GetPlayerController_ReturnValue) == 0x0003E0, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_MakeRotator_ReturnValue) == 0x0003E8, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0003F4, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, K2Node_CreateDelegate_OutputDelegate_3) == 0x0003F8, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_GetInputAnalogStickState_StickX) == 0x00040C, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_GetInputAnalogStickState_StickX' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_GetInputAnalogStickState_StickY) == 0x000410, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_GetInputAnalogStickState_StickY' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_SetTimerDelegate_ReturnValue_3) == 0x000418, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_SetTimerDelegate_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000420, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_GetActorRotation_ReturnValue_5) == 0x000424, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_GetActorRotation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_GetActorRotation_ReturnValue_6) == 0x000430, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_GetActorRotation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_GetRightVector_ReturnValue_2) == 0x00043C, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_GetRightVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_GetForwardVector_ReturnValue_2) == 0x000448, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_GetForwardVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Multiply_VectorFloat_ReturnValue_4) == 0x000454, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Multiply_VectorFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x000460, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x00046C, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Add_VectorVector_ReturnValue_4) == 0x000478, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Add_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_GetInputAnalogStickState_StickX_1) == 0x000484, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_GetInputAnalogStickState_StickX_1' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_GetInputAnalogStickState_StickY_1) == 0x000488, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_GetInputAnalogStickState_StickY_1' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_SetActorLocation_SweepHitResult_4) == 0x00048C, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_SetActorLocation_SweepHitResult_4' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_SetActorLocation_ReturnValue_4) == 0x00051C, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_SetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x000520, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Multiply_VectorFloat_ReturnValue_5) == 0x000524, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Multiply_VectorFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_GetActorRotation_ReturnValue_7) == 0x000530, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_GetActorRotation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Add_VectorVector_ReturnValue_5) == 0x00053C, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Add_VectorVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_BreakRotator_Roll_1) == 0x000548, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_BreakRotator_Pitch_1) == 0x00054C, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_BreakRotator_Yaw_1) == 0x000550, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_SetActorLocation_SweepHitResult_5) == 0x000554, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_SetActorLocation_SweepHitResult_5' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_SetActorLocation_ReturnValue_5) == 0x0005E4, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_SetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_GetInputAnalogStickState_StickX_2) == 0x0005E8, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_GetInputAnalogStickState_StickX_2' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_GetInputAnalogStickState_StickY_2) == 0x0005EC, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_GetInputAnalogStickState_StickY_2' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_WasInputKeyJustPressed_ReturnValue_1) == 0x0005F0, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_WasInputKeyJustPressed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Multiply_FloatFloat_ReturnValue_6) == 0x0005F4, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Multiply_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Multiply_FloatFloat_ReturnValue_7) == 0x0005F8, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Multiply_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Multiply_FloatFloat_ReturnValue_8) == 0x0005FC, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Multiply_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000600, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x000604, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_FClamp_ReturnValue_1) == 0x000608, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_GetActorRotation_ReturnValue_8) == 0x00060C, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_GetActorRotation_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_MakeRotator_ReturnValue_1) == 0x000618, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_GetUpVector_ReturnValue) == 0x000624, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_SetActorRotation_ReturnValue_1) == 0x000630, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_SetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Multiply_VectorFloat_ReturnValue_6) == 0x000634, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Multiply_VectorFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_GetActorLocation_ReturnValue_6) == 0x000640, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_GetActorLocation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Add_VectorVector_ReturnValue_6) == 0x00064C, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Add_VectorVector_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_GetActorRotation_ReturnValue_9) == 0x000658, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_GetActorRotation_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_SetActorLocation_SweepHitResult_6) == 0x000664, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_SetActorLocation_SweepHitResult_6' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_SetActorLocation_ReturnValue_6) == 0x0006F4, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_SetActorLocation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_GetUpVector_ReturnValue_1) == 0x0006F8, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_GetUpVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_GetActorLocation_ReturnValue_7) == 0x000704, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_GetActorLocation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Multiply_VectorFloat_ReturnValue_7) == 0x000710, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Multiply_VectorFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_Add_VectorVector_ReturnValue_7) == 0x00071C, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_Add_VectorVector_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_WasInputKeyJustPressed_ReturnValue_2) == 0x000728, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_WasInputKeyJustPressed_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_SetActorLocation_SweepHitResult_7) == 0x00072C, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_SetActorLocation_SweepHitResult_7' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_SetActorLocation_ReturnValue_7) == 0x0007BC, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_SetActorLocation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_WasInputKeyJustReleased_ReturnValue_1) == 0x0007BD, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_WasInputKeyJustReleased_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_WasInputKeyJustReleased_ReturnValue_2) == 0x0007BE, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_WasInputKeyJustReleased_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_GetActorRotation_ReturnValue_10) == 0x0007C0, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_GetActorRotation_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_BreakRotator_Roll_2) == 0x0007CC, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_BreakRotator_Pitch_2) == 0x0007D0, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_BreakRotator_Yaw_2) == 0x0007D4, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_WasInputKeyJustPressed_ReturnValue_3) == 0x0007D8, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_WasInputKeyJustPressed_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_MakeRotator_ReturnValue_2) == 0x0007DC, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_SetActorRotation_ReturnValue_2) == 0x0007E8, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_SetActorRotation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_WasInputKeyJustReleased_ReturnValue_3) == 0x0007E9, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_WasInputKeyJustReleased_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, K2Node_CreateDelegate_OutputDelegate_4) == 0x0007EC, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_BooleanOR_ReturnValue) == 0x000800, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_K2_SetTimerDelegate_ReturnValue_4) == 0x000808, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_K2_SetTimerDelegate_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_WasInputKeyJustPressed_ReturnValue_4) == 0x000810, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_WasInputKeyJustPressed_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_BooleanOR_ReturnValue_1) == 0x000811, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorController_C_ExecuteUbergraph_BP_ActorController, CallFunc_WasInputKeyJustReleased_ReturnValue_4) == 0x000812, "Member 'BP_ActorController_C_ExecuteUbergraph_BP_ActorController::CallFunc_WasInputKeyJustReleased_ReturnValue_4' has a wrong offset!");
