#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActorWaypoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ActorWaypoint.BP_ActorWaypoint_C
// 0x0028 (0x0258 - 0x0230)
class ABP_ActorWaypoint_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       ActorWaypointWidget;                               // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWBP_ActorWaypoint_C*                   WBP_Actor_Waypoint;                                // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Update_Delay;                                      // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ActorWaypoint(int32 EntryPoint);
	void Event_Init();
	void Event_Update_Actor_Info();
	void Event_Update_Distance();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ActorWaypoint_C">();
	}
	static class ABP_ActorWaypoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ActorWaypoint_C>();
	}
};
static_assert(alignof(ABP_ActorWaypoint_C) == 0x000008, "Wrong alignment on ABP_ActorWaypoint_C");
static_assert(sizeof(ABP_ActorWaypoint_C) == 0x000258, "Wrong size on ABP_ActorWaypoint_C");
static_assert(offsetof(ABP_ActorWaypoint_C, UberGraphFrame) == 0x000230, "Member 'ABP_ActorWaypoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ActorWaypoint_C, ActorWaypointWidget) == 0x000238, "Member 'ABP_ActorWaypoint_C::ActorWaypointWidget' has a wrong offset!");
static_assert(offsetof(ABP_ActorWaypoint_C, Cube) == 0x000240, "Member 'ABP_ActorWaypoint_C::Cube' has a wrong offset!");
static_assert(offsetof(ABP_ActorWaypoint_C, WBP_Actor_Waypoint) == 0x000248, "Member 'ABP_ActorWaypoint_C::WBP_Actor_Waypoint' has a wrong offset!");
static_assert(offsetof(ABP_ActorWaypoint_C, Update_Delay) == 0x000250, "Member 'ABP_ActorWaypoint_C::Update_Delay' has a wrong offset!");

}

