#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DBDGameInstance_0

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_ToggleActors_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_ExportLevelsListMethod_structs.hpp"
#include "S_UEToolsCommand_structs.hpp"
#include "BP_DBDGameInstance_classes.hpp"
#include "E_ActorClassType_structs.hpp"
#include "E_WorldSettings_structs.hpp"
#include "E_HorizontalTextAlignment_structs.hpp"
#include "E_VerticalTextAlignment_structs.hpp"
#include "E_AttachRule_structs.hpp"
#include "E_CustomLightType_structs.hpp"
#include "E_CharacterAction_structs.hpp"
#include "E_FlashLightType_structs.hpp"
#include "E_SkyLightType_structs.hpp"
#include "E_DBDGameState_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DBDGameInstance.BP_DBDGameInstance_C
// 0x02E8 (0x0D00 - 0x0A18)
class BP_DBDGameInstance_0::UBP_DBDGameInstance_C final : public BP_DBDGameInstance::UBP_DBDGameInstance_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A18(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FAssetData>                     CH_DataTables_AssetData;                           // 0x0A20(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UDataTable*>                     CH_DataTables_CharacterDescriptionDB;              // 0x0A30(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UDataTable*>                     CH_DataTables_CustomizationItemDB;                 // 0x0A40(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UDataTable*>                     CH_DataTables_ItemAddonDB;                         // 0x0A50(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UDataTable*>                     CH_DataTables_ItemDB;                              // 0x0A60(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UDataTable*>                     CH_DataTables_OfferingDB;                          // 0x0A70(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UDataTable*>                     CH_DataTables_PerkDB;                              // 0x0A80(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                         CH_Blueprints_Class_StartScreen;                   // 0x0A90(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                         CH_Blueprints_Class_Lobby;                         // 0x0AA0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TScriptInterface<class IAssetRegistry>        CH_AssetRegistry;                                  // 0x0AB0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<class UClass*>                         CH_Blueprints_Class_Gameplay;                      // 0x0AC0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         CH_Blueprints_Soft_StartScreen;                    // 0x0AD0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         CH_Blueprints_Soft_Lobby;                          // 0x0AE0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         CH_Blueprints_Soft_Gameplay;                       // 0x0AF0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CH_Blueprints_Counter_StartScreen;                 // 0x0B00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CH_Blueprints_Counter_Lobby;                       // 0x0B04(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CH_Blueprints_Counter_Gameplay;                    // 0x0B08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAutoEnableCheatFlyingControls;                    // 0x0B0C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bCheatFlyingControls;                              // 0x0B0D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B0E[0x2];                                      // 0x0B0E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         UETools_Protected_Widgets;                         // 0x0B10(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UUserWidget*, ESlateVisibility>    UETools_Toggled_Widgets;                           // 0x0B20(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWBP_DebugStats_C*                      WBP_Debug_Stats_Reference;                         // 0x0B70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_LevelsList_C*                      WBP_Levels_List_Reference;                         // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LevelStreamingManager_C*            Level_Streaming_Manager_Reference;                 // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_ToggleActors>                ToggleActors_Actors_Map;                           // 0x0B88(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class ABP_VolumeVisualizer_C*>         UETools_BlockingVolumesVisualizers;                // 0x0B98(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ABP_VolumeVisualizer_C*>         UETools_TriggerVolumesVisualizers;                 // 0x0BA8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ABP_VolumeVisualizer_C*>         UETools_ActorsBoundsVisualizers;                   // 0x0BB8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	float                                         Original_Aspect_Ratio;                             // 0x0BC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWasOriginalAspectRatioStoren;                     // 0x0BCC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BCD[0x3];                                      // 0x0BCD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class APlayerCameraManager*, float>      CameraDefaultFOV;                                  // 0x0BD0(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	float                                         DEF_MWS_Speed;                                     // 0x0C20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C24[0x4];                                      // 0x0C24(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterMovementComponent*            DEF_MWS_CharMoveComponent;                         // 0x0C28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DEF_GRV_Scale;                                     // 0x0C30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C34[0x4];                                      // 0x0C34(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterMovementComponent*            DEF_GRV_CharMoveComponent;                         // 0x0C38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DEF_MAC_Value;                                     // 0x0C40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C44[0x4];                                      // 0x0C44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterMovementComponent*            DEF_MAC_CharMoveComponent;                         // 0x0C48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ViewActor_Original_Pawn_Reference;                 // 0x0C50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ActorController_C*                  ViewActor_Actor_Controller;                        // 0x0C58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlActor_Original_Pawn_Reference;              // 0x0C60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ActorController_C*                  ControlActor_Actor_Controller;                     // 0x0C68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Sound2D_CurrentlyPlaying;                          // 0x0C70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_UEToolsCommand>              UETools_Console_Commands;                          // 0x0C78(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInstanceDynamic*               UETools_World_Grid_Material;                       // 0x0C88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class APawn*, float>                     PlayersOnly_Paused_Pawns_Map;                      // 0x0C90(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class ABP_FreeCamera_C*                       FreeCamera_Reference;                              // 0x0CE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  FreeCamera_Original_Pawn_Reference;                // 0x0CE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PanoramaCamera_C*                   Panorama_Camera_Reference;                         // 0x0CF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  Panorama_Camera_Original_Pawn_Reference;           // 0x0CF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_DBDGameInstance(int32 EntryPoint);
	void Event_F__PanoramaScreenshotCreated();
	void Event_C__PanoramaScreenshot(const struct FTransform& Panorama_Camera_Transform, float FOV, float Rotation_Step, int32 Quality_Level);
	void Event_C__SilentSoftLoadAsset(TSoftClassPtr<class UClass> Object_Soft_Class);
	void Event_C__ClearConsole();
	void Event_C__Help_Implemintation();
	void Event_C__SoftConstructWidget(TSoftClassPtr<class UClass> Soft_Widget_Class);
	void Event_C__SoftLoadAsset(TSoftClassPtr<class UClass> Object_Soft_Class);
	void Event_C__SoftSummonPosses(TSoftClassPtr<class UClass> Actor_Soft_Class);
	void DestroyGameplayModdingBlueprints();
	void DestroyStartScreenModdingBlueprints();
	void DestroyLobbyModdingBlueprints();
	void Event_T__Cheat_Flying_Controls();
