#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkyLight_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_SkyLight_Base.BP_SkyLight_Base_C.ExecuteUbergraph_BP_SkyLight_Base
// 0x0040 (0x0040 - 0x0000)
struct BP_SkyLight_Base_C_ExecuteUbergraph_BP_SkyLight_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULightComponent*>                CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponent*                        CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Intensity;                      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkyLight_Base_C_ExecuteUbergraph_BP_SkyLight_Base) == 0x000008, "Wrong alignment on BP_SkyLight_Base_C_ExecuteUbergraph_BP_SkyLight_Base");
static_assert(sizeof(BP_SkyLight_Base_C_ExecuteUbergraph_BP_SkyLight_Base) == 0x000040, "Wrong size on BP_SkyLight_Base_C_ExecuteUbergraph_BP_SkyLight_Base");
static_assert(offsetof(BP_SkyLight_Base_C_ExecuteUbergraph_BP_SkyLight_Base, EntryPoint) == 0x000000, "Member 'BP_SkyLight_Base_C_ExecuteUbergraph_BP_SkyLight_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SkyLight_Base_C_ExecuteUbergraph_BP_SkyLight_Base, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000008, "Member 'BP_SkyLight_Base_C_ExecuteUbergraph_BP_SkyLight_Base::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyLight_Base_C_ExecuteUbergraph_BP_SkyLight_Base, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_SkyLight_Base_C_ExecuteUbergraph_BP_SkyLight_Base::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyLight_Base_C_ExecuteUbergraph_BP_SkyLight_Base, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_SkyLight_Base_C_ExecuteUbergraph_BP_SkyLight_Base::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkyLight_Base_C_ExecuteUbergraph_BP_SkyLight_Base, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BP_SkyLight_Base_C_ExecuteUbergraph_BP_SkyLight_Base::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkyLight_Base_C_ExecuteUbergraph_BP_SkyLight_Base, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_SkyLight_Base_C_ExecuteUbergraph_BP_SkyLight_Base::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SkyLight_Base_C_ExecuteUbergraph_BP_SkyLight_Base, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_SkyLight_Base_C_ExecuteUbergraph_BP_SkyLight_Base::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyLight_Base_C_ExecuteUbergraph_BP_SkyLight_Base, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'BP_SkyLight_Base_C_ExecuteUbergraph_BP_SkyLight_Base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyLight_Base_C_ExecuteUbergraph_BP_SkyLight_Base, K2Node_CustomEvent_Intensity) == 0x000038, "Member 'BP_SkyLight_Base_C_ExecuteUbergraph_BP_SkyLight_Base::K2Node_CustomEvent_Intensity' has a wrong offset!");

// Function BP_SkyLight_Base.BP_SkyLight_Base_C.Event UpdateIntensity
// 0x0004 (0x0004 - 0x0000)
struct BP_SkyLight_Base_C_Event_UpdateIntensity final
{
public:
	float                                         Intensity;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkyLight_Base_C_Event_UpdateIntensity) == 0x000004, "Wrong alignment on BP_SkyLight_Base_C_Event_UpdateIntensity");
static_assert(sizeof(BP_SkyLight_Base_C_Event_UpdateIntensity) == 0x000004, "Wrong size on BP_SkyLight_Base_C_Event_UpdateIntensity");
static_assert(offsetof(BP_SkyLight_Base_C_Event_UpdateIntensity, Intensity) == 0x000000, "Member 'BP_SkyLight_Base_C_Event_UpdateIntensity::Intensity' has a wrong offset!");

}

