#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StaticMeshContainer

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_StaticMeshContainer.BP_StaticMeshContainer_C.ExecuteUbergraph_BP_StaticMeshContainer
// 0x0008 (0x0008 - 0x0000)
struct BP_StaticMeshContainer_C_ExecuteUbergraph_BP_StaticMeshContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StaticMeshContainer_C_ExecuteUbergraph_BP_StaticMeshContainer) == 0x000004, "Wrong alignment on BP_StaticMeshContainer_C_ExecuteUbergraph_BP_StaticMeshContainer");
static_assert(sizeof(BP_StaticMeshContainer_C_ExecuteUbergraph_BP_StaticMeshContainer) == 0x000008, "Wrong size on BP_StaticMeshContainer_C_ExecuteUbergraph_BP_StaticMeshContainer");
static_assert(offsetof(BP_StaticMeshContainer_C_ExecuteUbergraph_BP_StaticMeshContainer, EntryPoint) == 0x000000, "Member 'BP_StaticMeshContainer_C_ExecuteUbergraph_BP_StaticMeshContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_StaticMeshContainer_C_ExecuteUbergraph_BP_StaticMeshContainer, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_StaticMeshContainer_C_ExecuteUbergraph_BP_StaticMeshContainer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StaticMeshContainer_C_ExecuteUbergraph_BP_StaticMeshContainer, CallFunc_SetStaticMesh_ReturnValue) == 0x000005, "Member 'BP_StaticMeshContainer_C_ExecuteUbergraph_BP_StaticMeshContainer::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

}

