#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StaticMeshContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_StaticMeshContainer.BP_StaticMeshContainer_C
// 0x0020 (0x0250 - 0x0230)
class ABP_StaticMeshContainer_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            StaticMeshToUse;                                   // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_StaticMeshContainer(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_StaticMeshContainer_C">();
	}
	static class ABP_StaticMeshContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_StaticMeshContainer_C>();
	}
};
static_assert(alignof(ABP_StaticMeshContainer_C) == 0x000008, "Wrong alignment on ABP_StaticMeshContainer_C");
static_assert(sizeof(ABP_StaticMeshContainer_C) == 0x000250, "Wrong size on ABP_StaticMeshContainer_C");
static_assert(offsetof(ABP_StaticMeshContainer_C, UberGraphFrame) == 0x000230, "Member 'ABP_StaticMeshContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_StaticMeshContainer_C, StaticMesh) == 0x000238, "Member 'ABP_StaticMeshContainer_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_StaticMeshContainer_C, DefaultSceneRoot) == 0x000240, "Member 'ABP_StaticMeshContainer_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_StaticMeshContainer_C, StaticMeshToUse) == 0x000248, "Member 'ABP_StaticMeshContainer_C::StaticMeshToUse' has a wrong offset!");

}

