#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkeletalMeshContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SkeletalMeshContainer.BP_SkeletalMeshContainer_C
// 0x0020 (0x0250 - 0x0230)
class ABP_SkeletalMeshContainer_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          SkeletalMeshToUse;                                 // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SkeletalMeshContainer(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SkeletalMeshContainer_C">();
	}
	static class ABP_SkeletalMeshContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SkeletalMeshContainer_C>();
	}
};
static_assert(alignof(ABP_SkeletalMeshContainer_C) == 0x000008, "Wrong alignment on ABP_SkeletalMeshContainer_C");
static_assert(sizeof(ABP_SkeletalMeshContainer_C) == 0x000250, "Wrong size on ABP_SkeletalMeshContainer_C");
static_assert(offsetof(ABP_SkeletalMeshContainer_C, UberGraphFrame) == 0x000230, "Member 'ABP_SkeletalMeshContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SkeletalMeshContainer_C, SkeletalMesh) == 0x000238, "Member 'ABP_SkeletalMeshContainer_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_SkeletalMeshContainer_C, DefaultSceneRoot) == 0x000240, "Member 'ABP_SkeletalMeshContainer_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_SkeletalMeshContainer_C, SkeletalMeshToUse) == 0x000248, "Member 'ABP_SkeletalMeshContainer_C::SkeletalMeshToUse' has a wrong offset!");

}

