#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VolumeVisualizer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VolumeVisualizer.BP_VolumeVisualizer_C
// 0x0020 (0x0250 - 0x0230)
class ABP_VolumeVisualizer_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   DisplayZone;                                       // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     DisplayZone_MaterialInterface;                     // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_VolumeVisualizer(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VolumeVisualizer_C">();
	}
	static class ABP_VolumeVisualizer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VolumeVisualizer_C>();
	}
};
static_assert(alignof(ABP_VolumeVisualizer_C) == 0x000008, "Wrong alignment on ABP_VolumeVisualizer_C");
static_assert(sizeof(ABP_VolumeVisualizer_C) == 0x000250, "Wrong size on ABP_VolumeVisualizer_C");
static_assert(offsetof(ABP_VolumeVisualizer_C, UberGraphFrame) == 0x000230, "Member 'ABP_VolumeVisualizer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_VolumeVisualizer_C, DisplayZone) == 0x000238, "Member 'ABP_VolumeVisualizer_C::DisplayZone' has a wrong offset!");
static_assert(offsetof(ABP_VolumeVisualizer_C, DefaultSceneRoot) == 0x000240, "Member 'ABP_VolumeVisualizer_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_VolumeVisualizer_C, DisplayZone_MaterialInterface) == 0x000248, "Member 'ABP_VolumeVisualizer_C::DisplayZone_MaterialInterface' has a wrong offset!");

}

