#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_DebugCamera

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPI_DebugCamera.BPI_DebugCamera_C.On Debug Camera Actor Selected
// 0x0018 (0x0018 - 0x0000)
struct BPI_DebugCamera_C_On_Debug_Camera_Actor_Selected final
{
public:
	class AActor*                                 Actor_Reference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Hit_Location;                                      // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_DebugCamera_C_On_Debug_Camera_Actor_Selected) == 0x000008, "Wrong alignment on BPI_DebugCamera_C_On_Debug_Camera_Actor_Selected");
static_assert(sizeof(BPI_DebugCamera_C_On_Debug_Camera_Actor_Selected) == 0x000018, "Wrong size on BPI_DebugCamera_C_On_Debug_Camera_Actor_Selected");
static_assert(offsetof(BPI_DebugCamera_C_On_Debug_Camera_Actor_Selected, Actor_Reference) == 0x000000, "Member 'BPI_DebugCamera_C_On_Debug_Camera_Actor_Selected::Actor_Reference' has a wrong offset!");
static_assert(offsetof(BPI_DebugCamera_C_On_Debug_Camera_Actor_Selected, Hit_Location) == 0x000008, "Member 'BPI_DebugCamera_C_On_Debug_Camera_Actor_Selected::Hit_Location' has a wrong offset!");

// Function BPI_DebugCamera.BPI_DebugCamera_C.On Debug Camera Activate
// 0x0008 (0x0008 - 0x0000)
struct BPI_DebugCamera_C_On_Debug_Camera_Activate final
{
public:
	class APlayerController*                      Original_PC;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_DebugCamera_C_On_Debug_Camera_Activate) == 0x000008, "Wrong alignment on BPI_DebugCamera_C_On_Debug_Camera_Activate");
static_assert(sizeof(BPI_DebugCamera_C_On_Debug_Camera_Activate) == 0x000008, "Wrong size on BPI_DebugCamera_C_On_Debug_Camera_Activate");
static_assert(offsetof(BPI_DebugCamera_C_On_Debug_Camera_Activate, Original_PC) == 0x000000, "Member 'BPI_DebugCamera_C_On_Debug_Camera_Activate::Original_PC' has a wrong offset!");

// Function BPI_DebugCamera.BPI_DebugCamera_C.On Debug Camera Deactivate
// 0x0008 (0x0008 - 0x0000)
struct BPI_DebugCamera_C_On_Debug_Camera_Deactivate final
{
public:
	class APlayerController*                      Restored_PC;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_DebugCamera_C_On_Debug_Camera_Deactivate) == 0x000008, "Wrong alignment on BPI_DebugCamera_C_On_Debug_Camera_Deactivate");
static_assert(sizeof(BPI_DebugCamera_C_On_Debug_Camera_Deactivate) == 0x000008, "Wrong size on BPI_DebugCamera_C_On_Debug_Camera_Deactivate");
static_assert(offsetof(BPI_DebugCamera_C_On_Debug_Camera_Deactivate, Restored_PC) == 0x000000, "Member 'BPI_DebugCamera_C_On_Debug_Camera_Deactivate::Restored_PC' has a wrong offset!");

}

