#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CoreMemory

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct CoreMemory.CoreMemoryStatusEffectDetails
// 0x0010 (0x0010 - 0x0000)
struct FCoreMemoryStatusEffectDetails final
{
public:
	float                                         EffectDuration;                                    // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CustomEffectParam;                                 // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UStatusEffect>              StatusEffect;                                      // 0x0008(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCoreMemoryStatusEffectDetails) == 0x000008, "Wrong alignment on FCoreMemoryStatusEffectDetails");
static_assert(sizeof(FCoreMemoryStatusEffectDetails) == 0x000010, "Wrong size on FCoreMemoryStatusEffectDetails");
static_assert(offsetof(FCoreMemoryStatusEffectDetails, EffectDuration) == 0x000000, "Member 'FCoreMemoryStatusEffectDetails::EffectDuration' has a wrong offset!");
static_assert(offsetof(FCoreMemoryStatusEffectDetails, CustomEffectParam) == 0x000004, "Member 'FCoreMemoryStatusEffectDetails::CustomEffectParam' has a wrong offset!");
static_assert(offsetof(FCoreMemoryStatusEffectDetails, StatusEffect) == 0x000008, "Member 'FCoreMemoryStatusEffectDetails::StatusEffect' has a wrong offset!");

}

