#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDCompetence

#include "Basic.hpp"

#include "DBDSharedTypes_structs.hpp"


namespace SDK
{

// Enum DBDCompetence.EImposeEffectTo
// NumValues: 0x0005
enum class EImposeEffectTo : uint8
{
	EventInstigator                          = 0,
	EventTarget                              = 1,
	AddonOwner                               = 2,
	AllSurvivors                             = 3,
	EImposeEffectTo_MAX                      = 4,
};

// Enum DBDCompetence.EMultiLingeringStateTagStrategy
// NumValues: 0x0003
enum class EMultiLingeringStateTagStrategy : uint8
{
	And                                      = 0,
	Or                                       = 1,
	EMultiLingeringStateTagStrategy_MAX      = 2,
};

// Enum DBDCompetence.EStatusEffectSpawnerReceiverStrategy
// NumValues: 0x0004
enum class EStatusEffectSpawnerReceiverStrategy : uint32
{
	AllCharacter                             = 0,
	PawnType                                 = 1,
	OriginatingPlayer                        = 2,
	EStatusEffectSpawnerReceiverStrategy_MAX = 3,
};

// Enum DBDCompetence.ESecondWindState
// NumValues: 0x0005
enum class ESecondWindState : uint8
{
	Loading                                  = 0,
	Locked                                   = 1,
	Available                                = 2,
	InUse                                    = 3,
	ESecondWindState_MAX                     = 4,
};

// Enum DBDCompetence.ETheMettleOfManPhase
// NumValues: 0x0006
enum class ETheMettleOfManPhase : uint8
{
	Uninitialized                            = 0,
	GainingTokens                            = 1,
	CancelNextAttack                         = 2,
	RevealWhenHealthy                        = 3,
	RevealedToKiller                         = 4,
	ETheMettleOfManPhase_MAX                 = 5,
};

// ScriptStruct DBDCompetence.WindowBlockableList
// 0x0010 (0x0010 - 0x0000)
struct FWindowBlockableList final
{
public:
	TArray<class UBlockableComponent*>            Blockables;                                        // 0x0000(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(FWindowBlockableList) == 0x000008, "Wrong alignment on FWindowBlockableList");
static_assert(sizeof(FWindowBlockableList) == 0x000010, "Wrong size on FWindowBlockableList");
static_assert(offsetof(FWindowBlockableList, Blockables) == 0x000000, "Member 'FWindowBlockableList::Blockables' has a wrong offset!");

// ScriptStruct DBDCompetence.StatusEffectSpawnData
// 0x0028 (0x0028 - 0x0000)
struct FStatusEffectSpawnData final
{
public:
	class FString                                 DEPRECATED_EffectId;                               // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UStatusEffect>              EffectClass;                                       // 0x0010(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CustomParam;                                       // 0x0018(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStatusEffectSpawnerReceiverStrategy          ReceiverStrategy;                                  // 0x001C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPawnType                                     PawnType;                                          // 0x0020(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SkipOriginatingPlayer;                             // 0x0021(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FStatusEffectSpawnData) == 0x000008, "Wrong alignment on FStatusEffectSpawnData");
static_assert(sizeof(FStatusEffectSpawnData) == 0x000028, "Wrong size on FStatusEffectSpawnData");
static_assert(offsetof(FStatusEffectSpawnData, DEPRECATED_EffectId) == 0x000000, "Member 'FStatusEffectSpawnData::DEPRECATED_EffectId' has a wrong offset!");
static_assert(offsetof(FStatusEffectSpawnData, EffectClass) == 0x000010, "Member 'FStatusEffectSpawnData::EffectClass' has a wrong offset!");
static_assert(offsetof(FStatusEffectSpawnData, CustomParam) == 0x000018, "Member 'FStatusEffectSpawnData::CustomParam' has a wrong offset!");
static_assert(offsetof(FStatusEffectSpawnData, ReceiverStrategy) == 0x00001C, "Member 'FStatusEffectSpawnData::ReceiverStrategy' has a wrong offset!");
static_assert(offsetof(FStatusEffectSpawnData, PawnType) == 0x000020, "Member 'FStatusEffectSpawnData::PawnType' has a wrong offset!");
static_assert(offsetof(FStatusEffectSpawnData, SkipOriginatingPlayer) == 0x000021, "Member 'FStatusEffectSpawnData::SkipOriginatingPlayer' has a wrong offset!");

// ScriptStruct DBDCompetence.PlayerStatusEffectSpawnerHelperInitParams
// 0x0028 (0x0028 - 0x0000)
struct FPlayerStatusEffectSpawnerHelperInitParams final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ADBDPlayer*                             OriginatingPlayer;                                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameplayModifierContainer*             OriginatingEffect;                                 // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FStatusEffectSpawnData>         EffectsToSpawn;                                    // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPlayerStatusEffectSpawnerHelperInitParams) == 0x000008, "Wrong alignment on FPlayerStatusEffectSpawnerHelperInitParams");
static_assert(sizeof(FPlayerStatusEffectSpawnerHelperInitParams) == 0x000028, "Wrong size on FPlayerStatusEffectSpawnerHelperInitParams");
static_assert(offsetof(FPlayerStatusEffectSpawnerHelperInitParams, WorldContextObject) == 0x000000, "Member 'FPlayerStatusEffectSpawnerHelperInitParams::WorldContextObject' has a wrong offset!");
static_assert(offsetof(FPlayerStatusEffectSpawnerHelperInitParams, OriginatingPlayer) == 0x000008, "Member 'FPlayerStatusEffectSpawnerHelperInitParams::OriginatingPlayer' has a wrong offset!");
static_assert(offsetof(FPlayerStatusEffectSpawnerHelperInitParams, OriginatingEffect) == 0x000010, "Member 'FPlayerStatusEffectSpawnerHelperInitParams::OriginatingEffect' has a wrong offset!");
static_assert(offsetof(FPlayerStatusEffectSpawnerHelperInitParams, EffectsToSpawn) == 0x000018, "Member 'FPlayerStatusEffectSpawnerHelperInitParams::EffectsToSpawn' has a wrong offset!");

// ScriptStruct DBDCompetence.PlayerStatusEffectSpawnerHelper
// 0x0088 (0x0088 - 0x0000)
struct FPlayerStatusEffectSpawnerHelper final
{
public:
	struct FPlayerStatusEffectSpawnerHelperInitParams _initParams;                                   // 0x0000(0x0028)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TSet<class UStatusEffect*>                    _spawnedEffects;                                   // 0x0028(0x0050)(ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x10];                                      // 0x0078(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPlayerStatusEffectSpawnerHelper) == 0x000008, "Wrong alignment on FPlayerStatusEffectSpawnerHelper");
static_assert(sizeof(FPlayerStatusEffectSpawnerHelper) == 0x000088, "Wrong size on FPlayerStatusEffectSpawnerHelper");
static_assert(offsetof(FPlayerStatusEffectSpawnerHelper, _initParams) == 0x000000, "Member 'FPlayerStatusEffectSpawnerHelper::_initParams' has a wrong offset!");
static_assert(offsetof(FPlayerStatusEffectSpawnerHelper, _spawnedEffects) == 0x000028, "Member 'FPlayerStatusEffectSpawnerHelper::_spawnedEffects' has a wrong offset!");

// ScriptStruct DBDCompetence.SimpleSpawnEffectsOnAllSurvivorsAddonParams
// 0x0020 (0x0020 - 0x0000)
struct FSimpleSpawnEffectsOnAllSurvivorsAddonParams final
{
public:
	class FName                                   _statusEffectIdDeprecated;                         // 0x0000(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _effectClass;                                      // 0x0010(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _customParam;                                      // 0x0018(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSimpleSpawnEffectsOnAllSurvivorsAddonParams) == 0x000008, "Wrong alignment on FSimpleSpawnEffectsOnAllSurvivorsAddonParams");
static_assert(sizeof(FSimpleSpawnEffectsOnAllSurvivorsAddonParams) == 0x000020, "Wrong size on FSimpleSpawnEffectsOnAllSurvivorsAddonParams");
static_assert(offsetof(FSimpleSpawnEffectsOnAllSurvivorsAddonParams, _statusEffectIdDeprecated) == 0x000000, "Member 'FSimpleSpawnEffectsOnAllSurvivorsAddonParams::_statusEffectIdDeprecated' has a wrong offset!");
static_assert(offsetof(FSimpleSpawnEffectsOnAllSurvivorsAddonParams, _effectClass) == 0x000010, "Member 'FSimpleSpawnEffectsOnAllSurvivorsAddonParams::_effectClass' has a wrong offset!");
static_assert(offsetof(FSimpleSpawnEffectsOnAllSurvivorsAddonParams, _customParam) == 0x000018, "Member 'FSimpleSpawnEffectsOnAllSurvivorsAddonParams::_customParam' has a wrong offset!");

// ScriptStruct DBDCompetence.PerkLevelEffectArray
// 0x0010 (0x0010 - 0x0000)
struct FPerkLevelEffectArray final
{
public:
	TArray<struct FStatusEffectSpawnData>         EffectsToSpawn;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPerkLevelEffectArray) == 0x000008, "Wrong alignment on FPerkLevelEffectArray");
static_assert(sizeof(FPerkLevelEffectArray) == 0x000010, "Wrong size on FPerkLevelEffectArray");
static_assert(offsetof(FPerkLevelEffectArray, EffectsToSpawn) == 0x000000, "Member 'FPerkLevelEffectArray::EffectsToSpawn' has a wrong offset!");

}

