#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDCosmetic

#include "Basic.hpp"


namespace SDK::Params
{

// Function DBDCosmetic.DBDActorIndicator.Cosmetic_UpdateIndicatorActivationStatus
// 0x0001 (0x0001 - 0x0000)
struct DBDActorIndicator_Cosmetic_UpdateIndicatorActivationStatus final
{
public:
	bool                                          isActivated;                                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDActorIndicator_Cosmetic_UpdateIndicatorActivationStatus) == 0x000001, "Wrong alignment on DBDActorIndicator_Cosmetic_UpdateIndicatorActivationStatus");
static_assert(sizeof(DBDActorIndicator_Cosmetic_UpdateIndicatorActivationStatus) == 0x000001, "Wrong size on DBDActorIndicator_Cosmetic_UpdateIndicatorActivationStatus");
static_assert(offsetof(DBDActorIndicator_Cosmetic_UpdateIndicatorActivationStatus, isActivated) == 0x000000, "Member 'DBDActorIndicator_Cosmetic_UpdateIndicatorActivationStatus::isActivated' has a wrong offset!");

// Function DBDCosmetic.DBDCosmeticModuleUtilities.GetCosmeticHelperActorsOfSurvivor
// 0x0018 (0x0018 - 0x0000)
struct DBDCosmeticModuleUtilities_GetCosmeticHelperActorsOfSurvivor final
{
public:
	const class ACamperPlayer*                    survivor;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ASurvivorCosmeticHelperActor*>   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDCosmeticModuleUtilities_GetCosmeticHelperActorsOfSurvivor) == 0x000008, "Wrong alignment on DBDCosmeticModuleUtilities_GetCosmeticHelperActorsOfSurvivor");
static_assert(sizeof(DBDCosmeticModuleUtilities_GetCosmeticHelperActorsOfSurvivor) == 0x000018, "Wrong size on DBDCosmeticModuleUtilities_GetCosmeticHelperActorsOfSurvivor");
static_assert(offsetof(DBDCosmeticModuleUtilities_GetCosmeticHelperActorsOfSurvivor, survivor) == 0x000000, "Member 'DBDCosmeticModuleUtilities_GetCosmeticHelperActorsOfSurvivor::survivor' has a wrong offset!");
static_assert(offsetof(DBDCosmeticModuleUtilities_GetCosmeticHelperActorsOfSurvivor, ReturnValue) == 0x000008, "Member 'DBDCosmeticModuleUtilities_GetCosmeticHelperActorsOfSurvivor::ReturnValue' has a wrong offset!");

// Function DBDCosmetic.DBDCosmeticModuleUtilities.GetCosmeticHelperActorsOfSurvivorByClass
// 0x0020 (0x0020 - 0x0000)
struct DBDCosmeticModuleUtilities_GetCosmeticHelperActorsOfSurvivorByClass final
{
public:
	const class ACamperPlayer*                    survivor;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ASurvivorCosmeticHelperActor> cosmeticHelperActorClassType;                    // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ASurvivorCosmeticHelperActor*>   ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDCosmeticModuleUtilities_GetCosmeticHelperActorsOfSurvivorByClass) == 0x000008, "Wrong alignment on DBDCosmeticModuleUtilities_GetCosmeticHelperActorsOfSurvivorByClass");
static_assert(sizeof(DBDCosmeticModuleUtilities_GetCosmeticHelperActorsOfSurvivorByClass) == 0x000020, "Wrong size on DBDCosmeticModuleUtilities_GetCosmeticHelperActorsOfSurvivorByClass");
static_assert(offsetof(DBDCosmeticModuleUtilities_GetCosmeticHelperActorsOfSurvivorByClass, survivor) == 0x000000, "Member 'DBDCosmeticModuleUtilities_GetCosmeticHelperActorsOfSurvivorByClass::survivor' has a wrong offset!");
static_assert(offsetof(DBDCosmeticModuleUtilities_GetCosmeticHelperActorsOfSurvivorByClass, cosmeticHelperActorClassType) == 0x000008, "Member 'DBDCosmeticModuleUtilities_GetCosmeticHelperActorsOfSurvivorByClass::cosmeticHelperActorClassType' has a wrong offset!");
static_assert(offsetof(DBDCosmeticModuleUtilities_GetCosmeticHelperActorsOfSurvivorByClass, ReturnValue) == 0x000010, "Member 'DBDCosmeticModuleUtilities_GetCosmeticHelperActorsOfSurvivorByClass::ReturnValue' has a wrong offset!");

// Function DBDCosmetic.SurvivorCosmeticHelperActor.Cosmetic_OnIsGettingMoriedStatusChanged
// 0x0001 (0x0001 - 0x0000)
struct SurvivorCosmeticHelperActor_Cosmetic_OnIsGettingMoriedStatusChanged final
{
public:
	bool                                          isGettingMoried;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SurvivorCosmeticHelperActor_Cosmetic_OnIsGettingMoriedStatusChanged) == 0x000001, "Wrong alignment on SurvivorCosmeticHelperActor_Cosmetic_OnIsGettingMoriedStatusChanged");
static_assert(sizeof(SurvivorCosmeticHelperActor_Cosmetic_OnIsGettingMoriedStatusChanged) == 0x000001, "Wrong size on SurvivorCosmeticHelperActor_Cosmetic_OnIsGettingMoriedStatusChanged");
static_assert(offsetof(SurvivorCosmeticHelperActor_Cosmetic_OnIsGettingMoriedStatusChanged, isGettingMoried) == 0x000000, "Member 'SurvivorCosmeticHelperActor_Cosmetic_OnIsGettingMoriedStatusChanged::isGettingMoried' has a wrong offset!");

// Function DBDCosmetic.SurvivorCosmeticHelperActor.Cosmetic_OnIsLocallyObservingSurvivorChanged
// 0x0001 (0x0001 - 0x0000)
struct SurvivorCosmeticHelperActor_Cosmetic_OnIsLocallyObservingSurvivorChanged final
{
public:
	bool                                          isLocallyObservingSurvivor;                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SurvivorCosmeticHelperActor_Cosmetic_OnIsLocallyObservingSurvivorChanged) == 0x000001, "Wrong alignment on SurvivorCosmeticHelperActor_Cosmetic_OnIsLocallyObservingSurvivorChanged");
static_assert(sizeof(SurvivorCosmeticHelperActor_Cosmetic_OnIsLocallyObservingSurvivorChanged) == 0x000001, "Wrong size on SurvivorCosmeticHelperActor_Cosmetic_OnIsLocallyObservingSurvivorChanged");
static_assert(offsetof(SurvivorCosmeticHelperActor_Cosmetic_OnIsLocallyObservingSurvivorChanged, isLocallyObservingSurvivor) == 0x000000, "Member 'SurvivorCosmeticHelperActor_Cosmetic_OnIsLocallyObservingSurvivorChanged::isLocallyObservingSurvivor' has a wrong offset!");

// Function DBDCosmetic.SurvivorCosmeticHelperActor.Cosmetic_OnSurvivorLinked
// 0x0008 (0x0008 - 0x0000)
struct SurvivorCosmeticHelperActor_Cosmetic_OnSurvivorLinked final
{
public:
	class ACamperPlayer*                          survivorLinked;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SurvivorCosmeticHelperActor_Cosmetic_OnSurvivorLinked) == 0x000008, "Wrong alignment on SurvivorCosmeticHelperActor_Cosmetic_OnSurvivorLinked");
static_assert(sizeof(SurvivorCosmeticHelperActor_Cosmetic_OnSurvivorLinked) == 0x000008, "Wrong size on SurvivorCosmeticHelperActor_Cosmetic_OnSurvivorLinked");
static_assert(offsetof(SurvivorCosmeticHelperActor_Cosmetic_OnSurvivorLinked, survivorLinked) == 0x000000, "Member 'SurvivorCosmeticHelperActor_Cosmetic_OnSurvivorLinked::survivorLinked' has a wrong offset!");

// Function DBDCosmetic.SurvivorCosmeticHelperActor.GetAudioComponent
// 0x0008 (0x0008 - 0x0000)
struct SurvivorCosmeticHelperActor_GetAudioComponent final
{
public:
	class UAkComponent*                           ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SurvivorCosmeticHelperActor_GetAudioComponent) == 0x000008, "Wrong alignment on SurvivorCosmeticHelperActor_GetAudioComponent");
static_assert(sizeof(SurvivorCosmeticHelperActor_GetAudioComponent) == 0x000008, "Wrong size on SurvivorCosmeticHelperActor_GetAudioComponent");
static_assert(offsetof(SurvivorCosmeticHelperActor_GetAudioComponent, ReturnValue) == 0x000000, "Member 'SurvivorCosmeticHelperActor_GetAudioComponent::ReturnValue' has a wrong offset!");

// Function DBDCosmetic.SurvivorCosmeticHelperActor.GetCustomizedSkeletalMesh
// 0x0008 (0x0008 - 0x0000)
struct SurvivorCosmeticHelperActor_GetCustomizedSkeletalMesh final
{
public:
	class UCustomizedSkeletalMesh*                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SurvivorCosmeticHelperActor_GetCustomizedSkeletalMesh) == 0x000008, "Wrong alignment on SurvivorCosmeticHelperActor_GetCustomizedSkeletalMesh");
static_assert(sizeof(SurvivorCosmeticHelperActor_GetCustomizedSkeletalMesh) == 0x000008, "Wrong size on SurvivorCosmeticHelperActor_GetCustomizedSkeletalMesh");
static_assert(offsetof(SurvivorCosmeticHelperActor_GetCustomizedSkeletalMesh, ReturnValue) == 0x000000, "Member 'SurvivorCosmeticHelperActor_GetCustomizedSkeletalMesh::ReturnValue' has a wrong offset!");

// Function DBDCosmetic.SurvivorCosmeticHelperActor.GetMaterialHelper
// 0x0008 (0x0008 - 0x0000)
struct SurvivorCosmeticHelperActor_GetMaterialHelper final
{
public:
	class UMaterialHelper*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SurvivorCosmeticHelperActor_GetMaterialHelper) == 0x000008, "Wrong alignment on SurvivorCosmeticHelperActor_GetMaterialHelper");
static_assert(sizeof(SurvivorCosmeticHelperActor_GetMaterialHelper) == 0x000008, "Wrong size on SurvivorCosmeticHelperActor_GetMaterialHelper");
static_assert(offsetof(SurvivorCosmeticHelperActor_GetMaterialHelper, ReturnValue) == 0x000000, "Member 'SurvivorCosmeticHelperActor_GetMaterialHelper::ReturnValue' has a wrong offset!");

// Function DBDCosmetic.SurvivorCosmeticHelperActor.GetSurvivor
// 0x0008 (0x0008 - 0x0000)
struct SurvivorCosmeticHelperActor_GetSurvivor final
{
public:
	class ACamperPlayer*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SurvivorCosmeticHelperActor_GetSurvivor) == 0x000008, "Wrong alignment on SurvivorCosmeticHelperActor_GetSurvivor");
static_assert(sizeof(SurvivorCosmeticHelperActor_GetSurvivor) == 0x000008, "Wrong size on SurvivorCosmeticHelperActor_GetSurvivor");
static_assert(offsetof(SurvivorCosmeticHelperActor_GetSurvivor, ReturnValue) == 0x000000, "Member 'SurvivorCosmeticHelperActor_GetSurvivor::ReturnValue' has a wrong offset!");

// Function DBDCosmetic.SurvivorCosmeticHelperActor.IsLocallyObserved
// 0x0001 (0x0001 - 0x0000)
struct SurvivorCosmeticHelperActor_IsLocallyObserved final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SurvivorCosmeticHelperActor_IsLocallyObserved) == 0x000001, "Wrong alignment on SurvivorCosmeticHelperActor_IsLocallyObserved");
static_assert(sizeof(SurvivorCosmeticHelperActor_IsLocallyObserved) == 0x000001, "Wrong size on SurvivorCosmeticHelperActor_IsLocallyObserved");
static_assert(offsetof(SurvivorCosmeticHelperActor_IsLocallyObserved, ReturnValue) == 0x000000, "Member 'SurvivorCosmeticHelperActor_IsLocallyObserved::ReturnValue' has a wrong offset!");

// Function DBDCosmetic.SurvivorCosmeticHelperSpawnerComponent.GetCosmeticHelperActorByClass
// 0x0018 (0x0018 - 0x0000)
struct SurvivorCosmeticHelperSpawnerComponent_GetCosmeticHelperActorByClass final
{
public:
	TSubclassOf<class ASurvivorCosmeticHelperActor> cosmeticHelperActorClassType;                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ASurvivorCosmeticHelperActor*>   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SurvivorCosmeticHelperSpawnerComponent_GetCosmeticHelperActorByClass) == 0x000008, "Wrong alignment on SurvivorCosmeticHelperSpawnerComponent_GetCosmeticHelperActorByClass");
static_assert(sizeof(SurvivorCosmeticHelperSpawnerComponent_GetCosmeticHelperActorByClass) == 0x000018, "Wrong size on SurvivorCosmeticHelperSpawnerComponent_GetCosmeticHelperActorByClass");
static_assert(offsetof(SurvivorCosmeticHelperSpawnerComponent_GetCosmeticHelperActorByClass, cosmeticHelperActorClassType) == 0x000000, "Member 'SurvivorCosmeticHelperSpawnerComponent_GetCosmeticHelperActorByClass::cosmeticHelperActorClassType' has a wrong offset!");
static_assert(offsetof(SurvivorCosmeticHelperSpawnerComponent_GetCosmeticHelperActorByClass, ReturnValue) == 0x000008, "Member 'SurvivorCosmeticHelperSpawnerComponent_GetCosmeticHelperActorByClass::ReturnValue' has a wrong offset!");

// Function DBDCosmetic.SurvivorCosmeticHelperSpawnerComponent.GetCosmeticHelperActors
// 0x0010 (0x0010 - 0x0000)
struct SurvivorCosmeticHelperSpawnerComponent_GetCosmeticHelperActors final
{
public:
	TArray<class ASurvivorCosmeticHelperActor*>   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SurvivorCosmeticHelperSpawnerComponent_GetCosmeticHelperActors) == 0x000008, "Wrong alignment on SurvivorCosmeticHelperSpawnerComponent_GetCosmeticHelperActors");
static_assert(sizeof(SurvivorCosmeticHelperSpawnerComponent_GetCosmeticHelperActors) == 0x000010, "Wrong size on SurvivorCosmeticHelperSpawnerComponent_GetCosmeticHelperActors");
static_assert(offsetof(SurvivorCosmeticHelperSpawnerComponent_GetCosmeticHelperActors, ReturnValue) == 0x000000, "Member 'SurvivorCosmeticHelperSpawnerComponent_GetCosmeticHelperActors::ReturnValue' has a wrong offset!");

}

