#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDCosmetic

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class DBDCosmetic.DBDActorIndicator
// 0x0008 (0x0238 - 0x0230)
class ADBDActorIndicator final : public AActor
{
public:
	bool                                          _isActivated;                                      // 0x0230(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_UpdateIndicatorActivationStatus(const bool isActivated);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DBDActorIndicator">();
	}
	static class ADBDActorIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADBDActorIndicator>();
	}
};
static_assert(alignof(ADBDActorIndicator) == 0x000008, "Wrong alignment on ADBDActorIndicator");
static_assert(sizeof(ADBDActorIndicator) == 0x000238, "Wrong size on ADBDActorIndicator");
static_assert(offsetof(ADBDActorIndicator, _isActivated) == 0x000230, "Member 'ADBDActorIndicator::_isActivated' has a wrong offset!");

// Class DBDCosmetic.DBDCosmeticModuleUtilities
// 0x0000 (0x0030 - 0x0030)
class UDBDCosmeticModuleUtilities final : public UBlueprintFunctionLibrary
{
public:
	static TArray<class ASurvivorCosmeticHelperActor*> GetCosmeticHelperActorsOfSurvivor(const class ACamperPlayer* survivor);
	static TArray<class ASurvivorCosmeticHelperActor*> GetCosmeticHelperActorsOfSurvivorByClass(const class ACamperPlayer* survivor, const TSubclassOf<class ASurvivorCosmeticHelperActor> cosmeticHelperActorClassType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DBDCosmeticModuleUtilities">();
	}
	static class UDBDCosmeticModuleUtilities* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDBDCosmeticModuleUtilities>();
	}
};
static_assert(alignof(UDBDCosmeticModuleUtilities) == 0x000008, "Wrong alignment on UDBDCosmeticModuleUtilities");
static_assert(sizeof(UDBDCosmeticModuleUtilities) == 0x000030, "Wrong size on UDBDCosmeticModuleUtilities");

// Class DBDCosmetic.SurvivorCosmeticHelperActor
// 0x0038 (0x0268 - 0x0230)
class ASurvivorCosmeticHelperActor : public AActor
{
public:
	uint8                                         Pad_230[0x38];                                     // 0x0230(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_OnIsGettingMoriedStatusChanged(bool isGettingMoried);
	void Cosmetic_OnIsLocallyObservingSurvivorChanged(bool isLocallyObservingSurvivor);
	void Cosmetic_OnSurvivorLinked(class ACamperPlayer* survivorLinked);

	class UAkComponent* GetAudioComponent() const;
	class UCustomizedSkeletalMesh* GetCustomizedSkeletalMesh() const;
	class UMaterialHelper* GetMaterialHelper() const;
	class ACamperPlayer* GetSurvivor() const;
	bool IsLocallyObserved() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SurvivorCosmeticHelperActor">();
	}
	static class ASurvivorCosmeticHelperActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASurvivorCosmeticHelperActor>();
	}
};
static_assert(alignof(ASurvivorCosmeticHelperActor) == 0x000008, "Wrong alignment on ASurvivorCosmeticHelperActor");
static_assert(sizeof(ASurvivorCosmeticHelperActor) == 0x000268, "Wrong size on ASurvivorCosmeticHelperActor");

// Class DBDCosmetic.SurvivorCosmeticHelperSpawnerComponent
// 0x0020 (0x00D8 - 0x00B8)
class USurvivorCosmeticHelperSpawnerComponent final : public UActorComponent
{
public:
	class UDataTable*                             _survivorCosmeticActorHelperDB;                    // 0x00B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class ASurvivorCosmeticHelperActor*>   survivorCosmeticHelperActors;                      // 0x00C0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0x8];                                       // 0x00D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<class ASurvivorCosmeticHelperActor*> GetCosmeticHelperActorByClass(const TSubclassOf<class ASurvivorCosmeticHelperActor> cosmeticHelperActorClassType) const;
	TArray<class ASurvivorCosmeticHelperActor*> GetCosmeticHelperActors() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SurvivorCosmeticHelperSpawnerComponent">();
	}
	static class USurvivorCosmeticHelperSpawnerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USurvivorCosmeticHelperSpawnerComponent>();
	}
};
static_assert(alignof(USurvivorCosmeticHelperSpawnerComponent) == 0x000008, "Wrong alignment on USurvivorCosmeticHelperSpawnerComponent");
static_assert(sizeof(USurvivorCosmeticHelperSpawnerComponent) == 0x0000D8, "Wrong size on USurvivorCosmeticHelperSpawnerComponent");
static_assert(offsetof(USurvivorCosmeticHelperSpawnerComponent, _survivorCosmeticActorHelperDB) == 0x0000B8, "Member 'USurvivorCosmeticHelperSpawnerComponent::_survivorCosmeticActorHelperDB' has a wrong offset!");
static_assert(offsetof(USurvivorCosmeticHelperSpawnerComponent, survivorCosmeticHelperActors) == 0x0000C0, "Member 'USurvivorCosmeticHelperSpawnerComponent::survivorCosmeticHelperActors' has a wrong offset!");

}

