#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDCompetence

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayUtilities_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "Engine_structs.hpp"
#include "StatSystem_structs.hpp"


namespace SDK::Params
{

// Function DBDCompetence.HasPlayerReachedWiggleFillPercentCondition.Authority_OnOwnerWiggleChargePercentChanged
// 0x0010 (0x0010 - 0x0000)
struct HasPlayerReachedWiggleFillPercentCondition_Authority_OnOwnerWiggleChargePercentChanged final
{
public:
	class UChargeableComponent*                   chargeableComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         percentCompletionChange;                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         totalPercentComplete;                              // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HasPlayerReachedWiggleFillPercentCondition_Authority_OnOwnerWiggleChargePercentChanged) == 0x000008, "Wrong alignment on HasPlayerReachedWiggleFillPercentCondition_Authority_OnOwnerWiggleChargePercentChanged");
static_assert(sizeof(HasPlayerReachedWiggleFillPercentCondition_Authority_OnOwnerWiggleChargePercentChanged) == 0x000010, "Wrong size on HasPlayerReachedWiggleFillPercentCondition_Authority_OnOwnerWiggleChargePercentChanged");
static_assert(offsetof(HasPlayerReachedWiggleFillPercentCondition_Authority_OnOwnerWiggleChargePercentChanged, chargeableComponent) == 0x000000, "Member 'HasPlayerReachedWiggleFillPercentCondition_Authority_OnOwnerWiggleChargePercentChanged::chargeableComponent' has a wrong offset!");
static_assert(offsetof(HasPlayerReachedWiggleFillPercentCondition_Authority_OnOwnerWiggleChargePercentChanged, percentCompletionChange) == 0x000008, "Member 'HasPlayerReachedWiggleFillPercentCondition_Authority_OnOwnerWiggleChargePercentChanged::percentCompletionChange' has a wrong offset!");
static_assert(offsetof(HasPlayerReachedWiggleFillPercentCondition_Authority_OnOwnerWiggleChargePercentChanged, totalPercentComplete) == 0x00000C, "Member 'HasPlayerReachedWiggleFillPercentCondition_Authority_OnOwnerWiggleChargePercentChanged::totalPercentComplete' has a wrong offset!");

// Function DBDCompetence.NoOneLeftBehind.Authority_OnExitGatePoweredApplicableChanged
// 0x0010 (0x0010 - 0x0000)
struct NoOneLeftBehind_Authority_OnExitGatePoweredApplicableChanged final
{
public:
	class UGameplayModifierContainer*             container;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          active;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NoOneLeftBehind_Authority_OnExitGatePoweredApplicableChanged) == 0x000008, "Wrong alignment on NoOneLeftBehind_Authority_OnExitGatePoweredApplicableChanged");
static_assert(sizeof(NoOneLeftBehind_Authority_OnExitGatePoweredApplicableChanged) == 0x000010, "Wrong size on NoOneLeftBehind_Authority_OnExitGatePoweredApplicableChanged");
static_assert(offsetof(NoOneLeftBehind_Authority_OnExitGatePoweredApplicableChanged, container) == 0x000000, "Member 'NoOneLeftBehind_Authority_OnExitGatePoweredApplicableChanged::container' has a wrong offset!");
static_assert(offsetof(NoOneLeftBehind_Authority_OnExitGatePoweredApplicableChanged, active) == 0x000008, "Member 'NoOneLeftBehind_Authority_OnExitGatePoweredApplicableChanged::active' has a wrong offset!");

// Function DBDCompetence.HeadOn.Multicast_TriggerStunOnActor
// 0x0010 (0x0010 - 0x0000)
struct HeadOn_Multicast_TriggerStunOnActor final
{
public:
	class UObject*                                stunnableInterfaceUObject;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ADBDPlayer*                             stunner;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadOn_Multicast_TriggerStunOnActor) == 0x000008, "Wrong alignment on HeadOn_Multicast_TriggerStunOnActor");
static_assert(sizeof(HeadOn_Multicast_TriggerStunOnActor) == 0x000010, "Wrong size on HeadOn_Multicast_TriggerStunOnActor");
static_assert(offsetof(HeadOn_Multicast_TriggerStunOnActor, stunnableInterfaceUObject) == 0x000000, "Member 'HeadOn_Multicast_TriggerStunOnActor::stunnableInterfaceUObject' has a wrong offset!");
static_assert(offsetof(HeadOn_Multicast_TriggerStunOnActor, stunner) == 0x000008, "Member 'HeadOn_Multicast_TriggerStunOnActor::stunner' has a wrong offset!");

// Function DBDCompetence.HeadOn.OnPawnOverlapEnter
// 0x00B0 (0x00B0 - 0x0000)
struct HeadOn_OnPawnOverlapEnter final
{
public:
	class UPrimitiveComponent*                    hitComponent;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 otherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    otherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         otherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             sweepResult;                                       // 0x0020(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadOn_OnPawnOverlapEnter) == 0x000008, "Wrong alignment on HeadOn_OnPawnOverlapEnter");
static_assert(sizeof(HeadOn_OnPawnOverlapEnter) == 0x0000B0, "Wrong size on HeadOn_OnPawnOverlapEnter");
static_assert(offsetof(HeadOn_OnPawnOverlapEnter, hitComponent) == 0x000000, "Member 'HeadOn_OnPawnOverlapEnter::hitComponent' has a wrong offset!");
static_assert(offsetof(HeadOn_OnPawnOverlapEnter, otherActor) == 0x000008, "Member 'HeadOn_OnPawnOverlapEnter::otherActor' has a wrong offset!");
static_assert(offsetof(HeadOn_OnPawnOverlapEnter, otherComp) == 0x000010, "Member 'HeadOn_OnPawnOverlapEnter::otherComp' has a wrong offset!");
static_assert(offsetof(HeadOn_OnPawnOverlapEnter, otherBodyIndex) == 0x000018, "Member 'HeadOn_OnPawnOverlapEnter::otherBodyIndex' has a wrong offset!");
static_assert(offsetof(HeadOn_OnPawnOverlapEnter, bFromSweep) == 0x00001C, "Member 'HeadOn_OnPawnOverlapEnter::bFromSweep' has a wrong offset!");
static_assert(offsetof(HeadOn_OnPawnOverlapEnter, sweepResult) == 0x000020, "Member 'HeadOn_OnPawnOverlapEnter::sweepResult' has a wrong offset!");

// Function DBDCompetence.HeadOn.OnPawnOverlapExit
// 0x0020 (0x0020 - 0x0000)
struct HeadOn_OnPawnOverlapExit final
{
public:
	class UPrimitiveComponent*                    hitComponent;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 otherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    otherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         otherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HeadOn_OnPawnOverlapExit) == 0x000008, "Wrong alignment on HeadOn_OnPawnOverlapExit");
static_assert(sizeof(HeadOn_OnPawnOverlapExit) == 0x000020, "Wrong size on HeadOn_OnPawnOverlapExit");
static_assert(offsetof(HeadOn_OnPawnOverlapExit, hitComponent) == 0x000000, "Member 'HeadOn_OnPawnOverlapExit::hitComponent' has a wrong offset!");
static_assert(offsetof(HeadOn_OnPawnOverlapExit, otherActor) == 0x000008, "Member 'HeadOn_OnPawnOverlapExit::otherActor' has a wrong offset!");
static_assert(offsetof(HeadOn_OnPawnOverlapExit, otherComp) == 0x000010, "Member 'HeadOn_OnPawnOverlapExit::otherComp' has a wrong offset!");
static_assert(offsetof(HeadOn_OnPawnOverlapExit, otherBodyIndex) == 0x000018, "Member 'HeadOn_OnPawnOverlapExit::otherBodyIndex' has a wrong offset!");

// Function DBDCompetence.HeadOn.CanApplyHeadOnInteraction
// 0x0001 (0x0001 - 0x0000)
struct HeadOn_CanApplyHeadOnInteraction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadOn_CanApplyHeadOnInteraction) == 0x000001, "Wrong alignment on HeadOn_CanApplyHeadOnInteraction");
static_assert(sizeof(HeadOn_CanApplyHeadOnInteraction) == 0x000001, "Wrong size on HeadOn_CanApplyHeadOnInteraction");
static_assert(offsetof(HeadOn_CanApplyHeadOnInteraction, ReturnValue) == 0x000000, "Member 'HeadOn_CanApplyHeadOnInteraction::ReturnValue' has a wrong offset!");

// Function DBDCompetence.HeadOn.GetHideDuration
// 0x0004 (0x0004 - 0x0000)
struct HeadOn_GetHideDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadOn_GetHideDuration) == 0x000004, "Wrong alignment on HeadOn_GetHideDuration");
static_assert(sizeof(HeadOn_GetHideDuration) == 0x000004, "Wrong size on HeadOn_GetHideDuration");
static_assert(offsetof(HeadOn_GetHideDuration, ReturnValue) == 0x000000, "Member 'HeadOn_GetHideDuration::ReturnValue' has a wrong offset!");

// Function DBDCompetence.ActivatableEnduranceEffect.Authority_Start
// 0x0004 (0x0004 - 0x0000)
struct ActivatableEnduranceEffect_Authority_Start final
{
public:
	float                                         duration;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActivatableEnduranceEffect_Authority_Start) == 0x000004, "Wrong alignment on ActivatableEnduranceEffect_Authority_Start");
static_assert(sizeof(ActivatableEnduranceEffect_Authority_Start) == 0x000004, "Wrong size on ActivatableEnduranceEffect_Authority_Start");
static_assert(offsetof(ActivatableEnduranceEffect_Authority_Start, duration) == 0x000000, "Member 'ActivatableEnduranceEffect_Authority_Start::duration' has a wrong offset!");

// Function DBDCompetence.HemorrhageStatusEffect.Authority_OnSurvivorHealed
// 0x0018 (0x0018 - 0x0000)
struct HemorrhageStatusEffect_Authority_OnSurvivorHealed final
{
public:
	struct FCamperHealResult                      healResult;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(HemorrhageStatusEffect_Authority_OnSurvivorHealed) == 0x000008, "Wrong alignment on HemorrhageStatusEffect_Authority_OnSurvivorHealed");
static_assert(sizeof(HemorrhageStatusEffect_Authority_OnSurvivorHealed) == 0x000018, "Wrong size on HemorrhageStatusEffect_Authority_OnSurvivorHealed");
static_assert(offsetof(HemorrhageStatusEffect_Authority_OnSurvivorHealed, healResult) == 0x000000, "Member 'HemorrhageStatusEffect_Authority_OnSurvivorHealed::healResult' has a wrong offset!");

// Function DBDCompetence.HemorrhageStatusEffect.OnStoppedHealing
// 0x0010 (0x0010 - 0x0000)
struct HemorrhageStatusEffect_OnStoppedHealing final
{
public:
	const class ADBDPlayer*                       instigator;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class ADBDPlayer*                       target;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HemorrhageStatusEffect_OnStoppedHealing) == 0x000008, "Wrong alignment on HemorrhageStatusEffect_OnStoppedHealing");
static_assert(sizeof(HemorrhageStatusEffect_OnStoppedHealing) == 0x000010, "Wrong size on HemorrhageStatusEffect_OnStoppedHealing");
static_assert(offsetof(HemorrhageStatusEffect_OnStoppedHealing, instigator) == 0x000000, "Member 'HemorrhageStatusEffect_OnStoppedHealing::instigator' has a wrong offset!");
static_assert(offsetof(HemorrhageStatusEffect_OnStoppedHealing, target) == 0x000008, "Member 'HemorrhageStatusEffect_OnStoppedHealing::target' has a wrong offset!");

// Function DBDCompetence.BaseLingeringStatusEffect.SetLingerDuration
// 0x0004 (0x0004 - 0x0000)
struct BaseLingeringStatusEffect_SetLingerDuration final
{
public:
	float                                         lingerDuration;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseLingeringStatusEffect_SetLingerDuration) == 0x000004, "Wrong alignment on BaseLingeringStatusEffect_SetLingerDuration");
static_assert(sizeof(BaseLingeringStatusEffect_SetLingerDuration) == 0x000004, "Wrong size on BaseLingeringStatusEffect_SetLingerDuration");
static_assert(offsetof(BaseLingeringStatusEffect_SetLingerDuration, lingerDuration) == 0x000000, "Member 'BaseLingeringStatusEffect_SetLingerDuration::lingerDuration' has a wrong offset!");

// Function DBDCompetence.HexPerk.Authority_RevealCurseToAllSurvivors
// 0x0001 (0x0001 - 0x0000)
struct HexPerk_Authority_RevealCurseToAllSurvivors final
{
public:
	bool                                          revealed;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HexPerk_Authority_RevealCurseToAllSurvivors) == 0x000001, "Wrong alignment on HexPerk_Authority_RevealCurseToAllSurvivors");
static_assert(sizeof(HexPerk_Authority_RevealCurseToAllSurvivors) == 0x000001, "Wrong size on HexPerk_Authority_RevealCurseToAllSurvivors");
static_assert(offsetof(HexPerk_Authority_RevealCurseToAllSurvivors, revealed) == 0x000000, "Member 'HexPerk_Authority_RevealCurseToAllSurvivors::revealed' has a wrong offset!");

// Function DBDCompetence.HexPerk.Authority_SetCurseRevealedToPlayer
// 0x0010 (0x0010 - 0x0000)
struct HexPerk_Authority_SetCurseRevealedToPlayer final
{
public:
	class ADBDPlayer*                             player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          revealed;                                          // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HexPerk_Authority_SetCurseRevealedToPlayer) == 0x000008, "Wrong alignment on HexPerk_Authority_SetCurseRevealedToPlayer");
static_assert(sizeof(HexPerk_Authority_SetCurseRevealedToPlayer) == 0x000010, "Wrong size on HexPerk_Authority_SetCurseRevealedToPlayer");
static_assert(offsetof(HexPerk_Authority_SetCurseRevealedToPlayer, player) == 0x000000, "Member 'HexPerk_Authority_SetCurseRevealedToPlayer::player' has a wrong offset!");
static_assert(offsetof(HexPerk_Authority_SetCurseRevealedToPlayer, revealed) == 0x000008, "Member 'HexPerk_Authority_SetCurseRevealedToPlayer::revealed' has a wrong offset!");

// Function DBDCompetence.HexPerk.IsCurseRevealedToPlayer
// 0x0010 (0x0010 - 0x0000)
struct HexPerk_IsCurseRevealedToPlayer final
{
public:
	const class ADBDPlayer*                       player;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HexPerk_IsCurseRevealedToPlayer) == 0x000008, "Wrong alignment on HexPerk_IsCurseRevealedToPlayer");
static_assert(sizeof(HexPerk_IsCurseRevealedToPlayer) == 0x000010, "Wrong size on HexPerk_IsCurseRevealedToPlayer");
static_assert(offsetof(HexPerk_IsCurseRevealedToPlayer, player) == 0x000000, "Member 'HexPerk_IsCurseRevealedToPlayer::player' has a wrong offset!");
static_assert(offsetof(HexPerk_IsCurseRevealedToPlayer, ReturnValue) == 0x000008, "Member 'HexPerk_IsCurseRevealedToPlayer::ReturnValue' has a wrong offset!");

// Function DBDCompetence.Whispers.Multicast_FireAudioEvent
// 0x0004 (0x0004 - 0x0000)
struct Whispers_Multicast_FireAudioEvent final
{
public:
	int32                                         survivorsInRange;                                  // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Whispers_Multicast_FireAudioEvent) == 0x000004, "Wrong alignment on Whispers_Multicast_FireAudioEvent");
static_assert(sizeof(Whispers_Multicast_FireAudioEvent) == 0x000004, "Wrong size on Whispers_Multicast_FireAudioEvent");
static_assert(offsetof(Whispers_Multicast_FireAudioEvent, survivorsInRange) == 0x000000, "Member 'Whispers_Multicast_FireAudioEvent::survivorsInRange' has a wrong offset!");

// Function DBDCompetence.HexDevourHope.GetMoveSpeedIncrement
// 0x0008 (0x0008 - 0x0000)
struct HexDevourHope_GetMoveSpeedIncrement final
{
public:
	int32                                         perkLevel;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HexDevourHope_GetMoveSpeedIncrement) == 0x000004, "Wrong alignment on HexDevourHope_GetMoveSpeedIncrement");
static_assert(sizeof(HexDevourHope_GetMoveSpeedIncrement) == 0x000008, "Wrong size on HexDevourHope_GetMoveSpeedIncrement");
static_assert(offsetof(HexDevourHope_GetMoveSpeedIncrement, perkLevel) == 0x000000, "Member 'HexDevourHope_GetMoveSpeedIncrement::perkLevel' has a wrong offset!");
static_assert(offsetof(HexDevourHope_GetMoveSpeedIncrement, ReturnValue) == 0x000004, "Member 'HexDevourHope_GetMoveSpeedIncrement::ReturnValue' has a wrong offset!");

// Function DBDCompetence.HexDevourHope.GetRangeFromUnhookedSurvivorNeeded
// 0x0008 (0x0008 - 0x0000)
struct HexDevourHope_GetRangeFromUnhookedSurvivorNeeded final
{
public:
	int32                                         perkLevel;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HexDevourHope_GetRangeFromUnhookedSurvivorNeeded) == 0x000004, "Wrong alignment on HexDevourHope_GetRangeFromUnhookedSurvivorNeeded");
static_assert(sizeof(HexDevourHope_GetRangeFromUnhookedSurvivorNeeded) == 0x000008, "Wrong size on HexDevourHope_GetRangeFromUnhookedSurvivorNeeded");
static_assert(offsetof(HexDevourHope_GetRangeFromUnhookedSurvivorNeeded, perkLevel) == 0x000000, "Member 'HexDevourHope_GetRangeFromUnhookedSurvivorNeeded::perkLevel' has a wrong offset!");
static_assert(offsetof(HexDevourHope_GetRangeFromUnhookedSurvivorNeeded, ReturnValue) == 0x000004, "Member 'HexDevourHope_GetRangeFromUnhookedSurvivorNeeded::ReturnValue' has a wrong offset!");

// Function DBDCompetence.KillerSubjectProvider.RegisterWhenKillerSet
// 0x0008 (0x0008 - 0x0000)
struct KillerSubjectProvider_RegisterWhenKillerSet final
{
public:
	class ASlasherPlayer*                         killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KillerSubjectProvider_RegisterWhenKillerSet) == 0x000008, "Wrong alignment on KillerSubjectProvider_RegisterWhenKillerSet");
static_assert(sizeof(KillerSubjectProvider_RegisterWhenKillerSet) == 0x000008, "Wrong size on KillerSubjectProvider_RegisterWhenKillerSet");
static_assert(offsetof(KillerSubjectProvider_RegisterWhenKillerSet, killer) == 0x000000, "Member 'KillerSubjectProvider_RegisterWhenKillerSet::killer' has a wrong offset!");

// Function DBDCompetence.ActivatableExhaustedEffect.Authority_OnHookCamper
// 0x0038 (0x0038 - 0x0000)
struct ActivatableExhaustedEffect_Authority_OnHookCamper final
{
public:
	struct FGameplayTag                           gameEvent;                                         // 0x0000(0x000C)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         gameEventData;                                     // 0x0010(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActivatableExhaustedEffect_Authority_OnHookCamper) == 0x000008, "Wrong alignment on ActivatableExhaustedEffect_Authority_OnHookCamper");
static_assert(sizeof(ActivatableExhaustedEffect_Authority_OnHookCamper) == 0x000038, "Wrong size on ActivatableExhaustedEffect_Authority_OnHookCamper");
static_assert(offsetof(ActivatableExhaustedEffect_Authority_OnHookCamper, gameEvent) == 0x000000, "Member 'ActivatableExhaustedEffect_Authority_OnHookCamper::gameEvent' has a wrong offset!");
static_assert(offsetof(ActivatableExhaustedEffect_Authority_OnHookCamper, gameEventData) == 0x000010, "Member 'ActivatableExhaustedEffect_Authority_OnHookCamper::gameEventData' has a wrong offset!");

// Function DBDCompetence.ActivatableExhaustedEffect.Authority_Start
// 0x0004 (0x0004 - 0x0000)
struct ActivatableExhaustedEffect_Authority_Start final
{
public:
	float                                         duration;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActivatableExhaustedEffect_Authority_Start) == 0x000004, "Wrong alignment on ActivatableExhaustedEffect_Authority_Start");
static_assert(sizeof(ActivatableExhaustedEffect_Authority_Start) == 0x000004, "Wrong size on ActivatableExhaustedEffect_Authority_Start");
static_assert(offsetof(ActivatableExhaustedEffect_Authority_Start, duration) == 0x000000, "Member 'ActivatableExhaustedEffect_Authority_Start::duration' has a wrong offset!");

// Function DBDCompetence.Adrenaline.Multicast_DispatchAdrenalineEvents
// 0x0008 (0x0008 - 0x0000)
struct Adrenaline_Multicast_DispatchAdrenalineEvents final
{
public:
	bool                                          isHealthy;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         healAmount;                                        // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Adrenaline_Multicast_DispatchAdrenalineEvents) == 0x000004, "Wrong alignment on Adrenaline_Multicast_DispatchAdrenalineEvents");
static_assert(sizeof(Adrenaline_Multicast_DispatchAdrenalineEvents) == 0x000008, "Wrong size on Adrenaline_Multicast_DispatchAdrenalineEvents");
static_assert(offsetof(Adrenaline_Multicast_DispatchAdrenalineEvents, isHealthy) == 0x000000, "Member 'Adrenaline_Multicast_DispatchAdrenalineEvents::isHealthy' has a wrong offset!");
static_assert(offsetof(Adrenaline_Multicast_DispatchAdrenalineEvents, healAmount) == 0x000004, "Member 'Adrenaline_Multicast_DispatchAdrenalineEvents::healAmount' has a wrong offset!");

// Function DBDCompetence.AnyActorPairQueryRangeIsTrue.OnInRangeChanged
// 0x0001 (0x0001 - 0x0000)
struct AnyActorPairQueryRangeIsTrue_OnInRangeChanged final
{
public:
	bool                                          inRange;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnyActorPairQueryRangeIsTrue_OnInRangeChanged) == 0x000001, "Wrong alignment on AnyActorPairQueryRangeIsTrue_OnInRangeChanged");
static_assert(sizeof(AnyActorPairQueryRangeIsTrue_OnInRangeChanged) == 0x000001, "Wrong size on AnyActorPairQueryRangeIsTrue_OnInRangeChanged");
static_assert(offsetof(AnyActorPairQueryRangeIsTrue_OnInRangeChanged, inRange) == 0x000000, "Member 'AnyActorPairQueryRangeIsTrue_OnInRangeChanged::inRange' has a wrong offset!");

// Function DBDCompetence.AnyMeansNecessary.Authority_OnPalletPulledUp
// 0x0038 (0x0038 - 0x0000)
struct AnyMeansNecessary_Authority_OnPalletPulledUp final
{
public:
	struct FGameplayTag                           gameplayTag;                                       // 0x0000(0x000C)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         gameEventData;                                     // 0x0010(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnyMeansNecessary_Authority_OnPalletPulledUp) == 0x000008, "Wrong alignment on AnyMeansNecessary_Authority_OnPalletPulledUp");
static_assert(sizeof(AnyMeansNecessary_Authority_OnPalletPulledUp) == 0x000038, "Wrong size on AnyMeansNecessary_Authority_OnPalletPulledUp");
static_assert(offsetof(AnyMeansNecessary_Authority_OnPalletPulledUp, gameplayTag) == 0x000000, "Member 'AnyMeansNecessary_Authority_OnPalletPulledUp::gameplayTag' has a wrong offset!");
static_assert(offsetof(AnyMeansNecessary_Authority_OnPalletPulledUp, gameEventData) == 0x000010, "Member 'AnyMeansNecessary_Authority_OnPalletPulledUp::gameEventData' has a wrong offset!");

// Function DBDCompetence.AnySurvivorHasObjectState.OnSurvivorAdded
// 0x0008 (0x0008 - 0x0000)
struct AnySurvivorHasObjectState_OnSurvivorAdded final
{
public:
	class ACamperPlayer*                          survivor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnySurvivorHasObjectState_OnSurvivorAdded) == 0x000008, "Wrong alignment on AnySurvivorHasObjectState_OnSurvivorAdded");
static_assert(sizeof(AnySurvivorHasObjectState_OnSurvivorAdded) == 0x000008, "Wrong size on AnySurvivorHasObjectState_OnSurvivorAdded");
static_assert(offsetof(AnySurvivorHasObjectState_OnSurvivorAdded, survivor) == 0x000000, "Member 'AnySurvivorHasObjectState_OnSurvivorAdded::survivor' has a wrong offset!");

// Function DBDCompetence.AnySurvivorHasObjectState.OnSurvivorRemoved
// 0x0008 (0x0008 - 0x0000)
struct AnySurvivorHasObjectState_OnSurvivorRemoved final
{
public:
	class ACamperPlayer*                          survivor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnySurvivorHasObjectState_OnSurvivorRemoved) == 0x000008, "Wrong alignment on AnySurvivorHasObjectState_OnSurvivorRemoved");
static_assert(sizeof(AnySurvivorHasObjectState_OnSurvivorRemoved) == 0x000008, "Wrong size on AnySurvivorHasObjectState_OnSurvivorRemoved");
static_assert(offsetof(AnySurvivorHasObjectState_OnSurvivorRemoved, survivor) == 0x000000, "Member 'AnySurvivorHasObjectState_OnSurvivorRemoved::survivor' has a wrong offset!");

// Function DBDCompetence.RemoveOnOriginatingSurvivorGoneStatusEffect.Authority_OnSurvivorRemoved
// 0x0008 (0x0008 - 0x0000)
struct RemoveOnOriginatingSurvivorGoneStatusEffect_Authority_OnSurvivorRemoved final
{
public:
	class ACamperPlayer*                          survivor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RemoveOnOriginatingSurvivorGoneStatusEffect_Authority_OnSurvivorRemoved) == 0x000008, "Wrong alignment on RemoveOnOriginatingSurvivorGoneStatusEffect_Authority_OnSurvivorRemoved");
static_assert(sizeof(RemoveOnOriginatingSurvivorGoneStatusEffect_Authority_OnSurvivorRemoved) == 0x000008, "Wrong size on RemoveOnOriginatingSurvivorGoneStatusEffect_Authority_OnSurvivorRemoved");
static_assert(offsetof(RemoveOnOriginatingSurvivorGoneStatusEffect_Authority_OnSurvivorRemoved, survivor) == 0x000000, "Member 'RemoveOnOriginatingSurvivorGoneStatusEffect_Authority_OnSurvivorRemoved::survivor' has a wrong offset!");

// Function DBDCompetence.ProveThyselfEffect.OnInRangeOfOriginatorChanged
// 0x0010 (0x0010 - 0x0000)
struct ProveThyselfEffect_OnInRangeOfOriginatorChanged final
{
public:
	bool                                          inRange;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          survivor;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProveThyselfEffect_OnInRangeOfOriginatorChanged) == 0x000008, "Wrong alignment on ProveThyselfEffect_OnInRangeOfOriginatorChanged");
static_assert(sizeof(ProveThyselfEffect_OnInRangeOfOriginatorChanged) == 0x000010, "Wrong size on ProveThyselfEffect_OnInRangeOfOriginatorChanged");
static_assert(offsetof(ProveThyselfEffect_OnInRangeOfOriginatorChanged, inRange) == 0x000000, "Member 'ProveThyselfEffect_OnInRangeOfOriginatorChanged::inRange' has a wrong offset!");
static_assert(offsetof(ProveThyselfEffect_OnInRangeOfOriginatorChanged, survivor) == 0x000008, "Member 'ProveThyselfEffect_OnInRangeOfOriginatorChanged::survivor' has a wrong offset!");

// Function DBDCompetence.BaseIsPlayerPerformingInteraction.SetInteractionSemantics
// 0x0020 (0x0020 - 0x0000)
struct BaseIsPlayerPerformingInteraction_SetInteractionSemantics final
{
public:
	struct FGameplayTagContainer                  interactionSemantics;                              // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseIsPlayerPerformingInteraction_SetInteractionSemantics) == 0x000008, "Wrong alignment on BaseIsPlayerPerformingInteraction_SetInteractionSemantics");
static_assert(sizeof(BaseIsPlayerPerformingInteraction_SetInteractionSemantics) == 0x000020, "Wrong size on BaseIsPlayerPerformingInteraction_SetInteractionSemantics");
static_assert(offsetof(BaseIsPlayerPerformingInteraction_SetInteractionSemantics, interactionSemantics) == 0x000000, "Member 'BaseIsPlayerPerformingInteraction_SetInteractionSemantics::interactionSemantics' has a wrong offset!");

// Function DBDCompetence.BaseIsPlayerPerformingInteraction.UpdateIsTrue
// 0x0008 (0x0008 - 0x0000)
struct BaseIsPlayerPerformingInteraction_UpdateIsTrue final
{
public:
	class UInteractionDefinition*                 interactionDefinition;                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseIsPlayerPerformingInteraction_UpdateIsTrue) == 0x000008, "Wrong alignment on BaseIsPlayerPerformingInteraction_UpdateIsTrue");
static_assert(sizeof(BaseIsPlayerPerformingInteraction_UpdateIsTrue) == 0x000008, "Wrong size on BaseIsPlayerPerformingInteraction_UpdateIsTrue");
static_assert(offsetof(BaseIsPlayerPerformingInteraction_UpdateIsTrue, interactionDefinition) == 0x000000, "Member 'BaseIsPlayerPerformingInteraction_UpdateIsTrue::interactionDefinition' has a wrong offset!");

// Function DBDCompetence.SmallGame.Authority_SetTotemDetected
// 0x0001 (0x0001 - 0x0000)
struct SmallGame_Authority_SetTotemDetected final
{
public:
	bool                                          value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SmallGame_Authority_SetTotemDetected) == 0x000001, "Wrong alignment on SmallGame_Authority_SetTotemDetected");
static_assert(sizeof(SmallGame_Authority_SetTotemDetected) == 0x000001, "Wrong size on SmallGame_Authority_SetTotemDetected");
static_assert(offsetof(SmallGame_Authority_SetTotemDetected, value) == 0x000000, "Member 'SmallGame_Authority_SetTotemDetected::value' has a wrong offset!");

// Function DBDCompetence.SmallGame.GetDetectionConeAngle
// 0x0004 (0x0004 - 0x0000)
struct SmallGame_GetDetectionConeAngle final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SmallGame_GetDetectionConeAngle) == 0x000004, "Wrong alignment on SmallGame_GetDetectionConeAngle");
static_assert(sizeof(SmallGame_GetDetectionConeAngle) == 0x000004, "Wrong size on SmallGame_GetDetectionConeAngle");
static_assert(offsetof(SmallGame_GetDetectionConeAngle, ReturnValue) == 0x000000, "Member 'SmallGame_GetDetectionConeAngle::ReturnValue' has a wrong offset!");

// Function DBDCompetence.BetterTogether.GetRevealDistance
// 0x0004 (0x0004 - 0x0000)
struct BetterTogether_GetRevealDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BetterTogether_GetRevealDistance) == 0x000004, "Wrong alignment on BetterTogether_GetRevealDistance");
static_assert(sizeof(BetterTogether_GetRevealDistance) == 0x000004, "Wrong size on BetterTogether_GetRevealDistance");
static_assert(offsetof(BetterTogether_GetRevealDistance, ReturnValue) == 0x000000, "Member 'BetterTogether_GetRevealDistance::ReturnValue' has a wrong offset!");

// Function DBDCompetence.BetterTogether.OnStartedGeneratorRepair
// 0x0038 (0x0038 - 0x0000)
struct BetterTogether_OnStartedGeneratorRepair final
{
public:
	struct FGameplayTag                           gameplayTag;                                       // 0x0000(0x000C)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         gameEventData;                                     // 0x0010(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BetterTogether_OnStartedGeneratorRepair) == 0x000008, "Wrong alignment on BetterTogether_OnStartedGeneratorRepair");
static_assert(sizeof(BetterTogether_OnStartedGeneratorRepair) == 0x000038, "Wrong size on BetterTogether_OnStartedGeneratorRepair");
static_assert(offsetof(BetterTogether_OnStartedGeneratorRepair, gameplayTag) == 0x000000, "Member 'BetterTogether_OnStartedGeneratorRepair::gameplayTag' has a wrong offset!");
static_assert(offsetof(BetterTogether_OnStartedGeneratorRepair, gameEventData) == 0x000010, "Member 'BetterTogether_OnStartedGeneratorRepair::gameEventData' has a wrong offset!");

// Function DBDCompetence.BlessedStatusEffect.Authority_OnSurvivorRemovedFromGame
// 0x0008 (0x0008 - 0x0000)
struct BlessedStatusEffect_Authority_OnSurvivorRemovedFromGame final
{
public:
	class ACamperPlayer*                          survivor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlessedStatusEffect_Authority_OnSurvivorRemovedFromGame) == 0x000008, "Wrong alignment on BlessedStatusEffect_Authority_OnSurvivorRemovedFromGame");
static_assert(sizeof(BlessedStatusEffect_Authority_OnSurvivorRemovedFromGame) == 0x000008, "Wrong size on BlessedStatusEffect_Authority_OnSurvivorRemovedFromGame");
static_assert(offsetof(BlessedStatusEffect_Authority_OnSurvivorRemovedFromGame, survivor) == 0x000000, "Member 'BlessedStatusEffect_Authority_OnSurvivorRemovedFromGame::survivor' has a wrong offset!");

// Function DBDCompetence.BlessedStatusEffect.GetBoonTotemBlessingRange
// 0x0004 (0x0004 - 0x0000)
struct BlessedStatusEffect_GetBoonTotemBlessingRange final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlessedStatusEffect_GetBoonTotemBlessingRange) == 0x000004, "Wrong alignment on BlessedStatusEffect_GetBoonTotemBlessingRange");
static_assert(sizeof(BlessedStatusEffect_GetBoonTotemBlessingRange) == 0x000004, "Wrong size on BlessedStatusEffect_GetBoonTotemBlessingRange");
static_assert(offsetof(BlessedStatusEffect_GetBoonTotemBlessingRange, ReturnValue) == 0x000000, "Member 'BlessedStatusEffect_GetBoonTotemBlessingRange::ReturnValue' has a wrong offset!");

// Function DBDCompetence.BlessedStatusEffect.GetBoundTotem
// 0x0008 (0x0008 - 0x0000)
struct BlessedStatusEffect_GetBoundTotem final
{
public:
	class ATotem*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlessedStatusEffect_GetBoundTotem) == 0x000008, "Wrong alignment on BlessedStatusEffect_GetBoundTotem");
static_assert(sizeof(BlessedStatusEffect_GetBoundTotem) == 0x000008, "Wrong size on BlessedStatusEffect_GetBoundTotem");
static_assert(offsetof(BlessedStatusEffect_GetBoundTotem, ReturnValue) == 0x000000, "Member 'BlessedStatusEffect_GetBoundTotem::ReturnValue' has a wrong offset!");

// Function DBDCompetence.BloodEcho.GetCooldownDurationAtLevel
// 0x0004 (0x0004 - 0x0000)
struct BloodEcho_GetCooldownDurationAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BloodEcho_GetCooldownDurationAtLevel) == 0x000004, "Wrong alignment on BloodEcho_GetCooldownDurationAtLevel");
static_assert(sizeof(BloodEcho_GetCooldownDurationAtLevel) == 0x000004, "Wrong size on BloodEcho_GetCooldownDurationAtLevel");
static_assert(offsetof(BloodEcho_GetCooldownDurationAtLevel, ReturnValue) == 0x000000, "Member 'BloodEcho_GetCooldownDurationAtLevel::ReturnValue' has a wrong offset!");

// Function DBDCompetence.ProveThyself.OnSurvivorInOwnerRangeChanged
// 0x0001 (0x0001 - 0x0000)
struct ProveThyself_OnSurvivorInOwnerRangeChanged final
{
public:
	bool                                          inRange;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProveThyself_OnSurvivorInOwnerRangeChanged) == 0x000001, "Wrong alignment on ProveThyself_OnSurvivorInOwnerRangeChanged");
static_assert(sizeof(ProveThyself_OnSurvivorInOwnerRangeChanged) == 0x000001, "Wrong size on ProveThyself_OnSurvivorInOwnerRangeChanged");
static_assert(offsetof(ProveThyself_OnSurvivorInOwnerRangeChanged, inRange) == 0x000000, "Member 'ProveThyself_OnSurvivorInOwnerRangeChanged::inRange' has a wrong offset!");

// Function DBDCompetence.BoonPerk.Authority_OnSurvivorRemoved
// 0x0008 (0x0008 - 0x0000)
struct BoonPerk_Authority_OnSurvivorRemoved final
{
public:
	class ACamperPlayer*                          survivor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BoonPerk_Authority_OnSurvivorRemoved) == 0x000008, "Wrong alignment on BoonPerk_Authority_OnSurvivorRemoved");
static_assert(sizeof(BoonPerk_Authority_OnSurvivorRemoved) == 0x000008, "Wrong size on BoonPerk_Authority_OnSurvivorRemoved");
static_assert(offsetof(BoonPerk_Authority_OnSurvivorRemoved, survivor) == 0x000000, "Member 'BoonPerk_Authority_OnSurvivorRemoved::survivor' has a wrong offset!");

// Function DBDCompetence.StatsSystemUtilities.GetStatValueBP
// 0x0088 (0x0088 - 0x0000)
struct StatsSystemUtilities_GetStatValueBP final
{
public:
	struct FTunableStat                           theStat;                                           // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0080(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(StatsSystemUtilities_GetStatValueBP) == 0x000008, "Wrong alignment on StatsSystemUtilities_GetStatValueBP");
static_assert(sizeof(StatsSystemUtilities_GetStatValueBP) == 0x000088, "Wrong size on StatsSystemUtilities_GetStatValueBP");
static_assert(offsetof(StatsSystemUtilities_GetStatValueBP, theStat) == 0x000000, "Member 'StatsSystemUtilities_GetStatValueBP::theStat' has a wrong offset!");
static_assert(offsetof(StatsSystemUtilities_GetStatValueBP, ReturnValue) == 0x000080, "Member 'StatsSystemUtilities_GetStatValueBP::ReturnValue' has a wrong offset!");

// Function DBDCompetence.StatsSystemUtilities.InitStatBP
// 0x0090 (0x0090 - 0x0000)
struct StatsSystemUtilities_InitStatBP final
{
public:
	struct FTunableStat                           theStat;                                           // 0x0000(0x0080)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TScriptInterface<class IModifierProvider>     modifierProvider;                                  // 0x0080(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
};
static_assert(alignof(StatsSystemUtilities_InitStatBP) == 0x000008, "Wrong alignment on StatsSystemUtilities_InitStatBP");
static_assert(sizeof(StatsSystemUtilities_InitStatBP) == 0x000090, "Wrong size on StatsSystemUtilities_InitStatBP");
static_assert(offsetof(StatsSystemUtilities_InitStatBP, theStat) == 0x000000, "Member 'StatsSystemUtilities_InitStatBP::theStat' has a wrong offset!");
static_assert(offsetof(StatsSystemUtilities_InitStatBP, modifierProvider) == 0x000080, "Member 'StatsSystemUtilities_InitStatBP::modifierProvider' has a wrong offset!");

// Function DBDCompetence.Breakout.Authority_ImposeWiggleStatusEffect
// 0x0008 (0x0008 - 0x0000)
struct Breakout_Authority_ImposeWiggleStatusEffect final
{
public:
	class ACamperPlayer*                          survivor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Breakout_Authority_ImposeWiggleStatusEffect) == 0x000008, "Wrong alignment on Breakout_Authority_ImposeWiggleStatusEffect");
static_assert(sizeof(Breakout_Authority_ImposeWiggleStatusEffect) == 0x000008, "Wrong size on Breakout_Authority_ImposeWiggleStatusEffect");
static_assert(offsetof(Breakout_Authority_ImposeWiggleStatusEffect, survivor) == 0x000000, "Member 'Breakout_Authority_ImposeWiggleStatusEffect::survivor' has a wrong offset!");

// Function DBDCompetence.Breakout.Authority_OnRangeChanged
// 0x0001 (0x0001 - 0x0000)
struct Breakout_Authority_OnRangeChanged final
{
public:
	bool                                          inRange;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Breakout_Authority_OnRangeChanged) == 0x000001, "Wrong alignment on Breakout_Authority_OnRangeChanged");
static_assert(sizeof(Breakout_Authority_OnRangeChanged) == 0x000001, "Wrong size on Breakout_Authority_OnRangeChanged");
static_assert(offsetof(Breakout_Authority_OnRangeChanged, inRange) == 0x000000, "Member 'Breakout_Authority_OnRangeChanged::inRange' has a wrong offset!");

// Function DBDCompetence.Breakout.OnSlasherSet
// 0x0008 (0x0008 - 0x0000)
struct Breakout_OnSlasherSet final
{
public:
	class ASlasherPlayer*                         slasher;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Breakout_OnSlasherSet) == 0x000008, "Wrong alignment on Breakout_OnSlasherSet");
static_assert(sizeof(Breakout_OnSlasherSet) == 0x000008, "Wrong size on Breakout_OnSlasherSet");
static_assert(offsetof(Breakout_OnSlasherSet, slasher) == 0x000000, "Member 'Breakout_OnSlasherSet::slasher' has a wrong offset!");

// Function DBDCompetence.Solidarity.Authority_OnHealthChargeApplied
// 0x0018 (0x0018 - 0x0000)
struct Solidarity_Authority_OnHealthChargeApplied final
{
public:
	float                                         individualChargeAmount;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         totalChargeAmount;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 chargeInstigator;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          wasCoop;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         deltaTime;                                         // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Solidarity_Authority_OnHealthChargeApplied) == 0x000008, "Wrong alignment on Solidarity_Authority_OnHealthChargeApplied");
static_assert(sizeof(Solidarity_Authority_OnHealthChargeApplied) == 0x000018, "Wrong size on Solidarity_Authority_OnHealthChargeApplied");
static_assert(offsetof(Solidarity_Authority_OnHealthChargeApplied, individualChargeAmount) == 0x000000, "Member 'Solidarity_Authority_OnHealthChargeApplied::individualChargeAmount' has a wrong offset!");
static_assert(offsetof(Solidarity_Authority_OnHealthChargeApplied, totalChargeAmount) == 0x000004, "Member 'Solidarity_Authority_OnHealthChargeApplied::totalChargeAmount' has a wrong offset!");
static_assert(offsetof(Solidarity_Authority_OnHealthChargeApplied, chargeInstigator) == 0x000008, "Member 'Solidarity_Authority_OnHealthChargeApplied::chargeInstigator' has a wrong offset!");
static_assert(offsetof(Solidarity_Authority_OnHealthChargeApplied, wasCoop) == 0x000010, "Member 'Solidarity_Authority_OnHealthChargeApplied::wasCoop' has a wrong offset!");
static_assert(offsetof(Solidarity_Authority_OnHealthChargeApplied, deltaTime) == 0x000014, "Member 'Solidarity_Authority_OnHealthChargeApplied::deltaTime' has a wrong offset!");

// Function DBDCompetence.Solidarity.Authority_OnSkillCheckResponse
// 0x0018 (0x0018 - 0x0000)
struct Solidarity_Authority_OnSkillCheckResponse final
{
public:
	bool                                          success;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bonus;                                             // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             player;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          triggerLoudNoise;                                  // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          hadInput;                                          // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESkillCheckCustomType                         type;                                              // 0x0012(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         chargeChange;                                      // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Solidarity_Authority_OnSkillCheckResponse) == 0x000008, "Wrong alignment on Solidarity_Authority_OnSkillCheckResponse");
static_assert(sizeof(Solidarity_Authority_OnSkillCheckResponse) == 0x000018, "Wrong size on Solidarity_Authority_OnSkillCheckResponse");
static_assert(offsetof(Solidarity_Authority_OnSkillCheckResponse, success) == 0x000000, "Member 'Solidarity_Authority_OnSkillCheckResponse::success' has a wrong offset!");
static_assert(offsetof(Solidarity_Authority_OnSkillCheckResponse, bonus) == 0x000001, "Member 'Solidarity_Authority_OnSkillCheckResponse::bonus' has a wrong offset!");
static_assert(offsetof(Solidarity_Authority_OnSkillCheckResponse, player) == 0x000008, "Member 'Solidarity_Authority_OnSkillCheckResponse::player' has a wrong offset!");
static_assert(offsetof(Solidarity_Authority_OnSkillCheckResponse, triggerLoudNoise) == 0x000010, "Member 'Solidarity_Authority_OnSkillCheckResponse::triggerLoudNoise' has a wrong offset!");
static_assert(offsetof(Solidarity_Authority_OnSkillCheckResponse, hadInput) == 0x000011, "Member 'Solidarity_Authority_OnSkillCheckResponse::hadInput' has a wrong offset!");
static_assert(offsetof(Solidarity_Authority_OnSkillCheckResponse, type) == 0x000012, "Member 'Solidarity_Authority_OnSkillCheckResponse::type' has a wrong offset!");
static_assert(offsetof(Solidarity_Authority_OnSkillCheckResponse, chargeChange) == 0x000014, "Member 'Solidarity_Authority_OnSkillCheckResponse::chargeChange' has a wrong offset!");

// Function DBDCompetence.CorruptIntervention.GetGeneratorBlockDuration
// 0x0004 (0x0004 - 0x0000)
struct CorruptIntervention_GetGeneratorBlockDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CorruptIntervention_GetGeneratorBlockDuration) == 0x000004, "Wrong alignment on CorruptIntervention_GetGeneratorBlockDuration");
static_assert(sizeof(CorruptIntervention_GetGeneratorBlockDuration) == 0x000004, "Wrong size on CorruptIntervention_GetGeneratorBlockDuration");
static_assert(offsetof(CorruptIntervention_GetGeneratorBlockDuration, ReturnValue) == 0x000000, "Member 'CorruptIntervention_GetGeneratorBlockDuration::ReturnValue' has a wrong offset!");

// Function DBDCompetence.CruelConfinement.GetBlockDurationAtLevel
// 0x0004 (0x0004 - 0x0000)
struct CruelConfinement_GetBlockDurationAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CruelConfinement_GetBlockDurationAtLevel) == 0x000004, "Wrong alignment on CruelConfinement_GetBlockDurationAtLevel");
static_assert(sizeof(CruelConfinement_GetBlockDurationAtLevel) == 0x000004, "Wrong size on CruelConfinement_GetBlockDurationAtLevel");
static_assert(offsetof(CruelConfinement_GetBlockDurationAtLevel, ReturnValue) == 0x000000, "Member 'CruelConfinement_GetBlockDurationAtLevel::ReturnValue' has a wrong offset!");

// Function DBDCompetence.CruelConfinement.GetEffectiveRadiusAtLevel
// 0x0004 (0x0004 - 0x0000)
struct CruelConfinement_GetEffectiveRadiusAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CruelConfinement_GetEffectiveRadiusAtLevel) == 0x000004, "Wrong alignment on CruelConfinement_GetEffectiveRadiusAtLevel");
static_assert(sizeof(CruelConfinement_GetEffectiveRadiusAtLevel) == 0x000004, "Wrong size on CruelConfinement_GetEffectiveRadiusAtLevel");
static_assert(offsetof(CruelConfinement_GetEffectiveRadiusAtLevel, ReturnValue) == 0x000000, "Member 'CruelConfinement_GetEffectiveRadiusAtLevel::ReturnValue' has a wrong offset!");

// Function DBDCompetence.DarkSense.Authority_OnInRangeChanged
// 0x0001 (0x0001 - 0x0000)
struct DarkSense_Authority_OnInRangeChanged final
{
public:
	bool                                          inRange;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkSense_Authority_OnInRangeChanged) == 0x000001, "Wrong alignment on DarkSense_Authority_OnInRangeChanged");
static_assert(sizeof(DarkSense_Authority_OnInRangeChanged) == 0x000001, "Wrong size on DarkSense_Authority_OnInRangeChanged");
static_assert(offsetof(DarkSense_Authority_OnInRangeChanged, inRange) == 0x000000, "Member 'DarkSense_Authority_OnInRangeChanged::inRange' has a wrong offset!");

// Function DBDCompetence.DBDConditionFactory.DoesPerkHaveToken
// 0x0020 (0x0020 - 0x0000)
struct DBDConditionFactory_DoesPerkHaveToken final
{
public:
	TScriptInterface<class IConditionReceiver>    conditionReceiver;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class UPerk*                                  perk;                                              // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDoesPerkHaveToken*                     ReturnValue;                                       // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDConditionFactory_DoesPerkHaveToken) == 0x000008, "Wrong alignment on DBDConditionFactory_DoesPerkHaveToken");
static_assert(sizeof(DBDConditionFactory_DoesPerkHaveToken) == 0x000020, "Wrong size on DBDConditionFactory_DoesPerkHaveToken");
