#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDGameplay

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "VFXUtilities_classes.hpp"
#include "DBDGameplay_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "DataTableUtilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "StatSystem_structs.hpp"
#include "GameplayUtilities_classes.hpp"
#include "NetworkUtilities_structs.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK
{

// Class DBDGameplay.ReadMapInteraction
// 0x0010 (0x0750 - 0x0740)
class UReadMapInteraction final : public UChargeableInteractionDefinition
{
public:
	bool                                          _chargeCompleted;                                  // 0x0740(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_741[0xF];                                      // 0x0741(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ReadMapInteraction">();
	}
	static class UReadMapInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReadMapInteraction>();
	}
};
static_assert(alignof(UReadMapInteraction) == 0x000010, "Wrong alignment on UReadMapInteraction");
static_assert(sizeof(UReadMapInteraction) == 0x000750, "Wrong size on UReadMapInteraction");
static_assert(offsetof(UReadMapInteraction, _chargeCompleted) == 0x000740, "Member 'UReadMapInteraction::_chargeCompleted' has a wrong offset!");

// Class DBDGameplay.AISenseEvent_Terror
// 0x0028 (0x0058 - 0x0030)
class UAISenseEvent_Terror final : public UAISenseEvent
{
public:
	struct FAITerrorEvent                         Event;                                             // 0x0030(0x0028)(Edit, BlueprintVisible, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISenseEvent_Terror">();
	}
	static class UAISenseEvent_Terror* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISenseEvent_Terror>();
	}
};
static_assert(alignof(UAISenseEvent_Terror) == 0x000008, "Wrong alignment on UAISenseEvent_Terror");
static_assert(sizeof(UAISenseEvent_Terror) == 0x000058, "Wrong size on UAISenseEvent_Terror");
static_assert(offsetof(UAISenseEvent_Terror, Event) == 0x000030, "Member 'UAISenseEvent_Terror::Event' has a wrong offset!");

// Class DBDGameplay.BaseHusk
// 0x0020 (0x0258 - 0x0238)
class ABaseHusk : public ABaseVFX
{
public:
	class UDBDSkeletalMeshComponentBudgeted*      _huskMesh;                                         // 0x0238(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCustomizedSkeletalMesh*                _huskCustomizedSkeletalMesh;                       // 0x0240(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _shouldDeactivateVFX;                              // 0x0248(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_249[0xB];                                      // 0x0249(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _updateWeaponAccessories;                          // 0x0254(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _shouldWeaponBeVisible;                            // 0x0255(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_256[0x2];                                      // 0x0256(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_InitializeSkeletalMesh(class USkeletalMeshComponent* mesh);
	void InitializeHusk(class UCustomizedSkeletalMesh* customizedSkeletalMeshToCopy);
	void SetHuskVisibility(bool visible);
	void SetScalarParameterOnAllChildrenMeshes(class FName parameterName, float value, class USkeletalMeshComponent* mesh);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseHusk">();
	}
	static class ABaseHusk* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABaseHusk>();
	}
};
static_assert(alignof(ABaseHusk) == 0x000008, "Wrong alignment on ABaseHusk");
static_assert(sizeof(ABaseHusk) == 0x000258, "Wrong size on ABaseHusk");
static_assert(offsetof(ABaseHusk, _huskMesh) == 0x000238, "Member 'ABaseHusk::_huskMesh' has a wrong offset!");
static_assert(offsetof(ABaseHusk, _huskCustomizedSkeletalMesh) == 0x000240, "Member 'ABaseHusk::_huskCustomizedSkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABaseHusk, _shouldDeactivateVFX) == 0x000248, "Member 'ABaseHusk::_shouldDeactivateVFX' has a wrong offset!");
static_assert(offsetof(ABaseHusk, _updateWeaponAccessories) == 0x000254, "Member 'ABaseHusk::_updateWeaponAccessories' has a wrong offset!");
static_assert(offsetof(ABaseHusk, _shouldWeaponBeVisible) == 0x000255, "Member 'ABaseHusk::_shouldWeaponBeVisible' has a wrong offset!");

// Class DBDGameplay.PoseableHusk
// 0x0008 (0x0260 - 0x0258)
class APoseableHusk final : public ABaseHusk
{
public:
	uint8                                         Pad_258[0x8];                                      // 0x0258(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CapturePose();
	void Cosmetic_OnAnimationPoseCaptured();
	void OnActiveStateChanged(bool isActive);
	void SetIsActive(bool isActive);

	bool GetIsActive() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseableHusk">();
	}
	static class APoseableHusk* GetDefaultObj()
	{
		return GetDefaultObjImpl<APoseableHusk>();
	}
};
static_assert(alignof(APoseableHusk) == 0x000008, "Wrong alignment on APoseableHusk");
static_assert(sizeof(APoseableHusk) == 0x000260, "Wrong size on APoseableHusk");

// Class DBDGameplay.ActorPairQueryEvaluatorUtilities
// 0x0000 (0x0030 - 0x0030)
class UActorPairQueryEvaluatorUtilities final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorPairQueryEvaluatorUtilities">();
	}
	static class UActorPairQueryEvaluatorUtilities* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorPairQueryEvaluatorUtilities>();
	}
};
static_assert(alignof(UActorPairQueryEvaluatorUtilities) == 0x000008, "Wrong alignment on UActorPairQueryEvaluatorUtilities");
static_assert(sizeof(UActorPairQueryEvaluatorUtilities) == 0x000030, "Wrong size on UActorPairQueryEvaluatorUtilities");

// Class DBDGameplay.PositionLagCompensationComponent
// 0x0008 (0x00C0 - 0x00B8)
class UPositionLagCompensationComponent final : public UActorComponent
{
public:
	float                                         _maxExtrapolationDurationInSeconds;                // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _maxInterpolationToServerMoveInSeconds;            // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PositionLagCompensationComponent">();
	}
	static class UPositionLagCompensationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPositionLagCompensationComponent>();
	}
};
static_assert(alignof(UPositionLagCompensationComponent) == 0x000008, "Wrong alignment on UPositionLagCompensationComponent");
static_assert(sizeof(UPositionLagCompensationComponent) == 0x0000C0, "Wrong size on UPositionLagCompensationComponent");
static_assert(offsetof(UPositionLagCompensationComponent, _maxExtrapolationDurationInSeconds) == 0x0000B8, "Member 'UPositionLagCompensationComponent::_maxExtrapolationDurationInSeconds' has a wrong offset!");
static_assert(offsetof(UPositionLagCompensationComponent, _maxInterpolationToServerMoveInSeconds) == 0x0000BC, "Member 'UPositionLagCompensationComponent::_maxInterpolationToServerMoveInSeconds' has a wrong offset!");

// Class DBDGameplay.AimableComponent
// 0x0058 (0x0110 - 0x00B8)
class UAimableComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         _occlusionIgnoredActors;                           // 0x00C0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	float                                         _maxAimDistance;                                   // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAimDirectionProvider*                  _aimDirectionProvider;                             // 0x00D8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _useOcclusion;                                     // 0x00E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _aimPointLerpFactor;                               // 0x00E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAimPointProcessor*>             _preOcclusionAimPointProcessors;                   // 0x00E8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_F8[0x18];                                      // 0x00F8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetMaxAimDistance(float maxAimDistance);
	void SetOcclusionIgnoredActors(const TArray<class AActor*>& ignoredActors);
	void SetProcessors(const TArray<class UAimPointProcessor*>& processors);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AimableComponent">();
	}
	static class UAimableComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAimableComponent>();
	}
};
static_assert(alignof(UAimableComponent) == 0x000008, "Wrong alignment on UAimableComponent");
static_assert(sizeof(UAimableComponent) == 0x000110, "Wrong size on UAimableComponent");
static_assert(offsetof(UAimableComponent, _occlusionIgnoredActors) == 0x0000C0, "Member 'UAimableComponent::_occlusionIgnoredActors' has a wrong offset!");
static_assert(offsetof(UAimableComponent, _maxAimDistance) == 0x0000D0, "Member 'UAimableComponent::_maxAimDistance' has a wrong offset!");
static_assert(offsetof(UAimableComponent, _aimDirectionProvider) == 0x0000D8, "Member 'UAimableComponent::_aimDirectionProvider' has a wrong offset!");
static_assert(offsetof(UAimableComponent, _useOcclusion) == 0x0000E0, "Member 'UAimableComponent::_useOcclusion' has a wrong offset!");
static_assert(offsetof(UAimableComponent, _aimPointLerpFactor) == 0x0000E4, "Member 'UAimableComponent::_aimPointLerpFactor' has a wrong offset!");
static_assert(offsetof(UAimableComponent, _preOcclusionAimPointProcessors) == 0x0000E8, "Member 'UAimableComponent::_preOcclusionAimPointProcessors' has a wrong offset!");

// Class DBDGameplay.AISense_Terror
// 0x0060 (0x00F0 - 0x0090)
class UAISense_Terror final : public UAISense
{
public:
	TArray<struct FAITerrorEvent>                 _events;                                           // 0x0090(0x0010)(ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_A0[0x50];                                      // 0x00A0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void ReportTerrorEvent(class UObject* worldContextObj, const struct FVector& location, class AActor* instigator, class UTerrorRadiusEmitterComponent* terrorEmitter);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISense_Terror">();
	}
	static class UAISense_Terror* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISense_Terror>();
	}
};
static_assert(alignof(UAISense_Terror) == 0x000008, "Wrong alignment on UAISense_Terror");
static_assert(sizeof(UAISense_Terror) == 0x0000F0, "Wrong size on UAISense_Terror");
static_assert(offsetof(UAISense_Terror, _events) == 0x000090, "Member 'UAISense_Terror::_events' has a wrong offset!");

// Class DBDGameplay.PowerChargeComponent
// 0x00A8 (0x0160 - 0x00B8)
class UPowerChargeComponent final : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(float currentChargePercent)> OnPowerChargeChanged;                 // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x58];                                      // 0x00C8(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpeedBasedNetSyncedValue              _currentCharge;                                    // 0x0120(0x0038)(Net, Transient, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_158[0x4];                                      // 0x0158(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _forceFullCharge;                                  // 0x015C(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCurrentChargeChanged(float value);
	void OnRep_CurrentCharge();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PowerChargeComponent">();
	}
	static class UPowerChargeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPowerChargeComponent>();
	}
};
static_assert(alignof(UPowerChargeComponent) == 0x000008, "Wrong alignment on UPowerChargeComponent");
static_assert(sizeof(UPowerChargeComponent) == 0x000160, "Wrong size on UPowerChargeComponent");
static_assert(offsetof(UPowerChargeComponent, OnPowerChargeChanged) == 0x0000B8, "Member 'UPowerChargeComponent::OnPowerChargeChanged' has a wrong offset!");
static_assert(offsetof(UPowerChargeComponent, _currentCharge) == 0x000120, "Member 'UPowerChargeComponent::_currentCharge' has a wrong offset!");
static_assert(offsetof(UPowerChargeComponent, _forceFullCharge) == 0x00015C, "Member 'UPowerChargeComponent::_forceFullCharge' has a wrong offset!");

// Class DBDGameplay.AimDirectionProvider
// 0x0000 (0x0030 - 0x0030)
class UAimDirectionProvider : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AimDirectionProvider">();
	}
	static class UAimDirectionProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAimDirectionProvider>();
	}
};
static_assert(alignof(UAimDirectionProvider) == 0x000008, "Wrong alignment on UAimDirectionProvider");
static_assert(sizeof(UAimDirectionProvider) == 0x000030, "Wrong size on UAimDirectionProvider");

// Class DBDGameplay.AimPointProcessor
// 0x0000 (0x00B8 - 0x00B8)
class UAimPointProcessor : public UActorComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AimPointProcessor">();
	}
	static class UAimPointProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAimPointProcessor>();
	}
};
static_assert(alignof(UAimPointProcessor) == 0x000008, "Wrong alignment on UAimPointProcessor");
static_assert(sizeof(UAimPointProcessor) == 0x0000B8, "Wrong size on UAimPointProcessor");

// Class DBDGameplay.PowerChargePresentationItemProgressComponent
// 0x0018 (0x00D0 - 0x00B8)
class UPowerChargePresentationItemProgressComponent final : public UPresentationItemProgressComponent
{
public:
	class UPowerChargeComponent*                  _powerChargeComponent;                             // 0x00B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPowerToggleComponent*                  _powerToggleComponent;                             // 0x00C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _chargeReadyThreshold;                             // 0x00C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PowerChargePresentationItemProgressComponent">();
	}
	static class UPowerChargePresentationItemProgressComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPowerChargePresentationItemProgressComponent>();
	}
};
static_assert(alignof(UPowerChargePresentationItemProgressComponent) == 0x000008, "Wrong alignment on UPowerChargePresentationItemProgressComponent");
static_assert(sizeof(UPowerChargePresentationItemProgressComponent) == 0x0000D0, "Wrong size on UPowerChargePresentationItemProgressComponent");
static_assert(offsetof(UPowerChargePresentationItemProgressComponent, _powerChargeComponent) == 0x0000B8, "Member 'UPowerChargePresentationItemProgressComponent::_powerChargeComponent' has a wrong offset!");
static_assert(offsetof(UPowerChargePresentationItemProgressComponent, _powerToggleComponent) == 0x0000C0, "Member 'UPowerChargePresentationItemProgressComponent::_powerToggleComponent' has a wrong offset!");
static_assert(offsetof(UPowerChargePresentationItemProgressComponent, _chargeReadyThreshold) == 0x0000C8, "Member 'UPowerChargePresentationItemProgressComponent::_chargeReadyThreshold' has a wrong offset!");

// Class DBDGameplay.AimPointPerlinNoise
// 0x0030 (0x00E8 - 0x00B8)
class UAimPointPerlinNoise final : public UAimPointProcessor
{
public:
	uint8                                         Pad_B8[0x4];                                       // 0x00B8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _baseInaccuracyNoisePersistence;                   // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         _baseInaccuracyNoiseOctaveCount;                   // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _baseInaccuracyNoiseAmplitude;                     // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C8[0x4];                                       // 0x00C8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _baseInaccuracyNoiseFrequency;                     // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0x4];                                       // 0x00D0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _timeOffset;                                       // 0x00D4(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D8[0x10];                                      // 0x00D8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetBaseInaccuracyNoiseAmplitude(const float amplitude);
	void SetBaseInaccuracyNoiseFrequency(const float frequency);
	void SetBaseInaccuracyNoiseOctaveCount(const int32 octaveCount);
	void SetBaseInaccuracyNoisePersistence(const float noisePersistence);
	void SetNoiseAmplitudeMultiplier(const float multiplier);
	void SetNoiseFrequencyMultiplier(const float multiplier);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AimPointPerlinNoise">();
	}
	static class UAimPointPerlinNoise* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAimPointPerlinNoise>();
	}
};
static_assert(alignof(UAimPointPerlinNoise) == 0x000008, "Wrong alignment on UAimPointPerlinNoise");
static_assert(sizeof(UAimPointPerlinNoise) == 0x0000E8, "Wrong size on UAimPointPerlinNoise");
static_assert(offsetof(UAimPointPerlinNoise, _baseInaccuracyNoisePersistence) == 0x0000BC, "Member 'UAimPointPerlinNoise::_baseInaccuracyNoisePersistence' has a wrong offset!");
static_assert(offsetof(UAimPointPerlinNoise, _baseInaccuracyNoiseOctaveCount) == 0x0000C0, "Member 'UAimPointPerlinNoise::_baseInaccuracyNoiseOctaveCount' has a wrong offset!");
static_assert(offsetof(UAimPointPerlinNoise, _baseInaccuracyNoiseAmplitude) == 0x0000C4, "Member 'UAimPointPerlinNoise::_baseInaccuracyNoiseAmplitude' has a wrong offset!");
static_assert(offsetof(UAimPointPerlinNoise, _baseInaccuracyNoiseFrequency) == 0x0000CC, "Member 'UAimPointPerlinNoise::_baseInaccuracyNoiseFrequency' has a wrong offset!");
static_assert(offsetof(UAimPointPerlinNoise, _timeOffset) == 0x0000D4, "Member 'UAimPointPerlinNoise::_timeOffset' has a wrong offset!");

// Class DBDGameplay.RangeToActorsTrackerComponent
// 0x0010 (0x00C8 - 0x00B8)
class URangeToActorsTrackerComponent final : public UActorComponent
{
public:
	TArray<class URangeToActorsTrackerStrategy*>  _rangeTrackers;                                    // 0x00B8(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, NoClear, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	void OnLevelReadyToPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RangeToActorsTrackerComponent">();
	}
	static class URangeToActorsTrackerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URangeToActorsTrackerComponent>();
	}
};
static_assert(alignof(URangeToActorsTrackerComponent) == 0x000008, "Wrong alignment on URangeToActorsTrackerComponent");
static_assert(sizeof(URangeToActorsTrackerComponent) == 0x0000C8, "Wrong size on URangeToActorsTrackerComponent");
static_assert(offsetof(URangeToActorsTrackerComponent, _rangeTrackers) == 0x0000B8, "Member 'URangeToActorsTrackerComponent::_rangeTrackers' has a wrong offset!");

// Class DBDGameplay.AISenseConfig_Terror
// 0x0068 (0x00B8 - 0x0050)
class UAISenseConfig_Terror final : public UAISenseConfig
{
public:
	TSubclassOf<class UAISense_Terror>            Implementation;                                    // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoClear, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxBreathingSoundRange;                            // 0x0058(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EAITerrorLevel, float>                   TerrorRanges;                                      // 0x0060(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAISenseAffiliationFilter              DetectionByAffiliation;                            // 0x00B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISenseConfig_Terror">();
	}
	static class UAISenseConfig_Terror* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISenseConfig_Terror>();
	}
};
static_assert(alignof(UAISenseConfig_Terror) == 0x000008, "Wrong alignment on UAISenseConfig_Terror");
static_assert(sizeof(UAISenseConfig_Terror) == 0x0000B8, "Wrong size on UAISenseConfig_Terror");
static_assert(offsetof(UAISenseConfig_Terror, Implementation) == 0x000050, "Member 'UAISenseConfig_Terror::Implementation' has a wrong offset!");
static_assert(offsetof(UAISenseConfig_Terror, MaxBreathingSoundRange) == 0x000058, "Member 'UAISenseConfig_Terror::MaxBreathingSoundRange' has a wrong offset!");
static_assert(offsetof(UAISenseConfig_Terror, TerrorRanges) == 0x000060, "Member 'UAISenseConfig_Terror::TerrorRanges' has a wrong offset!");
static_assert(offsetof(UAISenseConfig_Terror, DetectionByAffiliation) == 0x0000B0, "Member 'UAISenseConfig_Terror::DetectionByAffiliation' has a wrong offset!");

// Class DBDGameplay.AuraOverriderComponent
// 0x0050 (0x0108 - 0x00B8)
class UAuraOverriderComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x50];                                      // 0x00B8(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ForceShowAura(const class AActor* actor, const struct FLinearColor& color, bool isAlwaysVisible, const float minimumOutlineDistance);
	void ResetAura(const class AActor* actor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AuraOverriderComponent">();
	}
	static class UAuraOverriderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuraOverriderComponent>();
	}
};
static_assert(alignof(UAuraOverriderComponent) == 0x000008, "Wrong alignment on UAuraOverriderComponent");
static_assert(sizeof(UAuraOverriderComponent) == 0x000108, "Wrong size on UAuraOverriderComponent");

// Class DBDGameplay.BaseActorAttackableComponent
// 0x0038 (0x00F0 - 0x00B8)
class UBaseActorAttackableComponent final : public UAttackableComponent
{
public:
	uint8                                         Pad_B8[0x18];                                      // 0x00B8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  _killerProjectilesThatCanDamageActor;              // 0x00D0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	void HitWithProjectile(class ABaseProjectile* projectile);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseActorAttackableComponent">();
	}
	static class UBaseActorAttackableComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseActorAttackableComponent>();
	}
};
static_assert(alignof(UBaseActorAttackableComponent) == 0x000008, "Wrong alignment on UBaseActorAttackableComponent");
static_assert(sizeof(UBaseActorAttackableComponent) == 0x0000F0, "Wrong size on UBaseActorAttackableComponent");
static_assert(offsetof(UBaseActorAttackableComponent, _killerProjectilesThatCanDamageActor) == 0x0000D0, "Member 'UBaseActorAttackableComponent::_killerProjectilesThatCanDamageActor' has a wrong offset!");

// Class DBDGameplay.BaseCamperCollectable
// 0x0048 (0x04F8 - 0x04B0)
class ABaseCamperCollectable : public ACollectable
{
public:
	class USpherePlayerOverlapComponent*          _interactable;                                     // 0x04B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInteractor*                            _collectableInteractor;                            // 0x04B8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDropItemInteraction*                   _dropInteraction;                                  // 0x04C0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCollectItemInteraction*                _collectInteraction;                               // 0x04C8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USphereComponent*                       _infectablePrimitive;                              // 0x04D0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDOutlineComponent*                   _outlineComponent;                                 // 0x04D8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialHelper*                        _materialHelper;                                   // 0x04E0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USurvivorCollectableOutlineUpdateStrategy* _survivorCollectableOutlineUpdateStrategy;      // 0x04E8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4F0[0x8];                                      // 0x04F0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseCamperCollectable">();
	}
	static class ABaseCamperCollectable* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABaseCamperCollectable>();
	}
};
static_assert(alignof(ABaseCamperCollectable) == 0x000008, "Wrong alignment on ABaseCamperCollectable");
static_assert(sizeof(ABaseCamperCollectable) == 0x0004F8, "Wrong size on ABaseCamperCollectable");
static_assert(offsetof(ABaseCamperCollectable, _interactable) == 0x0004B0, "Member 'ABaseCamperCollectable::_interactable' has a wrong offset!");
static_assert(offsetof(ABaseCamperCollectable, _collectableInteractor) == 0x0004B8, "Member 'ABaseCamperCollectable::_collectableInteractor' has a wrong offset!");
static_assert(offsetof(ABaseCamperCollectable, _dropInteraction) == 0x0004C0, "Member 'ABaseCamperCollectable::_dropInteraction' has a wrong offset!");
static_assert(offsetof(ABaseCamperCollectable, _collectInteraction) == 0x0004C8, "Member 'ABaseCamperCollectable::_collectInteraction' has a wrong offset!");
static_assert(offsetof(ABaseCamperCollectable, _infectablePrimitive) == 0x0004D0, "Member 'ABaseCamperCollectable::_infectablePrimitive' has a wrong offset!");
static_assert(offsetof(ABaseCamperCollectable, _outlineComponent) == 0x0004D8, "Member 'ABaseCamperCollectable::_outlineComponent' has a wrong offset!");
static_assert(offsetof(ABaseCamperCollectable, _materialHelper) == 0x0004E0, "Member 'ABaseCamperCollectable::_materialHelper' has a wrong offset!");
static_assert(offsetof(ABaseCamperCollectable, _survivorCollectableOutlineUpdateStrategy) == 0x0004E8, "Member 'ABaseCamperCollectable::_survivorCollectableOutlineUpdateStrategy' has a wrong offset!");

// Class DBDGameplay.FlashlightableLightingStrategy
// 0x0000 (0x0030 - 0x0030)
class UFlashlightableLightingStrategy : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FlashlightableLightingStrategy">();
	}
	static class UFlashlightableLightingStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlashlightableLightingStrategy>();
	}
};
static_assert(alignof(UFlashlightableLightingStrategy) == 0x000008, "Wrong alignment on UFlashlightableLightingStrategy");
static_assert(sizeof(UFlashlightableLightingStrategy) == 0x000030, "Wrong size on UFlashlightableLightingStrategy");

// Class DBDGameplay.FlashlightablePointsLightingStrategy
// 0x0010 (0x0040 - 0x0030)
class UFlashlightablePointsLightingStrategy : public UFlashlightableLightingStrategy
{
public:
	class UPointsProvider*                        _pointsProvider;                                   // 0x0030(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoClear, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _impactPointDistanceError;                         // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FlashlightablePointsLightingStrategy">();
	}
	static class UFlashlightablePointsLightingStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlashlightablePointsLightingStrategy>();
	}
};
static_assert(alignof(UFlashlightablePointsLightingStrategy) == 0x000008, "Wrong alignment on UFlashlightablePointsLightingStrategy");
static_assert(sizeof(UFlashlightablePointsLightingStrategy) == 0x000040, "Wrong size on UFlashlightablePointsLightingStrategy");
static_assert(offsetof(UFlashlightablePointsLightingStrategy, _pointsProvider) == 0x000030, "Member 'UFlashlightablePointsLightingStrategy::_pointsProvider' has a wrong offset!");
static_assert(offsetof(UFlashlightablePointsLightingStrategy, _impactPointDistanceError) == 0x000038, "Member 'UFlashlightablePointsLightingStrategy::_impactPointDistanceError' has a wrong offset!");

// Class DBDGameplay.BlindFlashlightableLightingStrategy
// 0x0000 (0x0040 - 0x0040)
class UBlindFlashlightableLightingStrategy : public UFlashlightablePointsLightingStrategy
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlindFlashlightableLightingStrategy">();
	}
	static class UBlindFlashlightableLightingStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlindFlashlightableLightingStrategy>();
	}
};
static_assert(alignof(UBlindFlashlightableLightingStrategy) == 0x000008, "Wrong alignment on UBlindFlashlightableLightingStrategy");
static_assert(sizeof(UBlindFlashlightableLightingStrategy) == 0x000040, "Wrong size on UBlindFlashlightableLightingStrategy");

// Class DBDGameplay.FlashlightTargetFXComponent
// 0x0048 (0x0100 - 0x00B8)
class UFlashlightTargetFXComponent : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x30];                                      // 0x00B8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _modifiesBeamAngle;                                // 0x00E8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFlashlightableComponent*               _flashlightable;                                   // 0x00F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnIsLitChanged(bool isLit);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FlashlightTargetFXComponent">();
	}
	static class UFlashlightTargetFXComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlashlightTargetFXComponent>();
	}
};
static_assert(alignof(UFlashlightTargetFXComponent) == 0x000008, "Wrong alignment on UFlashlightTargetFXComponent");
static_assert(sizeof(UFlashlightTargetFXComponent) == 0x000100, "Wrong size on UFlashlightTargetFXComponent");
static_assert(offsetof(UFlashlightTargetFXComponent, _modifiesBeamAngle) == 0x0000E8, "Member 'UFlashlightTargetFXComponent::_modifiesBeamAngle' has a wrong offset!");
static_assert(offsetof(UFlashlightTargetFXComponent, _flashlightable) == 0x0000F0, "Member 'UFlashlightTargetFXComponent::_flashlightable' has a wrong offset!");

// Class DBDGameplay.BlindFlashlightTargetFXComponent
// 0x0028 (0x0128 - 0x0100)
class UBlindFlashlightTargetFXComponent final : public UFlashlightTargetFXComponent
{
public:
	uint8                                         Pad_100[0x28];                                     // 0x0100(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlindFlashlightTargetFXComponent">();
	}
	static class UBlindFlashlightTargetFXComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlindFlashlightTargetFXComponent>();
	}
};
static_assert(alignof(UBlindFlashlightTargetFXComponent) == 0x000008, "Wrong alignment on UBlindFlashlightTargetFXComponent");
static_assert(sizeof(UBlindFlashlightTargetFXComponent) == 0x000128, "Wrong size on UBlindFlashlightTargetFXComponent");

// Class DBDGameplay.FootstepCreatorComponent
// 0x0050 (0x0108 - 0x00B8)
class UFootstepCreatorComponent : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x20];                                      // 0x00B8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            _fadeCurve;                                        // 0x00D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            _veinsCurve;                                       // 0x00E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFootstepManagerComponent>  _footstepManagerComponentClass;                    // 0x00E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _secondsUntilFootprintTrigger;                     // 0x00F8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _canSpawnFootstepsDefaultValue;                    // 0x00FC(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_FD[0xB];                                       // 0x00FD(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FootstepCreatorComponent">();
	}
	static class UFootstepCreatorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFootstepCreatorComponent>();
	}
};
static_assert(alignof(UFootstepCreatorComponent) == 0x000008, "Wrong alignment on UFootstepCreatorComponent");
static_assert(sizeof(UFootstepCreatorComponent) == 0x000108, "Wrong size on UFootstepCreatorComponent");
static_assert(offsetof(UFootstepCreatorComponent, _fadeCurve) == 0x0000D8, "Member 'UFootstepCreatorComponent::_fadeCurve' has a wrong offset!");
static_assert(offsetof(UFootstepCreatorComponent, _veinsCurve) == 0x0000E0, "Member 'UFootstepCreatorComponent::_veinsCurve' has a wrong offset!");
static_assert(offsetof(UFootstepCreatorComponent, _footstepManagerComponentClass) == 0x0000E8, "Member 'UFootstepCreatorComponent::_footstepManagerComponentClass' has a wrong offset!");
static_assert(offsetof(UFootstepCreatorComponent, _secondsUntilFootprintTrigger) == 0x0000F8, "Member 'UFootstepCreatorComponent::_secondsUntilFootprintTrigger' has a wrong offset!");
static_assert(offsetof(UFootstepCreatorComponent, _canSpawnFootstepsDefaultValue) == 0x0000FC, "Member 'UFootstepCreatorComponent::_canSpawnFootstepsDefaultValue' has a wrong offset!");

// Class DBDGameplay.CamperFootstepCreatorComponent
// 0x0238 (0x0340 - 0x0108)
class UCamperFootstepCreatorComponent final : public UFootstepCreatorComponent
{
public:
	TArray<struct FGameplayTag>                   _disallowFootstepsSpawnPerkFlags;                  // 0x0108(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FStatProperty                          _footstepIndicatorAngle;                           // 0x0118(0x0088)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FStatProperty                          _footstepIndicatorDecalSize;                       // 0x01A0(0x0088)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FStatProperty                          _footstepIndicatorDurationAdditive;                // 0x0228(0x0088)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FStatProperty                          _footstepIndicatorDurationMultiplictive;           // 0x02B0(0x0088)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_338[0x8];                                      // 0x0338(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnLoudNoiseTriggered(class AActor* originator, class AActor* instigatingActor, const struct FVector& location, bool shouldTrack, float* audibleRange, bool isQuickAction, bool isDeceivingNoise);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CamperFootstepCreatorComponent">();
	}
	static class UCamperFootstepCreatorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCamperFootstepCreatorComponent>();
	}
};
static_assert(alignof(UCamperFootstepCreatorComponent) == 0x000008, "Wrong alignment on UCamperFootstepCreatorComponent");
static_assert(sizeof(UCamperFootstepCreatorComponent) == 0x000340, "Wrong size on UCamperFootstepCreatorComponent");
static_assert(offsetof(UCamperFootstepCreatorComponent, _disallowFootstepsSpawnPerkFlags) == 0x000108, "Member 'UCamperFootstepCreatorComponent::_disallowFootstepsSpawnPerkFlags' has a wrong offset!");
static_assert(offsetof(UCamperFootstepCreatorComponent, _footstepIndicatorAngle) == 0x000118, "Member 'UCamperFootstepCreatorComponent::_footstepIndicatorAngle' has a wrong offset!");
static_assert(offsetof(UCamperFootstepCreatorComponent, _footstepIndicatorDecalSize) == 0x0001A0, "Member 'UCamperFootstepCreatorComponent::_footstepIndicatorDecalSize' has a wrong offset!");
static_assert(offsetof(UCamperFootstepCreatorComponent, _footstepIndicatorDurationAdditive) == 0x000228, "Member 'UCamperFootstepCreatorComponent::_footstepIndicatorDurationAdditive' has a wrong offset!");
static_assert(offsetof(UCamperFootstepCreatorComponent, _footstepIndicatorDurationMultiplictive) == 0x0002B0, "Member 'UCamperFootstepCreatorComponent::_footstepIndicatorDurationMultiplictive' has a wrong offset!");

// Class DBDGameplay.FootstepPerceptionComponent
// 0x0018 (0x00D0 - 0x00B8)
class UFootstepPerceptionComponent : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x10];                                      // 0x00B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _canSeeFootstepsDefaultValue;                      // 0x00C8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FootstepPerceptionComponent">();
	}
	static class UFootstepPerceptionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFootstepPerceptionComponent>();
	}
};
static_assert(alignof(UFootstepPerceptionComponent) == 0x000008, "Wrong alignment on UFootstepPerceptionComponent");
static_assert(sizeof(UFootstepPerceptionComponent) == 0x0000D0, "Wrong size on UFootstepPerceptionComponent");
static_assert(offsetof(UFootstepPerceptionComponent, _canSeeFootstepsDefaultValue) == 0x0000C8, "Member 'UFootstepPerceptionComponent::_canSeeFootstepsDefaultValue' has a wrong offset!");

// Class DBDGameplay.PlayerFootstepPerceptionComponent
// 0x0040 (0x0110 - 0x00D0)
class UPlayerFootstepPerceptionComponent : public UFootstepPerceptionComponent
{
public:
	TArray<struct FGameplayTag>                   _allowFootstepsSeenPerkFlags;                      // 0x00D0(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FGameplayTag>                   _disallowFootstepsSeenPerkFlags;                   // 0x00E0(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_F0[0x20];                                      // 0x00F0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerFootstepPerceptionComponent">();
	}
	static class UPlayerFootstepPerceptionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerFootstepPerceptionComponent>();
	}
};
static_assert(alignof(UPlayerFootstepPerceptionComponent) == 0x000008, "Wrong alignment on UPlayerFootstepPerceptionComponent");
static_assert(sizeof(UPlayerFootstepPerceptionComponent) == 0x000110, "Wrong size on UPlayerFootstepPerceptionComponent");
static_assert(offsetof(UPlayerFootstepPerceptionComponent, _allowFootstepsSeenPerkFlags) == 0x0000D0, "Member 'UPlayerFootstepPerceptionComponent::_allowFootstepsSeenPerkFlags' has a wrong offset!");
static_assert(offsetof(UPlayerFootstepPerceptionComponent, _disallowFootstepsSeenPerkFlags) == 0x0000E0, "Member 'UPlayerFootstepPerceptionComponent::_disallowFootstepsSeenPerkFlags' has a wrong offset!");

// Class DBDGameplay.CamperFootstepPerceptionComponent
// 0x0000 (0x0110 - 0x0110)
class UCamperFootstepPerceptionComponent final : public UPlayerFootstepPerceptionComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CamperFootstepPerceptionComponent">();
	}
	static class UCamperFootstepPerceptionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCamperFootstepPerceptionComponent>();
	}
};
static_assert(alignof(UCamperFootstepPerceptionComponent) == 0x000008, "Wrong alignment on UCamperFootstepPerceptionComponent");
static_assert(sizeof(UCamperFootstepPerceptionComponent) == 0x000110, "Wrong size on UCamperFootstepPerceptionComponent");

// Class DBDGameplay.CharacterOptimizer
// 0x0010 (0x00C8 - 0x00B8)
class UCharacterOptimizer final : public UActorComponent
{
public:
	float                                         _characterMovementTickRateWhenInsignificant;       // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_BC[0xC];                                       // 0x00BC(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CharacterOptimizer">();
	}
	static class UCharacterOptimizer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterOptimizer>();
	}
};
static_assert(alignof(UCharacterOptimizer) == 0x000008, "Wrong alignment on UCharacterOptimizer");
static_assert(sizeof(UCharacterOptimizer) == 0x0000C8, "Wrong size on UCharacterOptimizer");
static_assert(offsetof(UCharacterOptimizer, _characterMovementTickRateWhenInsignificant) == 0x0000B8, "Member 'UCharacterOptimizer::_characterMovementTickRateWhenInsignificant' has a wrong offset!");

// Class DBDGameplay.CollectableComponentUtilities
// 0x0000 (0x0030 - 0x0030)
class UCollectableComponentUtilities final : public UBlueprintFunctionLibrary
{
public:
	static class ADBDPlayer* GetCollector(const class UActorComponent* component);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CollectableComponentUtilities">();
	}
	static class UCollectableComponentUtilities* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollectableComponentUtilities>();
	}
};
static_assert(alignof(UCollectableComponentUtilities) == 0x000008, "Wrong alignment on UCollectableComponentUtilities");
static_assert(sizeof(UCollectableComponentUtilities) == 0x000030, "Wrong size on UCollectableComponentUtilities");

// Class DBDGameplay.ConspicuousActionComponent
// 0x0030 (0x00E8 - 0x00B8)
class UConspicuousActionComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x30];                                      // 0x00B8(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConspicuousActionComponent">();
	}
	static class UConspicuousActionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConspicuousActionComponent>();
	}
};
static_assert(alignof(UConspicuousActionComponent) == 0x000008, "Wrong alignment on UConspicuousActionComponent");
static_assert(sizeof(UConspicuousActionComponent) == 0x0000E8, "Wrong size on UConspicuousActionComponent");

// Class DBDGameplay.DBDCharacterPusherComponent
// 0x0010 (0x0180 - 0x0170)
class UDBDCharacterPusherComponent final : public UCharacterPusherComponent
{
public:
	uint8                                         Pad_170[0x10];                                     // 0x0170(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DBDCharacterPusherComponent">();
	}
	static class UDBDCharacterPusherComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDBDCharacterPusherComponent>();
	}
};
static_assert(alignof(UDBDCharacterPusherComponent) == 0x000008, "Wrong alignment on UDBDCharacterPusherComponent");
static_assert(sizeof(UDBDCharacterPusherComponent) == 0x000180, "Wrong size on UDBDCharacterPusherComponent");

// Class DBDGameplay.DebugIndicator
// 0x0020 (0x0250 - 0x0230)
class ADebugIndicator final : public AActor
{
public:
	class UStaticMeshComponent*                   _staticMeshComponent;                              // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDOutlineComponent*                   _outlineComponent;                                 // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_240[0x10];                                     // 0x0240(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetColor(const struct FLinearColor& color);
	void SetVisible(const bool visible);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DebugIndicator">();
	}
	static class ADebugIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADebugIndicator>();
	}
};
static_assert(alignof(ADebugIndicator) == 0x000008, "Wrong alignment on ADebugIndicator");
static_assert(sizeof(ADebugIndicator) == 0x000250, "Wrong size on ADebugIndicator");
static_assert(offsetof(ADebugIndicator, _staticMeshComponent) == 0x000230, "Member 'ADebugIndicator::_staticMeshComponent' has a wrong offset!");
static_assert(offsetof(ADebugIndicator, _outlineComponent) == 0x000238, "Member 'ADebugIndicator::_outlineComponent' has a wrong offset!");

// Class DBDGameplay.DecoySlasherComponent
// 0x0040 (0x00F8 - 0x00B8)
class UDecoySlasherComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class AActor* instigator)> OnStunned;                              // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool visible, const struct FVector& location, const struct FRotator& rotation)> TriggerDecoyVisibilityVFX; // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          HasTerrorRadius;                                   // 0x00E0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          HasRedGlow;                                        // 0x00E1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isActive;                                         // 0x00E2(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _initialized;                                      // 0x00E3(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTerrorRadiusEmitterComponent*          _terrorRadiusEmitter;                              // 0x00E8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URedStainComponent*                     _redStainComponent;                                // 0x00F0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void CopyCustomizationFromSlasher();
	void DoPostVFXUpdates(const struct FVector& location, const struct FRotator& rotation);
	void OnRealSlasherTerrorRadiusChanged(float newValue);
	void SetDecoyIsActive(bool isActive, const struct FVector& location, const struct FRotator& rotation, bool visibleRedGlow);

	class ASlasherPlayer* GetRealSlasher() const;
	bool IsDecoyActive() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DecoySlasherComponent">();
	}
	static class UDecoySlasherComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDecoySlasherComponent>();
	}
};
static_assert(alignof(UDecoySlasherComponent) == 0x000008, "Wrong alignment on UDecoySlasherComponent");
static_assert(sizeof(UDecoySlasherComponent) == 0x0000F8, "Wrong size on UDecoySlasherComponent");
static_assert(offsetof(UDecoySlasherComponent, OnStunned) == 0x0000C0, "Member 'UDecoySlasherComponent::OnStunned' has a wrong offset!");
static_assert(offsetof(UDecoySlasherComponent, TriggerDecoyVisibilityVFX) == 0x0000D0, "Member 'UDecoySlasherComponent::TriggerDecoyVisibilityVFX' has a wrong offset!");
static_assert(offsetof(UDecoySlasherComponent, HasTerrorRadius) == 0x0000E0, "Member 'UDecoySlasherComponent::HasTerrorRadius' has a wrong offset!");
static_assert(offsetof(UDecoySlasherComponent, HasRedGlow) == 0x0000E1, "Member 'UDecoySlasherComponent::HasRedGlow' has a wrong offset!");
static_assert(offsetof(UDecoySlasherComponent, _isActive) == 0x0000E2, "Member 'UDecoySlasherComponent::_isActive' has a wrong offset!");
static_assert(offsetof(UDecoySlasherComponent, _initialized) == 0x0000E3, "Member 'UDecoySlasherComponent::_initialized' has a wrong offset!");
static_assert(offsetof(UDecoySlasherComponent, _terrorRadiusEmitter) == 0x0000E8, "Member 'UDecoySlasherComponent::_terrorRadiusEmitter' has a wrong offset!");
static_assert(offsetof(UDecoySlasherComponent, _redStainComponent) == 0x0000F0, "Member 'UDecoySlasherComponent::_redStainComponent' has a wrong offset!");

// Class DBDGameplay.EtherealComponent
// 0x0040 (0x00F8 - 0x00B8)
class UEtherealComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x28];                                      // 0x00B8(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _isEthereal;                                       // 0x00E0(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E1[0x17];                                      // 0x00E1(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_OnIsEtherealChanged();
	void Server_SetIsEthereal(float timestamp, bool ethereal);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EtherealComponent">();
	}
	static class UEtherealComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEtherealComponent>();
	}
};
static_assert(alignof(UEtherealComponent) == 0x000008, "Wrong alignment on UEtherealComponent");
static_assert(sizeof(UEtherealComponent) == 0x0000F8, "Wrong size on UEtherealComponent");
static_assert(offsetof(UEtherealComponent, _isEthereal) == 0x0000E0, "Member 'UEtherealComponent::_isEthereal' has a wrong offset!");

