#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDGameplay

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK::Params
{

// Function DBDGameplay.BaseHusk.Cosmetic_InitializeSkeletalMesh
// 0x0008 (0x0008 - 0x0000)
struct BaseHusk_Cosmetic_InitializeSkeletalMesh final
{
public:
	class USkeletalMeshComponent*                 mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseHusk_Cosmetic_InitializeSkeletalMesh) == 0x000008, "Wrong alignment on BaseHusk_Cosmetic_InitializeSkeletalMesh");
static_assert(sizeof(BaseHusk_Cosmetic_InitializeSkeletalMesh) == 0x000008, "Wrong size on BaseHusk_Cosmetic_InitializeSkeletalMesh");
static_assert(offsetof(BaseHusk_Cosmetic_InitializeSkeletalMesh, mesh) == 0x000000, "Member 'BaseHusk_Cosmetic_InitializeSkeletalMesh::mesh' has a wrong offset!");

// Function DBDGameplay.BaseHusk.InitializeHusk
// 0x0008 (0x0008 - 0x0000)
struct BaseHusk_InitializeHusk final
{
public:
	class UCustomizedSkeletalMesh*                customizedSkeletalMeshToCopy;                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseHusk_InitializeHusk) == 0x000008, "Wrong alignment on BaseHusk_InitializeHusk");
static_assert(sizeof(BaseHusk_InitializeHusk) == 0x000008, "Wrong size on BaseHusk_InitializeHusk");
static_assert(offsetof(BaseHusk_InitializeHusk, customizedSkeletalMeshToCopy) == 0x000000, "Member 'BaseHusk_InitializeHusk::customizedSkeletalMeshToCopy' has a wrong offset!");

// Function DBDGameplay.BaseHusk.SetHuskVisibility
// 0x0001 (0x0001 - 0x0000)
struct BaseHusk_SetHuskVisibility final
{
public:
	bool                                          visible;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseHusk_SetHuskVisibility) == 0x000001, "Wrong alignment on BaseHusk_SetHuskVisibility");
static_assert(sizeof(BaseHusk_SetHuskVisibility) == 0x000001, "Wrong size on BaseHusk_SetHuskVisibility");
static_assert(offsetof(BaseHusk_SetHuskVisibility, visible) == 0x000000, "Member 'BaseHusk_SetHuskVisibility::visible' has a wrong offset!");

// Function DBDGameplay.BaseHusk.SetScalarParameterOnAllChildrenMeshes
// 0x0018 (0x0018 - 0x0000)
struct BaseHusk_SetScalarParameterOnAllChildrenMeshes final
{
public:
	class FName                                   parameterName;                                     // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         value;                                             // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 mesh;                                              // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseHusk_SetScalarParameterOnAllChildrenMeshes) == 0x000008, "Wrong alignment on BaseHusk_SetScalarParameterOnAllChildrenMeshes");
static_assert(sizeof(BaseHusk_SetScalarParameterOnAllChildrenMeshes) == 0x000018, "Wrong size on BaseHusk_SetScalarParameterOnAllChildrenMeshes");
static_assert(offsetof(BaseHusk_SetScalarParameterOnAllChildrenMeshes, parameterName) == 0x000000, "Member 'BaseHusk_SetScalarParameterOnAllChildrenMeshes::parameterName' has a wrong offset!");
static_assert(offsetof(BaseHusk_SetScalarParameterOnAllChildrenMeshes, value) == 0x00000C, "Member 'BaseHusk_SetScalarParameterOnAllChildrenMeshes::value' has a wrong offset!");
static_assert(offsetof(BaseHusk_SetScalarParameterOnAllChildrenMeshes, mesh) == 0x000010, "Member 'BaseHusk_SetScalarParameterOnAllChildrenMeshes::mesh' has a wrong offset!");

// Function DBDGameplay.PoseableHusk.OnActiveStateChanged
// 0x0001 (0x0001 - 0x0000)
struct PoseableHusk_OnActiveStateChanged final
{
public:
	bool                                          isActive;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PoseableHusk_OnActiveStateChanged) == 0x000001, "Wrong alignment on PoseableHusk_OnActiveStateChanged");
static_assert(sizeof(PoseableHusk_OnActiveStateChanged) == 0x000001, "Wrong size on PoseableHusk_OnActiveStateChanged");
static_assert(offsetof(PoseableHusk_OnActiveStateChanged, isActive) == 0x000000, "Member 'PoseableHusk_OnActiveStateChanged::isActive' has a wrong offset!");

// Function DBDGameplay.PoseableHusk.SetIsActive
// 0x0001 (0x0001 - 0x0000)
struct PoseableHusk_SetIsActive final
{
public:
	bool                                          isActive;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PoseableHusk_SetIsActive) == 0x000001, "Wrong alignment on PoseableHusk_SetIsActive");
static_assert(sizeof(PoseableHusk_SetIsActive) == 0x000001, "Wrong size on PoseableHusk_SetIsActive");
static_assert(offsetof(PoseableHusk_SetIsActive, isActive) == 0x000000, "Member 'PoseableHusk_SetIsActive::isActive' has a wrong offset!");

// Function DBDGameplay.PoseableHusk.GetIsActive
// 0x0001 (0x0001 - 0x0000)
struct PoseableHusk_GetIsActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PoseableHusk_GetIsActive) == 0x000001, "Wrong alignment on PoseableHusk_GetIsActive");
static_assert(sizeof(PoseableHusk_GetIsActive) == 0x000001, "Wrong size on PoseableHusk_GetIsActive");
static_assert(offsetof(PoseableHusk_GetIsActive, ReturnValue) == 0x000000, "Member 'PoseableHusk_GetIsActive::ReturnValue' has a wrong offset!");

// Function DBDGameplay.AimableComponent.SetMaxAimDistance
// 0x0004 (0x0004 - 0x0000)
struct AimableComponent_SetMaxAimDistance final
{
public:
	float                                         maxAimDistance;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AimableComponent_SetMaxAimDistance) == 0x000004, "Wrong alignment on AimableComponent_SetMaxAimDistance");
static_assert(sizeof(AimableComponent_SetMaxAimDistance) == 0x000004, "Wrong size on AimableComponent_SetMaxAimDistance");
static_assert(offsetof(AimableComponent_SetMaxAimDistance, maxAimDistance) == 0x000000, "Member 'AimableComponent_SetMaxAimDistance::maxAimDistance' has a wrong offset!");

// Function DBDGameplay.AimableComponent.SetOcclusionIgnoredActors
// 0x0010 (0x0010 - 0x0000)
struct AimableComponent_SetOcclusionIgnoredActors final
{
public:
	TArray<class AActor*>                         ignoredActors;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AimableComponent_SetOcclusionIgnoredActors) == 0x000008, "Wrong alignment on AimableComponent_SetOcclusionIgnoredActors");
static_assert(sizeof(AimableComponent_SetOcclusionIgnoredActors) == 0x000010, "Wrong size on AimableComponent_SetOcclusionIgnoredActors");
static_assert(offsetof(AimableComponent_SetOcclusionIgnoredActors, ignoredActors) == 0x000000, "Member 'AimableComponent_SetOcclusionIgnoredActors::ignoredActors' has a wrong offset!");

// Function DBDGameplay.AimableComponent.SetProcessors
// 0x0010 (0x0010 - 0x0000)
struct AimableComponent_SetProcessors final
{
public:
	TArray<class UAimPointProcessor*>             processors;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(AimableComponent_SetProcessors) == 0x000008, "Wrong alignment on AimableComponent_SetProcessors");
static_assert(sizeof(AimableComponent_SetProcessors) == 0x000010, "Wrong size on AimableComponent_SetProcessors");
static_assert(offsetof(AimableComponent_SetProcessors, processors) == 0x000000, "Member 'AimableComponent_SetProcessors::processors' has a wrong offset!");

// Function DBDGameplay.AISense_Terror.ReportTerrorEvent
// 0x0028 (0x0028 - 0x0000)
struct AISense_Terror_ReportTerrorEvent final
{
public:
	class UObject*                                worldContextObj;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                location;                                          // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 instigator;                                        // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTerrorRadiusEmitterComponent*          terrorEmitter;                                     // 0x0020(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AISense_Terror_ReportTerrorEvent) == 0x000008, "Wrong alignment on AISense_Terror_ReportTerrorEvent");
static_assert(sizeof(AISense_Terror_ReportTerrorEvent) == 0x000028, "Wrong size on AISense_Terror_ReportTerrorEvent");
static_assert(offsetof(AISense_Terror_ReportTerrorEvent, worldContextObj) == 0x000000, "Member 'AISense_Terror_ReportTerrorEvent::worldContextObj' has a wrong offset!");
static_assert(offsetof(AISense_Terror_ReportTerrorEvent, location) == 0x000008, "Member 'AISense_Terror_ReportTerrorEvent::location' has a wrong offset!");
static_assert(offsetof(AISense_Terror_ReportTerrorEvent, instigator) == 0x000018, "Member 'AISense_Terror_ReportTerrorEvent::instigator' has a wrong offset!");
static_assert(offsetof(AISense_Terror_ReportTerrorEvent, terrorEmitter) == 0x000020, "Member 'AISense_Terror_ReportTerrorEvent::terrorEmitter' has a wrong offset!");

// Function DBDGameplay.PowerChargeComponent.OnCurrentChargeChanged
// 0x0004 (0x0004 - 0x0000)
struct PowerChargeComponent_OnCurrentChargeChanged final
{
public:
	float                                         value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PowerChargeComponent_OnCurrentChargeChanged) == 0x000004, "Wrong alignment on PowerChargeComponent_OnCurrentChargeChanged");
static_assert(sizeof(PowerChargeComponent_OnCurrentChargeChanged) == 0x000004, "Wrong size on PowerChargeComponent_OnCurrentChargeChanged");
static_assert(offsetof(PowerChargeComponent_OnCurrentChargeChanged, value) == 0x000000, "Member 'PowerChargeComponent_OnCurrentChargeChanged::value' has a wrong offset!");

// Function DBDGameplay.AimPointPerlinNoise.SetBaseInaccuracyNoiseAmplitude
// 0x0004 (0x0004 - 0x0000)
struct AimPointPerlinNoise_SetBaseInaccuracyNoiseAmplitude final
{
public:
	float                                         amplitude;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AimPointPerlinNoise_SetBaseInaccuracyNoiseAmplitude) == 0x000004, "Wrong alignment on AimPointPerlinNoise_SetBaseInaccuracyNoiseAmplitude");
static_assert(sizeof(AimPointPerlinNoise_SetBaseInaccuracyNoiseAmplitude) == 0x000004, "Wrong size on AimPointPerlinNoise_SetBaseInaccuracyNoiseAmplitude");
static_assert(offsetof(AimPointPerlinNoise_SetBaseInaccuracyNoiseAmplitude, amplitude) == 0x000000, "Member 'AimPointPerlinNoise_SetBaseInaccuracyNoiseAmplitude::amplitude' has a wrong offset!");

// Function DBDGameplay.AimPointPerlinNoise.SetBaseInaccuracyNoiseFrequency
// 0x0004 (0x0004 - 0x0000)
struct AimPointPerlinNoise_SetBaseInaccuracyNoiseFrequency final
{
public:
	float                                         frequency;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AimPointPerlinNoise_SetBaseInaccuracyNoiseFrequency) == 0x000004, "Wrong alignment on AimPointPerlinNoise_SetBaseInaccuracyNoiseFrequency");
static_assert(sizeof(AimPointPerlinNoise_SetBaseInaccuracyNoiseFrequency) == 0x000004, "Wrong size on AimPointPerlinNoise_SetBaseInaccuracyNoiseFrequency");
static_assert(offsetof(AimPointPerlinNoise_SetBaseInaccuracyNoiseFrequency, frequency) == 0x000000, "Member 'AimPointPerlinNoise_SetBaseInaccuracyNoiseFrequency::frequency' has a wrong offset!");

// Function DBDGameplay.AimPointPerlinNoise.SetBaseInaccuracyNoiseOctaveCount
// 0x0004 (0x0004 - 0x0000)
struct AimPointPerlinNoise_SetBaseInaccuracyNoiseOctaveCount final
{
public:
	int32                                         octaveCount;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AimPointPerlinNoise_SetBaseInaccuracyNoiseOctaveCount) == 0x000004, "Wrong alignment on AimPointPerlinNoise_SetBaseInaccuracyNoiseOctaveCount");
static_assert(sizeof(AimPointPerlinNoise_SetBaseInaccuracyNoiseOctaveCount) == 0x000004, "Wrong size on AimPointPerlinNoise_SetBaseInaccuracyNoiseOctaveCount");
static_assert(offsetof(AimPointPerlinNoise_SetBaseInaccuracyNoiseOctaveCount, octaveCount) == 0x000000, "Member 'AimPointPerlinNoise_SetBaseInaccuracyNoiseOctaveCount::octaveCount' has a wrong offset!");

// Function DBDGameplay.AimPointPerlinNoise.SetBaseInaccuracyNoisePersistence
// 0x0004 (0x0004 - 0x0000)
struct AimPointPerlinNoise_SetBaseInaccuracyNoisePersistence final
{
public:
	float                                         noisePersistence;                                  // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AimPointPerlinNoise_SetBaseInaccuracyNoisePersistence) == 0x000004, "Wrong alignment on AimPointPerlinNoise_SetBaseInaccuracyNoisePersistence");
static_assert(sizeof(AimPointPerlinNoise_SetBaseInaccuracyNoisePersistence) == 0x000004, "Wrong size on AimPointPerlinNoise_SetBaseInaccuracyNoisePersistence");
static_assert(offsetof(AimPointPerlinNoise_SetBaseInaccuracyNoisePersistence, noisePersistence) == 0x000000, "Member 'AimPointPerlinNoise_SetBaseInaccuracyNoisePersistence::noisePersistence' has a wrong offset!");

// Function DBDGameplay.AimPointPerlinNoise.SetNoiseAmplitudeMultiplier
// 0x0004 (0x0004 - 0x0000)
struct AimPointPerlinNoise_SetNoiseAmplitudeMultiplier final
{
public:
	float                                         multiplier;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AimPointPerlinNoise_SetNoiseAmplitudeMultiplier) == 0x000004, "Wrong alignment on AimPointPerlinNoise_SetNoiseAmplitudeMultiplier");
static_assert(sizeof(AimPointPerlinNoise_SetNoiseAmplitudeMultiplier) == 0x000004, "Wrong size on AimPointPerlinNoise_SetNoiseAmplitudeMultiplier");
static_assert(offsetof(AimPointPerlinNoise_SetNoiseAmplitudeMultiplier, multiplier) == 0x000000, "Member 'AimPointPerlinNoise_SetNoiseAmplitudeMultiplier::multiplier' has a wrong offset!");

// Function DBDGameplay.AimPointPerlinNoise.SetNoiseFrequencyMultiplier
// 0x0004 (0x0004 - 0x0000)
struct AimPointPerlinNoise_SetNoiseFrequencyMultiplier final
{
public:
	float                                         multiplier;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AimPointPerlinNoise_SetNoiseFrequencyMultiplier) == 0x000004, "Wrong alignment on AimPointPerlinNoise_SetNoiseFrequencyMultiplier");
static_assert(sizeof(AimPointPerlinNoise_SetNoiseFrequencyMultiplier) == 0x000004, "Wrong size on AimPointPerlinNoise_SetNoiseFrequencyMultiplier");
static_assert(offsetof(AimPointPerlinNoise_SetNoiseFrequencyMultiplier, multiplier) == 0x000000, "Member 'AimPointPerlinNoise_SetNoiseFrequencyMultiplier::multiplier' has a wrong offset!");

// Function DBDGameplay.AuraOverriderComponent.ForceShowAura
// 0x0020 (0x0020 - 0x0000)
struct AuraOverriderComponent_ForceShowAura final
{
public:
	const class AActor*                           actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           color;                                             // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isAlwaysVisible;                                   // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         minimumOutlineDistance;                            // 0x001C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuraOverriderComponent_ForceShowAura) == 0x000008, "Wrong alignment on AuraOverriderComponent_ForceShowAura");
static_assert(sizeof(AuraOverriderComponent_ForceShowAura) == 0x000020, "Wrong size on AuraOverriderComponent_ForceShowAura");
static_assert(offsetof(AuraOverriderComponent_ForceShowAura, actor) == 0x000000, "Member 'AuraOverriderComponent_ForceShowAura::actor' has a wrong offset!");
static_assert(offsetof(AuraOverriderComponent_ForceShowAura, color) == 0x000008, "Member 'AuraOverriderComponent_ForceShowAura::color' has a wrong offset!");
static_assert(offsetof(AuraOverriderComponent_ForceShowAura, isAlwaysVisible) == 0x000018, "Member 'AuraOverriderComponent_ForceShowAura::isAlwaysVisible' has a wrong offset!");
static_assert(offsetof(AuraOverriderComponent_ForceShowAura, minimumOutlineDistance) == 0x00001C, "Member 'AuraOverriderComponent_ForceShowAura::minimumOutlineDistance' has a wrong offset!");

// Function DBDGameplay.AuraOverriderComponent.ResetAura
// 0x0008 (0x0008 - 0x0000)
struct AuraOverriderComponent_ResetAura final
{
public:
	const class AActor*                           actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuraOverriderComponent_ResetAura) == 0x000008, "Wrong alignment on AuraOverriderComponent_ResetAura");
static_assert(sizeof(AuraOverriderComponent_ResetAura) == 0x000008, "Wrong size on AuraOverriderComponent_ResetAura");
static_assert(offsetof(AuraOverriderComponent_ResetAura, actor) == 0x000000, "Member 'AuraOverriderComponent_ResetAura::actor' has a wrong offset!");

// Function DBDGameplay.BaseActorAttackableComponent.HitWithProjectile
// 0x0008 (0x0008 - 0x0000)
struct BaseActorAttackableComponent_HitWithProjectile final
{
public:
	class ABaseProjectile*                        projectile;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseActorAttackableComponent_HitWithProjectile) == 0x000008, "Wrong alignment on BaseActorAttackableComponent_HitWithProjectile");
static_assert(sizeof(BaseActorAttackableComponent_HitWithProjectile) == 0x000008, "Wrong size on BaseActorAttackableComponent_HitWithProjectile");
static_assert(offsetof(BaseActorAttackableComponent_HitWithProjectile, projectile) == 0x000000, "Member 'BaseActorAttackableComponent_HitWithProjectile::projectile' has a wrong offset!");

// Function DBDGameplay.FlashlightTargetFXComponent.OnIsLitChanged
// 0x0001 (0x0001 - 0x0000)
struct FlashlightTargetFXComponent_OnIsLitChanged final
{
public:
	bool                                          isLit;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FlashlightTargetFXComponent_OnIsLitChanged) == 0x000001, "Wrong alignment on FlashlightTargetFXComponent_OnIsLitChanged");
static_assert(sizeof(FlashlightTargetFXComponent_OnIsLitChanged) == 0x000001, "Wrong size on FlashlightTargetFXComponent_OnIsLitChanged");
static_assert(offsetof(FlashlightTargetFXComponent_OnIsLitChanged, isLit) == 0x000000, "Member 'FlashlightTargetFXComponent_OnIsLitChanged::isLit' has a wrong offset!");

// Function DBDGameplay.CamperFootstepCreatorComponent.OnLoudNoiseTriggered
// 0x0028 (0x0028 - 0x0000)
struct CamperFootstepCreatorComponent_OnLoudNoiseTriggered final
{
public:
	class AActor*                                 originator;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 instigatingActor;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                location;                                          // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          shouldTrack;                                       // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         audibleRange;                                      // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isQuickAction;                                     // 0x0024(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isDeceivingNoise;                                  // 0x0025(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CamperFootstepCreatorComponent_OnLoudNoiseTriggered) == 0x000008, "Wrong alignment on CamperFootstepCreatorComponent_OnLoudNoiseTriggered");
static_assert(sizeof(CamperFootstepCreatorComponent_OnLoudNoiseTriggered) == 0x000028, "Wrong size on CamperFootstepCreatorComponent_OnLoudNoiseTriggered");
static_assert(offsetof(CamperFootstepCreatorComponent_OnLoudNoiseTriggered, originator) == 0x000000, "Member 'CamperFootstepCreatorComponent_OnLoudNoiseTriggered::originator' has a wrong offset!");
static_assert(offsetof(CamperFootstepCreatorComponent_OnLoudNoiseTriggered, instigatingActor) == 0x000008, "Member 'CamperFootstepCreatorComponent_OnLoudNoiseTriggered::instigatingActor' has a wrong offset!");
static_assert(offsetof(CamperFootstepCreatorComponent_OnLoudNoiseTriggered, location) == 0x000010, "Member 'CamperFootstepCreatorComponent_OnLoudNoiseTriggered::location' has a wrong offset!");
static_assert(offsetof(CamperFootstepCreatorComponent_OnLoudNoiseTriggered, shouldTrack) == 0x00001C, "Member 'CamperFootstepCreatorComponent_OnLoudNoiseTriggered::shouldTrack' has a wrong offset!");
static_assert(offsetof(CamperFootstepCreatorComponent_OnLoudNoiseTriggered, audibleRange) == 0x000020, "Member 'CamperFootstepCreatorComponent_OnLoudNoiseTriggered::audibleRange' has a wrong offset!");
static_assert(offsetof(CamperFootstepCreatorComponent_OnLoudNoiseTriggered, isQuickAction) == 0x000024, "Member 'CamperFootstepCreatorComponent_OnLoudNoiseTriggered::isQuickAction' has a wrong offset!");
static_assert(offsetof(CamperFootstepCreatorComponent_OnLoudNoiseTriggered, isDeceivingNoise) == 0x000025, "Member 'CamperFootstepCreatorComponent_OnLoudNoiseTriggered::isDeceivingNoise' has a wrong offset!");

// Function DBDGameplay.CollectableComponentUtilities.GetCollector
// 0x0010 (0x0010 - 0x0000)
struct CollectableComponentUtilities_GetCollector final
{
public:
	const class UActorComponent*                  component;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ADBDPlayer*                             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CollectableComponentUtilities_GetCollector) == 0x000008, "Wrong alignment on CollectableComponentUtilities_GetCollector");
static_assert(sizeof(CollectableComponentUtilities_GetCollector) == 0x000010, "Wrong size on CollectableComponentUtilities_GetCollector");
static_assert(offsetof(CollectableComponentUtilities_GetCollector, component) == 0x000000, "Member 'CollectableComponentUtilities_GetCollector::component' has a wrong offset!");
static_assert(offsetof(CollectableComponentUtilities_GetCollector, ReturnValue) == 0x000008, "Member 'CollectableComponentUtilities_GetCollector::ReturnValue' has a wrong offset!");

// Function DBDGameplay.DebugIndicator.SetColor
// 0x0010 (0x0010 - 0x0000)
struct DebugIndicator_SetColor final
{
public:
	struct FLinearColor                           color;                                             // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DebugIndicator_SetColor) == 0x000004, "Wrong alignment on DebugIndicator_SetColor");
static_assert(sizeof(DebugIndicator_SetColor) == 0x000010, "Wrong size on DebugIndicator_SetColor");
static_assert(offsetof(DebugIndicator_SetColor, color) == 0x000000, "Member 'DebugIndicator_SetColor::color' has a wrong offset!");

// Function DBDGameplay.DebugIndicator.SetVisible
// 0x0001 (0x0001 - 0x0000)
struct DebugIndicator_SetVisible final
{
public:
	bool                                          visible;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DebugIndicator_SetVisible) == 0x000001, "Wrong alignment on DebugIndicator_SetVisible");
static_assert(sizeof(DebugIndicator_SetVisible) == 0x000001, "Wrong size on DebugIndicator_SetVisible");
static_assert(offsetof(DebugIndicator_SetVisible, visible) == 0x000000, "Member 'DebugIndicator_SetVisible::visible' has a wrong offset!");

// Function DBDGameplay.DecoySlasherComponent.DoPostVFXUpdates
// 0x0018 (0x0018 - 0x0000)
struct DecoySlasherComponent_DoPostVFXUpdates final
{
public:
	struct FVector                                location;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               rotation;                                          // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(DecoySlasherComponent_DoPostVFXUpdates) == 0x000004, "Wrong alignment on DecoySlasherComponent_DoPostVFXUpdates");
static_assert(sizeof(DecoySlasherComponent_DoPostVFXUpdates) == 0x000018, "Wrong size on DecoySlasherComponent_DoPostVFXUpdates");
static_assert(offsetof(DecoySlasherComponent_DoPostVFXUpdates, location) == 0x000000, "Member 'DecoySlasherComponent_DoPostVFXUpdates::location' has a wrong offset!");
static_assert(offsetof(DecoySlasherComponent_DoPostVFXUpdates, rotation) == 0x00000C, "Member 'DecoySlasherComponent_DoPostVFXUpdates::rotation' has a wrong offset!");

// Function DBDGameplay.DecoySlasherComponent.OnRealSlasherTerrorRadiusChanged
// 0x0004 (0x0004 - 0x0000)
struct DecoySlasherComponent_OnRealSlasherTerrorRadiusChanged final
{
public:
	float                                         newValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DecoySlasherComponent_OnRealSlasherTerrorRadiusChanged) == 0x000004, "Wrong alignment on DecoySlasherComponent_OnRealSlasherTerrorRadiusChanged");
static_assert(sizeof(DecoySlasherComponent_OnRealSlasherTerrorRadiusChanged) == 0x000004, "Wrong size on DecoySlasherComponent_OnRealSlasherTerrorRadiusChanged");
static_assert(offsetof(DecoySlasherComponent_OnRealSlasherTerrorRadiusChanged, newValue) == 0x000000, "Member 'DecoySlasherComponent_OnRealSlasherTerrorRadiusChanged::newValue' has a wrong offset!");

// Function DBDGameplay.DecoySlasherComponent.SetDecoyIsActive
// 0x0020 (0x0020 - 0x0000)
struct DecoySlasherComponent_SetDecoyIsActive final
{
public:
	bool                                          isActive;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                location;                                          // 0x0004(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               rotation;                                          // 0x0010(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          visibleRedGlow;                                    // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DecoySlasherComponent_SetDecoyIsActive) == 0x000004, "Wrong alignment on DecoySlasherComponent_SetDecoyIsActive");
static_assert(sizeof(DecoySlasherComponent_SetDecoyIsActive) == 0x000020, "Wrong size on DecoySlasherComponent_SetDecoyIsActive");
static_assert(offsetof(DecoySlasherComponent_SetDecoyIsActive, isActive) == 0x000000, "Member 'DecoySlasherComponent_SetDecoyIsActive::isActive' has a wrong offset!");
static_assert(offsetof(DecoySlasherComponent_SetDecoyIsActive, location) == 0x000004, "Member 'DecoySlasherComponent_SetDecoyIsActive::location' has a wrong offset!");
static_assert(offsetof(DecoySlasherComponent_SetDecoyIsActive, rotation) == 0x000010, "Member 'DecoySlasherComponent_SetDecoyIsActive::rotation' has a wrong offset!");
static_assert(offsetof(DecoySlasherComponent_SetDecoyIsActive, visibleRedGlow) == 0x00001C, "Member 'DecoySlasherComponent_SetDecoyIsActive::visibleRedGlow' has a wrong offset!");

// Function DBDGameplay.DecoySlasherComponent.GetRealSlasher
// 0x0008 (0x0008 - 0x0000)
struct DecoySlasherComponent_GetRealSlasher final
{
public:
	class ASlasherPlayer*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DecoySlasherComponent_GetRealSlasher) == 0x000008, "Wrong alignment on DecoySlasherComponent_GetRealSlasher");
static_assert(sizeof(DecoySlasherComponent_GetRealSlasher) == 0x000008, "Wrong size on DecoySlasherComponent_GetRealSlasher");
static_assert(offsetof(DecoySlasherComponent_GetRealSlasher, ReturnValue) == 0x000000, "Member 'DecoySlasherComponent_GetRealSlasher::ReturnValue' has a wrong offset!");

// Function DBDGameplay.DecoySlasherComponent.IsDecoyActive
// 0x0001 (0x0001 - 0x0000)
struct DecoySlasherComponent_IsDecoyActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DecoySlasherComponent_IsDecoyActive) == 0x000001, "Wrong alignment on DecoySlasherComponent_IsDecoyActive");
static_assert(sizeof(DecoySlasherComponent_IsDecoyActive) == 0x000001, "Wrong size on DecoySlasherComponent_IsDecoyActive");
static_assert(offsetof(DecoySlasherComponent_IsDecoyActive, ReturnValue) == 0x000000, "Member 'DecoySlasherComponent_IsDecoyActive::ReturnValue' has a wrong offset!");

// Function DBDGameplay.EtherealComponent.Server_SetIsEthereal
// 0x0008 (0x0008 - 0x0000)
struct EtherealComponent_Server_SetIsEthereal final
{
public:
	float                                         timestamp;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ethereal;                                          // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EtherealComponent_Server_SetIsEthereal) == 0x000004, "Wrong alignment on EtherealComponent_Server_SetIsEthereal");
static_assert(sizeof(EtherealComponent_Server_SetIsEthereal) == 0x000008, "Wrong size on EtherealComponent_Server_SetIsEthereal");
static_assert(offsetof(EtherealComponent_Server_SetIsEthereal, timestamp) == 0x000000, "Member 'EtherealComponent_Server_SetIsEthereal::timestamp' has a wrong offset!");
static_assert(offsetof(EtherealComponent_Server_SetIsEthereal, ethereal) == 0x000004, "Member 'EtherealComponent_Server_SetIsEthereal::ethereal' has a wrong offset!");

// Function DBDGameplay.RangeToActorsTrackerStrategy.OnInRangeToTrackedActorsChanged
// 0x0001 (0x0001 - 0x0000)
struct RangeToActorsTrackerStrategy_OnInRangeToTrackedActorsChanged final
{
public:
	bool                                          inRange;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RangeToActorsTrackerStrategy_OnInRangeToTrackedActorsChanged) == 0x000001, "Wrong alignment on RangeToActorsTrackerStrategy_OnInRangeToTrackedActorsChanged");
static_assert(sizeof(RangeToActorsTrackerStrategy_OnInRangeToTrackedActorsChanged) == 0x000001, "Wrong size on RangeToActorsTrackerStrategy_OnInRangeToTrackedActorsChanged");
static_assert(offsetof(RangeToActorsTrackerStrategy_OnInRangeToTrackedActorsChanged, inRange) == 0x000000, "Member 'RangeToActorsTrackerStrategy_OnInRangeToTrackedActorsChanged::inRange' has a wrong offset!");

// Function DBDGameplay.FadeComponent.GetFadePercent
// 0x0004 (0x0004 - 0x0000)
struct FadeComponent_GetFadePercent final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FadeComponent_GetFadePercent) == 0x000004, "Wrong alignment on FadeComponent_GetFadePercent");
static_assert(sizeof(FadeComponent_GetFadePercent) == 0x000004, "Wrong size on FadeComponent_GetFadePercent");
static_assert(offsetof(FadeComponent_GetFadePercent, ReturnValue) == 0x000000, "Member 'FadeComponent_GetFadePercent::ReturnValue' has a wrong offset!");

// Function DBDGameplay.Flashlight.GetSpotlightComponent
// 0x0008 (0x0008 - 0x0000)
struct Flashlight_GetSpotlightComponent final
{
public:
	class USpotLightComponent*                    ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Flashlight_GetSpotlightComponent) == 0x000008, "Wrong alignment on Flashlight_GetSpotlightComponent");
static_assert(sizeof(Flashlight_GetSpotlightComponent) == 0x000008, "Wrong size on Flashlight_GetSpotlightComponent");
static_assert(offsetof(Flashlight_GetSpotlightComponent, ReturnValue) == 0x000000, "Member 'Flashlight_GetSpotlightComponent::ReturnValue' has a wrong offset!");

// Function DBDGameplay.FlashlightableComponent.IsLit
// 0x0001 (0x0001 - 0x0000)
struct FlashlightableComponent_IsLit final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FlashlightableComponent_IsLit) == 0x000001, "Wrong alignment on FlashlightableComponent_IsLit");
static_assert(sizeof(FlashlightableComponent_IsLit) == 0x000001, "Wrong size on FlashlightableComponent_IsLit");
static_assert(offsetof(FlashlightableComponent_IsLit, ReturnValue) == 0x000000, "Member 'FlashlightableComponent_IsLit::ReturnValue' has a wrong offset!");

// Function DBDGameplay.FlashlightComponent.Server_SetAndUpdateAutonomousLitFlashlightables
// 0x0010 (0x0010 - 0x0000)
struct FlashlightComponent_Server_SetAndUpdateAutonomousLitFlashlightables final
{
public:
	TArray<class UFlashlightableComponent*>       newLitFlashlightables;                             // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(FlashlightComponent_Server_SetAndUpdateAutonomousLitFlashlightables) == 0x000008, "Wrong alignment on FlashlightComponent_Server_SetAndUpdateAutonomousLitFlashlightables");
static_assert(sizeof(FlashlightComponent_Server_SetAndUpdateAutonomousLitFlashlightables) == 0x000010, "Wrong size on FlashlightComponent_Server_SetAndUpdateAutonomousLitFlashlightables");
static_assert(offsetof(FlashlightComponent_Server_SetAndUpdateAutonomousLitFlashlightables, newLitFlashlightables) == 0x000000, "Member 'FlashlightComponent_Server_SetAndUpdateAutonomousLitFlashlightables::newLitFlashlightables' has a wrong offset!");

// Function DBDGameplay.FlashlightComponent.GetEffectiveBlindnessDuration
// 0x0004 (0x0004 - 0x0000)
struct FlashlightComponent_GetEffectiveBlindnessDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FlashlightComponent_GetEffectiveBlindnessDuration) == 0x000004, "Wrong alignment on FlashlightComponent_GetEffectiveBlindnessDuration");
static_assert(sizeof(FlashlightComponent_GetEffectiveBlindnessDuration) == 0x000004, "Wrong size on FlashlightComponent_GetEffectiveBlindnessDuration");
static_assert(offsetof(FlashlightComponent_GetEffectiveBlindnessDuration, ReturnValue) == 0x000000, "Member 'FlashlightComponent_GetEffectiveBlindnessDuration::ReturnValue' has a wrong offset!");

// Function DBDGameplay.FlashlightComponent.GetEffectiveTimeToBlindModifier
// 0x0004 (0x0004 - 0x0000)
struct FlashlightComponent_GetEffectiveTimeToBlindModifier final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FlashlightComponent_GetEffectiveTimeToBlindModifier) == 0x000004, "Wrong alignment on FlashlightComponent_GetEffectiveTimeToBlindModifier");
static_assert(sizeof(FlashlightComponent_GetEffectiveTimeToBlindModifier) == 0x000004, "Wrong size on FlashlightComponent_GetEffectiveTimeToBlindModifier");
static_assert(offsetof(FlashlightComponent_GetEffectiveTimeToBlindModifier, ReturnValue) == 0x000000, "Member 'FlashlightComponent_GetEffectiveTimeToBlindModifier::ReturnValue' has a wrong offset!");

// Function DBDGameplay.FlashlightComponent.IsOn
// 0x0001 (0x0001 - 0x0000)
struct FlashlightComponent_IsOn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FlashlightComponent_IsOn) == 0x000001, "Wrong alignment on FlashlightComponent_IsOn");
static_assert(sizeof(FlashlightComponent_IsOn) == 0x000001, "Wrong size on FlashlightComponent_IsOn");
static_assert(offsetof(FlashlightComponent_IsOn, ReturnValue) == 0x000000, "Member 'FlashlightComponent_IsOn::ReturnValue' has a wrong offset!");

// Function DBDGameplay.FlashlightConeComponent.GetEffectiveConeHalfAngle
// 0x0004 (0x0004 - 0x0000)
struct FlashlightConeComponent_GetEffectiveConeHalfAngle final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FlashlightConeComponent_GetEffectiveConeHalfAngle) == 0x000004, "Wrong alignment on FlashlightConeComponent_GetEffectiveConeHalfAngle");
static_assert(sizeof(FlashlightConeComponent_GetEffectiveConeHalfAngle) == 0x000004, "Wrong size on FlashlightConeComponent_GetEffectiveConeHalfAngle");
static_assert(offsetof(FlashlightConeComponent_GetEffectiveConeHalfAngle, ReturnValue) == 0x000000, "Member 'FlashlightConeComponent_GetEffectiveConeHalfAngle::ReturnValue' has a wrong offset!");

// Function DBDGameplay.FlashlightConeComponent.GetEffectiveConeLength
// 0x0004 (0x0004 - 0x0000)
struct FlashlightConeComponent_GetEffectiveConeLength final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FlashlightConeComponent_GetEffectiveConeLength) == 0x000004, "Wrong alignment on FlashlightConeComponent_GetEffectiveConeLength");
static_assert(sizeof(FlashlightConeComponent_GetEffectiveConeLength) == 0x000004, "Wrong size on FlashlightConeComponent_GetEffectiveConeLength");
static_assert(offsetof(FlashlightConeComponent_GetEffectiveConeLength, ReturnValue) == 0x000000, "Member 'FlashlightConeComponent_GetEffectiveConeLength::ReturnValue' has a wrong offset!");

// Function DBDGameplay.FlashlightConeComponent.GetOcclusionDistance
// 0x0004 (0x0004 - 0x0000)
struct FlashlightConeComponent_GetOcclusionDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FlashlightConeComponent_GetOcclusionDistance) == 0x000004, "Wrong alignment on FlashlightConeComponent_GetOcclusionDistance");
static_assert(sizeof(FlashlightConeComponent_GetOcclusionDistance) == 0x000004, "Wrong size on FlashlightConeComponent_GetOcclusionDistance");
static_assert(offsetof(FlashlightConeComponent_GetOcclusionDistance, ReturnValue) == 0x000000, "Member 'FlashlightConeComponent_GetOcclusionDistance::ReturnValue' has a wrong offset!");

// Function DBDGameplay.FlashlightFXComponent.OnCollectedEvent
// 0x0008 (0x0008 - 0x0000)
struct FlashlightFXComponent_OnCollectedEvent final
{
public:
	class ADBDPlayer*                             collector;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FlashlightFXComponent_OnCollectedEvent) == 0x000008, "Wrong alignment on FlashlightFXComponent_OnCollectedEvent");
static_assert(sizeof(FlashlightFXComponent_OnCollectedEvent) == 0x000008, "Wrong size on FlashlightFXComponent_OnCollectedEvent");
static_assert(offsetof(FlashlightFXComponent_OnCollectedEvent, collector) == 0x000000, "Member 'FlashlightFXComponent_OnCollectedEvent::collector' has a wrong offset!");

// Function DBDGameplay.FlashlightFXComponent.OnCollectorLocallyObservedChangedEvent
// 0x0001 (0x0001 - 0x0000)
struct FlashlightFXComponent_OnCollectorLocallyObservedChangedEvent final
{
public:
	bool                                          isLocallyObserved;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FlashlightFXComponent_OnCollectorLocallyObservedChangedEvent) == 0x000001, "Wrong alignment on FlashlightFXComponent_OnCollectorLocallyObservedChangedEvent");
static_assert(sizeof(FlashlightFXComponent_OnCollectorLocallyObservedChangedEvent) == 0x000001, "Wrong size on FlashlightFXComponent_OnCollectorLocallyObservedChangedEvent");
static_assert(offsetof(FlashlightFXComponent_OnCollectorLocallyObservedChangedEvent, isLocallyObserved) == 0x000000, "Member 'FlashlightFXComponent_OnCollectorLocallyObservedChangedEvent::isLocallyObserved' has a wrong offset!");

// Function DBDGameplay.FlashlightFXComponent.UpdateConeEvent
// 0x0008 (0x0008 - 0x0000)
struct FlashlightFXComponent_UpdateConeEvent final
{
public:
	float                                         length;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         halfAngle;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FlashlightFXComponent_UpdateConeEvent) == 0x000004, "Wrong alignment on FlashlightFXComponent_UpdateConeEvent");
static_assert(sizeof(FlashlightFXComponent_UpdateConeEvent) == 0x000008, "Wrong size on FlashlightFXComponent_UpdateConeEvent");
static_assert(offsetof(FlashlightFXComponent_UpdateConeEvent, length) == 0x000000, "Member 'FlashlightFXComponent_UpdateConeEvent::length' has a wrong offset!");
static_assert(offsetof(FlashlightFXComponent_UpdateConeEvent, halfAngle) == 0x000004, "Member 'FlashlightFXComponent_UpdateConeEvent::halfAngle' has a wrong offset!");

// Function DBDGameplay.FlashlightFXComponent.GetBlindingSuccessRatio
// 0x0004 (0x0004 - 0x0000)
struct FlashlightFXComponent_GetBlindingSuccessRatio final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FlashlightFXComponent_GetBlindingSuccessRatio) == 0x000004, "Wrong alignment on FlashlightFXComponent_GetBlindingSuccessRatio");
static_assert(sizeof(FlashlightFXComponent_GetBlindingSuccessRatio) == 0x000004, "Wrong size on FlashlightFXComponent_GetBlindingSuccessRatio");
static_assert(offsetof(FlashlightFXComponent_GetBlindingSuccessRatio, ReturnValue) == 0x000000, "Member 'FlashlightFXComponent_GetBlindingSuccessRatio::ReturnValue' has a wrong offset!");

// Function DBDGameplay.FootstepManagerComponent.OnUpdateCreatorFootsteps
// 0x0008 (0x0008 - 0x0000)
struct FootstepManagerComponent_OnUpdateCreatorFootsteps final
{
public:
	class UFootstepCreatorComponent*              creator;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FootstepManagerComponent_OnUpdateCreatorFootsteps) == 0x000008, "Wrong alignment on FootstepManagerComponent_OnUpdateCreatorFootsteps");
static_assert(sizeof(FootstepManagerComponent_OnUpdateCreatorFootsteps) == 0x000008, "Wrong size on FootstepManagerComponent_OnUpdateCreatorFootsteps");
static_assert(offsetof(FootstepManagerComponent_OnUpdateCreatorFootsteps, creator) == 0x000000, "Member 'FootstepManagerComponent_OnUpdateCreatorFootsteps::creator' has a wrong offset!");

// Function DBDGameplay.FootstepManagerComponent.TriggerSpawnFootstep
// 0x0018 (0x0018 - 0x0000)
struct FootstepManagerComponent_TriggerSpawnFootstep final
{
public:
	class UFootstepCreatorComponent*              originatorComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                location;                                          // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FootstepManagerComponent_TriggerSpawnFootstep) == 0x000008, "Wrong alignment on FootstepManagerComponent_TriggerSpawnFootstep");
static_assert(sizeof(FootstepManagerComponent_TriggerSpawnFootstep) == 0x000018, "Wrong size on FootstepManagerComponent_TriggerSpawnFootstep");
static_assert(offsetof(FootstepManagerComponent_TriggerSpawnFootstep, originatorComponent) == 0x000000, "Member 'FootstepManagerComponent_TriggerSpawnFootstep::originatorComponent' has a wrong offset!");
static_assert(offsetof(FootstepManagerComponent_TriggerSpawnFootstep, location) == 0x000008, "Member 'FootstepManagerComponent_TriggerSpawnFootstep::location' has a wrong offset!");

// Function DBDGameplay.KillerInstinctComponent.GetParticleSystem
// 0x0008 (0x0008 - 0x0000)
struct KillerInstinctComponent_GetParticleSystem final
{
public:
	class UNiagaraComponent*                      ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KillerInstinctComponent_GetParticleSystem) == 0x000008, "Wrong alignment on KillerInstinctComponent_GetParticleSystem");
static_assert(sizeof(KillerInstinctComponent_GetParticleSystem) == 0x000008, "Wrong size on KillerInstinctComponent_GetParticleSystem");
static_assert(offsetof(KillerInstinctComponent_GetParticleSystem, ReturnValue) == 0x000000, "Member 'KillerInstinctComponent_GetParticleSystem::ReturnValue' has a wrong offset!");

// Function DBDGameplay.KillerInstinctComponent.OnKillerLocallyObservedChanged
// 0x0001 (0x0001 - 0x0000)
struct KillerInstinctComponent_OnKillerLocallyObservedChanged final
{
public:
	bool                                          locallyObserved;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KillerInstinctComponent_OnKillerLocallyObservedChanged) == 0x000001, "Wrong alignment on KillerInstinctComponent_OnKillerLocallyObservedChanged");
static_assert(sizeof(KillerInstinctComponent_OnKillerLocallyObservedChanged) == 0x000001, "Wrong size on KillerInstinctComponent_OnKillerLocallyObservedChanged");
static_assert(offsetof(KillerInstinctComponent_OnKillerLocallyObservedChanged, locallyObserved) == 0x000000, "Member 'KillerInstinctComponent_OnKillerLocallyObservedChanged::locallyObserved' has a wrong offset!");

// Function DBDGameplay.KillerInstinctComponent.SetParticleSystem
// 0x0008 (0x0008 - 0x0000)
struct KillerInstinctComponent_SetParticleSystem final
{
public:
	class UNiagaraComponent*                      particleSystemComponent;                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KillerInstinctComponent_SetParticleSystem) == 0x000008, "Wrong alignment on KillerInstinctComponent_SetParticleSystem");
static_assert(sizeof(KillerInstinctComponent_SetParticleSystem) == 0x000008, "Wrong size on KillerInstinctComponent_SetParticleSystem");
static_assert(offsetof(KillerInstinctComponent_SetParticleSystem, particleSystemComponent) == 0x000000, "Member 'KillerInstinctComponent_SetParticleSystem::particleSystemComponent' has a wrong offset!");

// Function DBDGameplay.KillerInstinctComponent.IsOwnerInKillerInstinctRadius
// 0x0001 (0x0001 - 0x0000)
struct KillerInstinctComponent_IsOwnerInKillerInstinctRadius final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KillerInstinctComponent_IsOwnerInKillerInstinctRadius) == 0x000001, "Wrong alignment on KillerInstinctComponent_IsOwnerInKillerInstinctRadius");
static_assert(sizeof(KillerInstinctComponent_IsOwnerInKillerInstinctRadius) == 0x000001, "Wrong size on KillerInstinctComponent_IsOwnerInKillerInstinctRadius");
static_assert(offsetof(KillerInstinctComponent_IsOwnerInKillerInstinctRadius, ReturnValue) == 0x000000, "Member 'KillerInstinctComponent_IsOwnerInKillerInstinctRadius::ReturnValue' has a wrong offset!");

// Function DBDGameplay.LullabyFeedbackComponent.OnSlasherSet
// 0x0008 (0x0008 - 0x0000)
struct LullabyFeedbackComponent_OnSlasherSet final
{
public:
	class ASlasherPlayer*                         killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LullabyFeedbackComponent_OnSlasherSet) == 0x000008, "Wrong alignment on LullabyFeedbackComponent_OnSlasherSet");
static_assert(sizeof(LullabyFeedbackComponent_OnSlasherSet) == 0x000008, "Wrong size on LullabyFeedbackComponent_OnSlasherSet");
static_assert(offsetof(LullabyFeedbackComponent_OnSlasherSet, killer) == 0x000000, "Member 'LullabyFeedbackComponent_OnSlasherSet::killer' has a wrong offset!");

// Function DBDGameplay.MapCollectable.GetActorKnowledgeCollection
// 0x0008 (0x0008 - 0x0000)
struct MapCollectable_GetActorKnowledgeCollection final
{
public:
	class UActorKnowledgeCollection*              ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MapCollectable_GetActorKnowledgeCollection) == 0x000008, "Wrong alignment on MapCollectable_GetActorKnowledgeCollection");
static_assert(sizeof(MapCollectable_GetActorKnowledgeCollection) == 0x000008, "Wrong size on MapCollectable_GetActorKnowledgeCollection");
static_assert(offsetof(MapCollectable_GetActorKnowledgeCollection, ReturnValue) == 0x000000, "Member 'MapCollectable_GetActorKnowledgeCollection::ReturnValue' has a wrong offset!");

// Function DBDGameplay.MapCollectable.GetChargeableComponent
// 0x0008 (0x0008 - 0x0000)
struct MapCollectable_GetChargeableComponent final
{
public:
	class UChargeableComponent*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MapCollectable_GetChargeableComponent) == 0x000008, "Wrong alignment on MapCollectable_GetChargeableComponent");
static_assert(sizeof(MapCollectable_GetChargeableComponent) == 0x000008, "Wrong size on MapCollectable_GetChargeableComponent");
static_assert(offsetof(MapCollectable_GetChargeableComponent, ReturnValue) == 0x000000, "Member 'MapCollectable_GetChargeableComponent::ReturnValue' has a wrong offset!");

// Function DBDGameplay.MapCollectable.GetChargerComponent
// 0x0008 (0x0008 - 0x0000)
struct MapCollectable_GetChargerComponent final
{
public:
	class UChargerComponent*                      ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MapCollectable_GetChargerComponent) == 0x000008, "Wrong alignment on MapCollectable_GetChargerComponent");
static_assert(sizeof(MapCollectable_GetChargerComponent) == 0x000008, "Wrong size on MapCollectable_GetChargerComponent");
static_assert(offsetof(MapCollectable_GetChargerComponent, ReturnValue) == 0x000000, "Member 'MapCollectable_GetChargerComponent::ReturnValue' has a wrong offset!");

// Function DBDGameplay.Medkit.Authority_OnAnyOngoingInteractionChanged
// 0x0001 (0x0001 - 0x0000)
struct Medkit_Authority_OnAnyOngoingInteractionChanged final
{
public:
	bool                                          isInteracting;                                     // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Medkit_Authority_OnAnyOngoingInteractionChanged) == 0x000001, "Wrong alignment on Medkit_Authority_OnAnyOngoingInteractionChanged");
static_assert(sizeof(Medkit_Authority_OnAnyOngoingInteractionChanged) == 0x000001, "Wrong size on Medkit_Authority_OnAnyOngoingInteractionChanged");
