#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDGraphics

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class DBDGraphics.FogOverrideComponent
// 0x0038 (0x00F0 - 0x00B8)
class UFogOverrideComponent final : public UActorComponent
{
public:
	float                                         _interpolationDistance;                            // 0x00B8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BC[0x34];                                      // 0x00BC(0x0034)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FogOverrideComponent">();
	}
	static class UFogOverrideComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFogOverrideComponent>();
	}
};
static_assert(alignof(UFogOverrideComponent) == 0x000008, "Wrong alignment on UFogOverrideComponent");
static_assert(sizeof(UFogOverrideComponent) == 0x0000F0, "Wrong size on UFogOverrideComponent");
static_assert(offsetof(UFogOverrideComponent, _interpolationDistance) == 0x0000B8, "Member 'UFogOverrideComponent::_interpolationDistance' has a wrong offset!");

// Class DBDGraphics.FogOverrideManager
// 0x0028 (0x00E0 - 0x00B8)
class UFogOverrideManager final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x28];                                      // 0x00B8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FogOverrideManager">();
	}
	static class UFogOverrideManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFogOverrideManager>();
	}
};
static_assert(alignof(UFogOverrideManager) == 0x000008, "Wrong alignment on UFogOverrideManager");
static_assert(sizeof(UFogOverrideManager) == 0x0000E0, "Wrong size on UFogOverrideManager");

}

