#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDUIManagers

#include "Basic.hpp"

#include "DBDUIManagers_structs.hpp"


namespace SDK::Params
{

// Function DBDUIManagers.DBDTextManager.GetLargeTextEnabled
// 0x0001 (0x0001 - 0x0000)
struct DBDTextManager_GetLargeTextEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDTextManager_GetLargeTextEnabled) == 0x000001, "Wrong alignment on DBDTextManager_GetLargeTextEnabled");
static_assert(sizeof(DBDTextManager_GetLargeTextEnabled) == 0x000001, "Wrong size on DBDTextManager_GetLargeTextEnabled");
static_assert(offsetof(DBDTextManager_GetLargeTextEnabled, ReturnValue) == 0x000000, "Member 'DBDTextManager_GetLargeTextEnabled::ReturnValue' has a wrong offset!");

// Function DBDUIManagers.UIScaleManager.GetDPIScaleCurveRatio
// 0x0001 (0x0001 - 0x0000)
struct UIScaleManager_GetDPIScaleCurveRatio final
{
public:
	EDPIScaleCurveRatio                           ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIScaleManager_GetDPIScaleCurveRatio) == 0x000001, "Wrong alignment on UIScaleManager_GetDPIScaleCurveRatio");
static_assert(sizeof(UIScaleManager_GetDPIScaleCurveRatio) == 0x000001, "Wrong size on UIScaleManager_GetDPIScaleCurveRatio");
static_assert(offsetof(UIScaleManager_GetDPIScaleCurveRatio, ReturnValue) == 0x000000, "Member 'UIScaleManager_GetDPIScaleCurveRatio::ReturnValue' has a wrong offset!");

// Function DBDUIManagers.UIScaleManager.GetHudScaleFactor
// 0x0004 (0x0004 - 0x0000)
struct UIScaleManager_GetHudScaleFactor final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIScaleManager_GetHudScaleFactor) == 0x000004, "Wrong alignment on UIScaleManager_GetHudScaleFactor");
static_assert(sizeof(UIScaleManager_GetHudScaleFactor) == 0x000004, "Wrong size on UIScaleManager_GetHudScaleFactor");
static_assert(offsetof(UIScaleManager_GetHudScaleFactor, ReturnValue) == 0x000000, "Member 'UIScaleManager_GetHudScaleFactor::ReturnValue' has a wrong offset!");

// Function DBDUIManagers.UIScaleManager.GetMenuScaleFactor
// 0x0004 (0x0004 - 0x0000)
struct UIScaleManager_GetMenuScaleFactor final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIScaleManager_GetMenuScaleFactor) == 0x000004, "Wrong alignment on UIScaleManager_GetMenuScaleFactor");
static_assert(sizeof(UIScaleManager_GetMenuScaleFactor) == 0x000004, "Wrong size on UIScaleManager_GetMenuScaleFactor");
static_assert(offsetof(UIScaleManager_GetMenuScaleFactor, ReturnValue) == 0x000000, "Member 'UIScaleManager_GetMenuScaleFactor::ReturnValue' has a wrong offset!");

// Function DBDUIManagers.UIScaleManager.GetScaleFactor
// 0x0008 (0x0008 - 0x0000)
struct UIScaleManager_GetScaleFactor final
{
public:
	EScaleType                                    type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIScaleManager_GetScaleFactor) == 0x000004, "Wrong alignment on UIScaleManager_GetScaleFactor");
static_assert(sizeof(UIScaleManager_GetScaleFactor) == 0x000008, "Wrong size on UIScaleManager_GetScaleFactor");
static_assert(offsetof(UIScaleManager_GetScaleFactor, type) == 0x000000, "Member 'UIScaleManager_GetScaleFactor::type' has a wrong offset!");
static_assert(offsetof(UIScaleManager_GetScaleFactor, ReturnValue) == 0x000004, "Member 'UIScaleManager_GetScaleFactor::ReturnValue' has a wrong offset!");

// Function DBDUIManagers.UIScaleManager.GetSkillCheckScaleFactor
// 0x0004 (0x0004 - 0x0000)
struct UIScaleManager_GetSkillCheckScaleFactor final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIScaleManager_GetSkillCheckScaleFactor) == 0x000004, "Wrong alignment on UIScaleManager_GetSkillCheckScaleFactor");
static_assert(sizeof(UIScaleManager_GetSkillCheckScaleFactor) == 0x000004, "Wrong size on UIScaleManager_GetSkillCheckScaleFactor");
static_assert(offsetof(UIScaleManager_GetSkillCheckScaleFactor, ReturnValue) == 0x000000, "Member 'UIScaleManager_GetSkillCheckScaleFactor::ReturnValue' has a wrong offset!");

}

