#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDUIViewInterfaces

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class DBDUIViewInterfaces.AddonViewInterface
// 0x0000 (0x0000 - 0x0000)
class IAddonViewInterface final
{
public:
	void ClearData();
	void SetData(const struct FAddonViewData& baseLoadoutPartViewData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddonViewInterface">();
	}
	static class IAddonViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAddonViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IAddonViewInterface) == 0x000001, "Wrong alignment on IAddonViewInterface");
static_assert(sizeof(IAddonViewInterface) == 0x000001, "Wrong size on IAddonViewInterface");

// Class DBDUIViewInterfaces.ArchiveCompendiumViewInterface
// 0x0000 (0x0000 - 0x0000)
class IArchiveCompendiumViewInterface final
{
public:
	void SetPastTomesViewData(const TArray<struct FCompendiumButtonData>& pastStoryButtonData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveCompendiumViewInterface">();
	}
	static class IArchiveCompendiumViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IArchiveCompendiumViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IArchiveCompendiumViewInterface) == 0x000001, "Wrong alignment on IArchiveCompendiumViewInterface");
static_assert(sizeof(IArchiveCompendiumViewInterface) == 0x000001, "Wrong size on IArchiveCompendiumViewInterface");

// Class DBDUIViewInterfaces.ArchiveEditorViewInterface
// 0x0000 (0x0000 - 0x0000)
class IArchiveEditorViewInterface final
{
public:
	void DisplayEditorSaving(const class FString& path);
	void InitEditor();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveEditorViewInterface">();
	}
	static class IArchiveEditorViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IArchiveEditorViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IArchiveEditorViewInterface) == 0x000001, "Wrong alignment on IArchiveEditorViewInterface");
static_assert(sizeof(IArchiveEditorViewInterface) == 0x000001, "Wrong size on IArchiveEditorViewInterface");

// Class DBDUIViewInterfaces.ArchiveImageViewerViewInterface
// 0x0000 (0x0000 - 0x0000)
class IArchiveImageViewerViewInterface final
{
public:
	void SetTextVisibility(bool visible);
	void SetVoiceOverAutoplay(bool voiceOverAutoplay);
	void SetVoiceOverPlaying(bool voiceOverPlaying);
	void UpdateContent(const struct FArchivesVignetteEntryViewData& data);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveImageViewerViewInterface">();
	}
	static class IArchiveImageViewerViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IArchiveImageViewerViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IArchiveImageViewerViewInterface) == 0x000001, "Wrong alignment on IArchiveImageViewerViewInterface");
static_assert(sizeof(IArchiveImageViewerViewInterface) == 0x000001, "Wrong size on IArchiveImageViewerViewInterface");

// Class DBDUIViewInterfaces.ArchiveJournalViewInterface
// 0x0000 (0x0000 - 0x0000)
class IArchiveJournalViewInterface final
{
public:
	void OnImageViewerVoiceOverAutoplay(bool autoplay);
	void OnImageViewerVoiceOverPlayed();
	void SetCinematicButtonsEnabled(bool enabled);
	void SetEntryData(const struct FArchivesVignetteEntryViewData& entryViewData);
	void SetVignetteData(const struct FArchivesVignetteViewData& vignetteViewData);
	void SetVignetteInputsEnabled(bool enabled);
	void SetVignetteList(const TArray<struct FArchivesVignetteViewData>& vignetteDataList);
	void SetVoiceOverAutoplay(bool voiceOverAutoplay);
	void SetVoiceOverPlaying(bool voiceOverPlaying);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveJournalViewInterface">();
	}
	static class IArchiveJournalViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IArchiveJournalViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IArchiveJournalViewInterface) == 0x000001, "Wrong alignment on IArchiveJournalViewInterface");
static_assert(sizeof(IArchiveJournalViewInterface) == 0x000001, "Wrong size on IArchiveJournalViewInterface");

// Class DBDUIViewInterfaces.ArchiveLevelProgressionViewInterface
// 0x0000 (0x0000 - 0x0000)
class IArchiveLevelProgressionViewInterface final
{
public:
	void GoToNextLevel(int32 levelIndex);
	void PlayRewardsAnimation();
	void SetActiveLevel(int32 levelIndex, bool performAction);
	void SetLevelSelectorEnabled(const bool enabled);
	void SetLevelSelectorVisibility(bool isVisible);
	void SetRewardsContainerVisibility(bool isVisible);
	void SetTomeLevelsData(const TArray<class UArchiveStoryLevelViewData*>& levelsData, int32 selectedLevel);
	void SetTomeRewardsData(const TArray<struct FRewardWrapperViewData>& rewardsData, bool areLocked);
	void UpdateLevelStatus(int32 level, EArchivesStoryLevelStatus status);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveLevelProgressionViewInterface">();
	}
	static class IArchiveLevelProgressionViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IArchiveLevelProgressionViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IArchiveLevelProgressionViewInterface) == 0x000001, "Wrong alignment on IArchiveLevelProgressionViewInterface");
static_assert(sizeof(IArchiveLevelProgressionViewInterface) == 0x000001, "Wrong size on IArchiveLevelProgressionViewInterface");

// Class DBDUIViewInterfaces.ArchiveStoryLevelViewData
// 0x0010 (0x0040 - 0x0030)
class UArchiveStoryLevelViewData final : public UObject
{
public:
	int32                                         Level;                                             // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EArchivesStoryLevelStatus                     Status;                                            // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              StartDate;                                         // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveStoryLevelViewData">();
	}
	static class UArchiveStoryLevelViewData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveStoryLevelViewData>();
	}
};
static_assert(alignof(UArchiveStoryLevelViewData) == 0x000008, "Wrong alignment on UArchiveStoryLevelViewData");
static_assert(sizeof(UArchiveStoryLevelViewData) == 0x000040, "Wrong size on UArchiveStoryLevelViewData");
static_assert(offsetof(UArchiveStoryLevelViewData, Level) == 0x000030, "Member 'UArchiveStoryLevelViewData::Level' has a wrong offset!");
static_assert(offsetof(UArchiveStoryLevelViewData, Status) == 0x000034, "Member 'UArchiveStoryLevelViewData::Status' has a wrong offset!");
static_assert(offsetof(UArchiveStoryLevelViewData, StartDate) == 0x000038, "Member 'UArchiveStoryLevelViewData::StartDate' has a wrong offset!");

// Class DBDUIViewInterfaces.ArchiveMenuViewInterface
// 0x0000 (0x0000 - 0x0000)
class IArchiveMenuViewInterface final
{
public:
	void ClearChallengeReminderData(EPlayerRole role);
	void CloseSlotSelector();
	void HideUI();
	void Init();
	void SetChallengeReminderData(const struct FArchiveChallengeReminderViewData& data, EPlayerRole role, bool needsAnimation, const struct FVector2D& animationOriginalPosition);
	void SetChallengeReminderVisibility(bool isVisible);
	void SetControllerElementsEnabled(bool enabled);
	void SetEventLabel(const class FString& eventLabel);
	void SetInfoButtonEnabled(bool isEnabled);
	void SetInfoButtonVisible(bool isVisible);
	void SetMenuState(EArchiveMenuState menuState);
	void SetQuestNodeHoverEffect(EPlayerRole role, bool isHovered);
	void SetRemainingTime(const class FString& remainingTime, bool isMoreThanWarningThreshold, EArchiveMenuState menuState);
	void SetRemainingTimeVisible(bool isVisible);
	void SetReminderSlotsEnabled(bool enabled);
	void SetSubtitle(const class FText& subtitle);
	void SetSubtitleVisible(bool isVisible);
	void SetTabEnabled(int32 key, bool enabled);
	void SetTabsData(const TArray<struct FTabWidgetData>& tabsData, int32 selectedKey);
	void SetTabSelected(int32 key);
	void SetTabsInputsEnabled(bool enabled);
	void SetTitle(const class FText& title);
	void ShowSlotSelector(const struct FArchiveNodeViewData& data);
	void ShowUI();
	void UpdateBackgroundSkin(const int32 key, const struct FArchiveTomeSkinData& data);

	TScriptInterface<class IArchiveCompendiumViewInterface> GetArchiveCompendiumInterface() const;
	TScriptInterface<class IArchiveRiftViewInterface> GetArchiveRiftInterface() const;
	TScriptInterface<class IArchiveTomeViewInterface> GetArchiveTomeInterface() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveMenuViewInterface">();
	}
	static class IArchiveMenuViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IArchiveMenuViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IArchiveMenuViewInterface) == 0x000001, "Wrong alignment on IArchiveMenuViewInterface");
static_assert(sizeof(IArchiveMenuViewInterface) == 0x000001, "Wrong size on IArchiveMenuViewInterface");

// Class DBDUIViewInterfaces.BasePopupViewData
// 0x0038 (0x0068 - 0x0030)
class UBasePopupViewData : public UObject
{
public:
	EPopupPriority                                Priority;                                          // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Title;                                             // 0x0038(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   Message;                                           // 0x0050(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BasePopupViewData">();
	}
	static class UBasePopupViewData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBasePopupViewData>();
	}
};
static_assert(alignof(UBasePopupViewData) == 0x000008, "Wrong alignment on UBasePopupViewData");
static_assert(sizeof(UBasePopupViewData) == 0x000068, "Wrong size on UBasePopupViewData");
static_assert(offsetof(UBasePopupViewData, Priority) == 0x000030, "Member 'UBasePopupViewData::Priority' has a wrong offset!");
static_assert(offsetof(UBasePopupViewData, Title) == 0x000038, "Member 'UBasePopupViewData::Title' has a wrong offset!");
static_assert(offsetof(UBasePopupViewData, Message) == 0x000050, "Member 'UBasePopupViewData::Message' has a wrong offset!");

// Class DBDUIViewInterfaces.GenericPopupViewData
// 0x0188 (0x01F0 - 0x0068)
class UGenericPopupViewData : public UBasePopupViewData
{
public:
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPopupButtonViewData                   ProgressionData;                                   // 0x0070(0x0080)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FPopupButtonViewData                   RegressionData;                                    // 0x00F0(0x0080)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FPopupButtonViewData                   AlternativeData;                                   // 0x0170(0x0080)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GenericPopupViewData">();
	}
	static class UGenericPopupViewData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGenericPopupViewData>();
	}
};
static_assert(alignof(UGenericPopupViewData) == 0x000010, "Wrong alignment on UGenericPopupViewData");
static_assert(sizeof(UGenericPopupViewData) == 0x0001F0, "Wrong size on UGenericPopupViewData");
static_assert(offsetof(UGenericPopupViewData, ProgressionData) == 0x000070, "Member 'UGenericPopupViewData::ProgressionData' has a wrong offset!");
static_assert(offsetof(UGenericPopupViewData, RegressionData) == 0x0000F0, "Member 'UGenericPopupViewData::RegressionData' has a wrong offset!");
static_assert(offsetof(UGenericPopupViewData, AlternativeData) == 0x000170, "Member 'UGenericPopupViewData::AlternativeData' has a wrong offset!");

// Class DBDUIViewInterfaces.ArchivePassPurchasePopupViewData
// 0x0060 (0x0250 - 0x01F0)
class UArchivePassPurchasePopupViewData final : public UGenericPopupViewData
{
public:
	class FText                                   AvailabilityDates;                                 // 0x01F0(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              ImageTexture;                                      // 0x0208(0x0030)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECurrencyType                                 CurrencyType;                                      // 0x0238(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Price;                                             // 0x023C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DiscountPercentage;                                // 0x0240(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsAffordable;                                      // 0x0244(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_245[0xB];                                      // 0x0245(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchivePassPurchasePopupViewData">();
	}
	static class UArchivePassPurchasePopupViewData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchivePassPurchasePopupViewData>();
	}
};
static_assert(alignof(UArchivePassPurchasePopupViewData) == 0x000010, "Wrong alignment on UArchivePassPurchasePopupViewData");
static_assert(sizeof(UArchivePassPurchasePopupViewData) == 0x000250, "Wrong size on UArchivePassPurchasePopupViewData");
static_assert(offsetof(UArchivePassPurchasePopupViewData, AvailabilityDates) == 0x0001F0, "Member 'UArchivePassPurchasePopupViewData::AvailabilityDates' has a wrong offset!");
static_assert(offsetof(UArchivePassPurchasePopupViewData, ImageTexture) == 0x000208, "Member 'UArchivePassPurchasePopupViewData::ImageTexture' has a wrong offset!");
static_assert(offsetof(UArchivePassPurchasePopupViewData, CurrencyType) == 0x000238, "Member 'UArchivePassPurchasePopupViewData::CurrencyType' has a wrong offset!");
static_assert(offsetof(UArchivePassPurchasePopupViewData, Price) == 0x00023C, "Member 'UArchivePassPurchasePopupViewData::Price' has a wrong offset!");
static_assert(offsetof(UArchivePassPurchasePopupViewData, DiscountPercentage) == 0x000240, "Member 'UArchivePassPurchasePopupViewData::DiscountPercentage' has a wrong offset!");
static_assert(offsetof(UArchivePassPurchasePopupViewData, IsAffordable) == 0x000244, "Member 'UArchivePassPurchasePopupViewData::IsAffordable' has a wrong offset!");

// Class DBDUIViewInterfaces.ArchivePassPurchasePopupViewInterface
// 0x0000 (0x0000 - 0x0000)
class IArchivePassPurchasePopupViewInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchivePassPurchasePopupViewInterface">();
	}
	static class IArchivePassPurchasePopupViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IArchivePassPurchasePopupViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IArchivePassPurchasePopupViewInterface) == 0x000001, "Wrong alignment on IArchivePassPurchasePopupViewInterface");
static_assert(sizeof(IArchivePassPurchasePopupViewInterface) == 0x000001, "Wrong size on IArchivePassPurchasePopupViewInterface");

// Class DBDUIViewInterfaces.ArchiveQuestMapViewInterface
// 0x0000 (0x0000 - 0x0000)
class IArchiveQuestMapViewInterface final
{
public:
	void Reset();
	void SetLoadingSpinner(bool isLoading);
	void SetQuestMapData(const TArray<struct FArchiveNodeGraphViewData>& nodeDataList, const TArray<struct FArchiveMapPathViewData>& pathDataList, bool needsCascadeAppear);
	void UpdateQuestMapData(const TArray<struct FArchiveNodeGraphViewData>& nodeDataList, const TArray<struct FArchiveMapPathViewData>& pathDataList);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveQuestMapViewInterface">();
	}
	static class IArchiveQuestMapViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IArchiveQuestMapViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IArchiveQuestMapViewInterface) == 0x000001, "Wrong alignment on IArchiveQuestMapViewInterface");
static_assert(sizeof(IArchiveQuestMapViewInterface) == 0x000001, "Wrong size on IArchiveQuestMapViewInterface");

// Class DBDUIViewInterfaces.ArchiveRiftViewInterface
// 0x0000 (0x0000 - 0x0000)
class IArchiveRiftViewInterface final
{
public:
	void PlayUnlockingAnimation(const struct FArchivesRiftUnlockSequenceData& data);
	void SetData(const struct FArchivesRiftGenericViewData& data);
	void SetLoadingSpinner(bool isLoading);
	void SetMatchmakingSoftlockState(bool isInMatchmakingSoftlock);
	void SetRewardTiersData(const TArray<struct FArchiveRiftTierRewardsViewData>& riftTiersData);
	void SetRiftFragmentTooltipViewData(const struct FCurrencyProgressionTooltipViewData& RiftFragmentTooltipViewData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveRiftViewInterface">();
	}
	static class IArchiveRiftViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IArchiveRiftViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IArchiveRiftViewInterface) == 0x000001, "Wrong alignment on IArchiveRiftViewInterface");
static_assert(sizeof(IArchiveRiftViewInterface) == 0x000001, "Wrong size on IArchiveRiftViewInterface");

// Class DBDUIViewInterfaces.ArchiveTierPurchasePopupViewData
// 0x0060 (0x0250 - 0x01F0)
class UArchiveTierPurchasePopupViewData final : public UGenericPopupViewData
{
public:
	TSoftObjectPtr<class UTexture2D>              ImageTexture;                                      // 0x01F0(0x0030)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxTiers;                                          // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentTier;                                       // 0x0224(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECurrencyType                                 CurrencyType;                                      // 0x0228(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         UnitPrice;                                         // 0x022C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DiscountPercentage;                                // 0x0230(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsAffordable;                                      // 0x0234(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentWalletAmount;                               // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InitialQuantity;                                   // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FirstBonusTier;                                    // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LastBonusTier;                                     // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsBonusTier;                                       // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveTierPurchasePopupViewData">();
	}
	static class UArchiveTierPurchasePopupViewData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveTierPurchasePopupViewData>();
	}
};
static_assert(alignof(UArchiveTierPurchasePopupViewData) == 0x000010, "Wrong alignment on UArchiveTierPurchasePopupViewData");
static_assert(sizeof(UArchiveTierPurchasePopupViewData) == 0x000250, "Wrong size on UArchiveTierPurchasePopupViewData");
static_assert(offsetof(UArchiveTierPurchasePopupViewData, ImageTexture) == 0x0001F0, "Member 'UArchiveTierPurchasePopupViewData::ImageTexture' has a wrong offset!");
static_assert(offsetof(UArchiveTierPurchasePopupViewData, MaxTiers) == 0x000220, "Member 'UArchiveTierPurchasePopupViewData::MaxTiers' has a wrong offset!");
static_assert(offsetof(UArchiveTierPurchasePopupViewData, CurrentTier) == 0x000224, "Member 'UArchiveTierPurchasePopupViewData::CurrentTier' has a wrong offset!");
static_assert(offsetof(UArchiveTierPurchasePopupViewData, CurrencyType) == 0x000228, "Member 'UArchiveTierPurchasePopupViewData::CurrencyType' has a wrong offset!");
static_assert(offsetof(UArchiveTierPurchasePopupViewData, UnitPrice) == 0x00022C, "Member 'UArchiveTierPurchasePopupViewData::UnitPrice' has a wrong offset!");
static_assert(offsetof(UArchiveTierPurchasePopupViewData, DiscountPercentage) == 0x000230, "Member 'UArchiveTierPurchasePopupViewData::DiscountPercentage' has a wrong offset!");
static_assert(offsetof(UArchiveTierPurchasePopupViewData, IsAffordable) == 0x000234, "Member 'UArchiveTierPurchasePopupViewData::IsAffordable' has a wrong offset!");
static_assert(offsetof(UArchiveTierPurchasePopupViewData, CurrentWalletAmount) == 0x000238, "Member 'UArchiveTierPurchasePopupViewData::CurrentWalletAmount' has a wrong offset!");
static_assert(offsetof(UArchiveTierPurchasePopupViewData, InitialQuantity) == 0x00023C, "Member 'UArchiveTierPurchasePopupViewData::InitialQuantity' has a wrong offset!");
static_assert(offsetof(UArchiveTierPurchasePopupViewData, FirstBonusTier) == 0x000240, "Member 'UArchiveTierPurchasePopupViewData::FirstBonusTier' has a wrong offset!");
static_assert(offsetof(UArchiveTierPurchasePopupViewData, LastBonusTier) == 0x000244, "Member 'UArchiveTierPurchasePopupViewData::LastBonusTier' has a wrong offset!");
static_assert(offsetof(UArchiveTierPurchasePopupViewData, IsBonusTier) == 0x000248, "Member 'UArchiveTierPurchasePopupViewData::IsBonusTier' has a wrong offset!");

// Class DBDUIViewInterfaces.ArchiveTierPurchasePopupViewInterface
// 0x0000 (0x0000 - 0x0000)
class IArchiveTierPurchasePopupViewInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveTierPurchasePopupViewInterface">();
	}
	static class IArchiveTierPurchasePopupViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IArchiveTierPurchasePopupViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IArchiveTierPurchasePopupViewInterface) == 0x000001, "Wrong alignment on IArchiveTierPurchasePopupViewInterface");
static_assert(sizeof(IArchiveTierPurchasePopupViewInterface) == 0x000001, "Wrong size on IArchiveTierPurchasePopupViewInterface");

// Class DBDUIViewInterfaces.ArchiveTomeViewInterface
// 0x0000 (0x0000 - 0x0000)
class IArchiveTomeViewInterface final
{
public:
	void SetMenuState(EArchiveTomeMenuState menuState);
	void SetNotificationVisibility(int32 key, bool hasNotification);
	void SetSideNavTabsData(const TArray<struct FTabWidgetData>& tabsData, int32 selectedKey);
	void SetSideNavTabsEnabled(int32 key, bool isEnabled);
	void SetSideNavTabsVisibility(int32 key, bool isVisible);
	void ToggleEditor(bool isEnabled);
	void UpdateBackgroundSkin(int32 key, class UMaterialInterface* skinMaterail);

	struct FEditorInterfaces GetArchiveEditorInterface() const;
	TScriptInterface<class IArchiveJournalViewInterface> GetArchiveJournalInterface() const;
	TScriptInterface<class IArchiveLevelProgressionViewInterface> GetArchiveLevelProgressionInterface() const;
	TScriptInterface<class IArchiveQuestMapViewInterface> GetArchiveQuestMapInterface() const;
	const EArchiveTomeMenuState GetMenuState() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveTomeViewInterface">();
	}
	static class IArchiveTomeViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IArchiveTomeViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IArchiveTomeViewInterface) == 0x000001, "Wrong alignment on IArchiveTomeViewInterface");
static_assert(sizeof(IArchiveTomeViewInterface) == 0x000001, "Wrong size on IArchiveTomeViewInterface");

// Class DBDUIViewInterfaces.BasePopupViewInterface
// 0x0000 (0x0000 - 0x0000)
class IBasePopupViewInterface final
{
public:
	void Enter(class UBasePopupViewData* data);
	void Leave();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BasePopupViewInterface">();
	}
	static class IBasePopupViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IBasePopupViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IBasePopupViewInterface) == 0x000001, "Wrong alignment on IBasePopupViewInterface");
static_assert(sizeof(IBasePopupViewInterface) == 0x000001, "Wrong size on IBasePopupViewInterface");

// Class DBDUIViewInterfaces.ChallengeTrackerViewInterface
// 0x0000 (0x0000 - 0x0000)
class IChallengeTrackerViewInterface final
{
public:
	void CloseWidget();
	void InitWidgetData(const struct FChallengeTrackerViewData& viewData);
	void OpenWidget();
	void UpdateWidgetProgression(const struct FArchiveNodeObjectiveViewData& progressionData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChallengeTrackerViewInterface">();
	}
	static class IChallengeTrackerViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChallengeTrackerViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IChallengeTrackerViewInterface) == 0x000001, "Wrong alignment on IChallengeTrackerViewInterface");
static_assert(sizeof(IChallengeTrackerViewInterface) == 0x000001, "Wrong size on IChallengeTrackerViewInterface");

// Class DBDUIViewInterfaces.CoreBaseViewInterface
// 0x0000 (0x0000 - 0x0000)
class ICoreBaseViewInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CoreBaseViewInterface">();
	}
	static class ICoreBaseViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICoreBaseViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(ICoreBaseViewInterface) == 0x000001, "Wrong alignment on ICoreBaseViewInterface");
static_assert(sizeof(ICoreBaseViewInterface) == 0x000001, "Wrong size on ICoreBaseViewInterface");

// Class DBDUIViewInterfaces.CreditsViewInterface
// 0x0000 (0x0000 - 0x0000)
class ICreditsViewInterface final
{
public:
	void ScrollToEnd();
	void ScrollToName(const class FString& name, float delay);
	void SetText(const class FText& text);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreditsViewInterface">();
	}
	static class ICreditsViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICreditsViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(ICreditsViewInterface) == 0x000001, "Wrong alignment on ICreditsViewInterface");
static_assert(sizeof(ICreditsViewInterface) == 0x000001, "Wrong size on ICreditsViewInterface");

// Class DBDUIViewInterfaces.DailyRitualsPopupViewInterface
// 0x0000 (0x0000 - 0x0000)
class IDailyRitualsPopupViewInterface final
{
public:
	void SetAllDailyRitualTilesVisible();
	void SetCanRemoveDailyRitual(const bool canRemoveDailyRitual);
	void SetDailyRitualsData(const TArray<struct FDailyRitualViewData>& dailyRitualsData, bool isAfterTrial);
	void StartAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DailyRitualsPopupViewInterface">();
	}
	static class IDailyRitualsPopupViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDailyRitualsPopupViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IDailyRitualsPopupViewInterface) == 0x000001, "Wrong alignment on IDailyRitualsPopupViewInterface");
static_assert(sizeof(IDailyRitualsPopupViewInterface) == 0x000001, "Wrong size on IDailyRitualsPopupViewInterface");

// Class DBDUIViewInterfaces.DisplayStandViewInterface
// 0x0000 (0x0000 - 0x0000)
class IDisplayStandViewInterface final
{
public:
	void SetDragZone(const struct FDisplayStandViewData& layoutData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DisplayStandViewInterface">();
	}
	static class IDisplayStandViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDisplayStandViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IDisplayStandViewInterface) == 0x000001, "Wrong alignment on IDisplayStandViewInterface");
static_assert(sizeof(IDisplayStandViewInterface) == 0x000001, "Wrong size on IDisplayStandViewInterface");

// Class DBDUIViewInterfaces.EndGameCollapseBarViewInterface
// 0x0000 (0x0000 - 0x0000)
class IEndGameCollapseBarViewInterface final
{
public:
	void InitEndGameScenario();
	void SetEndGameScenarioProgressionMode(const bool isSlowMode);
	void SetEndGameScenarioProgressionValue(const float amount);
	void StartEndGameScenario();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndGameCollapseBarViewInterface">();
	}
	static class IEndGameCollapseBarViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IEndGameCollapseBarViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IEndGameCollapseBarViewInterface) == 0x000001, "Wrong alignment on IEndGameCollapseBarViewInterface");
static_assert(sizeof(IEndGameCollapseBarViewInterface) == 0x000001, "Wrong size on IEndGameCollapseBarViewInterface");

// Class DBDUIViewInterfaces.EquippedItemViewInterface
// 0x0000 (0x0000 - 0x0000)
class IEquippedItemViewInterface final
{
public:
	void ClearData(bool fullClear);
	void SetActiveState(bool isActive);
	void SetData(const struct FItemBundleViewData& itemBundleData);
	void SetFakeItem(bool isHoldingFakeItem, const TSoftObjectPtr<class UTexture2D>& fakeItemIcon);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EquippedItemViewInterface">();
	}
	static class IEquippedItemViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IEquippedItemViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IEquippedItemViewInterface) == 0x000001, "Wrong alignment on IEquippedItemViewInterface");
static_assert(sizeof(IEquippedItemViewInterface) == 0x000001, "Wrong size on IEquippedItemViewInterface");

// Class DBDUIViewInterfaces.EquippedPowerViewInterface
// 0x0000 (0x0000 - 0x0000)
class IEquippedPowerViewInterface final
{
public:
	void ClearData();
	void SetActiveState(bool isActive);
	void SetCarryingMode(const bool isCarrying);
	void SetData(const struct FPowerBundleViewData& powerBundleData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EquippedPowerViewInterface">();
	}
	static class IEquippedPowerViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IEquippedPowerViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IEquippedPowerViewInterface) == 0x000001, "Wrong alignment on IEquippedPowerViewInterface");
static_assert(sizeof(IEquippedPowerViewInterface) == 0x000001, "Wrong size on IEquippedPowerViewInterface");

// Class DBDUIViewInterfaces.EventEntryPopupViewData
// 0x0080 (0x0270 - 0x01F0)
class UEventEntryPopupViewData final : public UGenericPopupViewData
{
public:
	class FText                                   AvailabilityDates;                                 // 0x01F0(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   EventFrameLabel;                                   // 0x0208(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   ImageBannerText;                                   // 0x0220(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              ImageTexture;                                      // 0x0238(0x0030)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldShowEventTomeButton;                         // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EventEntryPopupViewData">();
	}
	static class UEventEntryPopupViewData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventEntryPopupViewData>();
	}
};
static_assert(alignof(UEventEntryPopupViewData) == 0x000010, "Wrong alignment on UEventEntryPopupViewData");
static_assert(sizeof(UEventEntryPopupViewData) == 0x000270, "Wrong size on UEventEntryPopupViewData");
static_assert(offsetof(UEventEntryPopupViewData, AvailabilityDates) == 0x0001F0, "Member 'UEventEntryPopupViewData::AvailabilityDates' has a wrong offset!");
static_assert(offsetof(UEventEntryPopupViewData, EventFrameLabel) == 0x000208, "Member 'UEventEntryPopupViewData::EventFrameLabel' has a wrong offset!");
static_assert(offsetof(UEventEntryPopupViewData, ImageBannerText) == 0x000220, "Member 'UEventEntryPopupViewData::ImageBannerText' has a wrong offset!");
static_assert(offsetof(UEventEntryPopupViewData, ImageTexture) == 0x000238, "Member 'UEventEntryPopupViewData::ImageTexture' has a wrong offset!");
static_assert(offsetof(UEventEntryPopupViewData, ShouldShowEventTomeButton) == 0x000268, "Member 'UEventEntryPopupViewData::ShouldShowEventTomeButton' has a wrong offset!");

// Class DBDUIViewInterfaces.EventEntryPopupViewInterface
// 0x0000 (0x0000 - 0x0000)
class IEventEntryPopupViewInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EventEntryPopupViewInterface">();
	}
	static class IEventEntryPopupViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IEventEntryPopupViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IEventEntryPopupViewInterface) == 0x000001, "Wrong alignment on IEventEntryPopupViewInterface");
static_assert(sizeof(IEventEntryPopupViewInterface) == 0x000001, "Wrong size on IEventEntryPopupViewInterface");

// Class DBDUIViewInterfaces.ExampleViewInterface
// 0x0000 (0x0000 - 0x0000)
class IExampleViewInterface final
{
public:
	void SetExampleProgressRatio(float ratio);
	void SetExampleText(const class FString& text);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ExampleViewInterface">();
	}
	static class IExampleViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IExampleViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IExampleViewInterface) == 0x000001, "Wrong alignment on IExampleViewInterface");
static_assert(sizeof(IExampleViewInterface) == 0x000001, "Wrong size on IExampleViewInterface");

// Class DBDUIViewInterfaces.ExternalEffectsViewInterface
// 0x0000 (0x0000 - 0x0000)
class IExternalEffectsViewInterface final
{
public:
	void HideExternalAddon(const class FName& itemId);
	void HideExternalPerk(const class FName& itemId);
	void ShowExternalAddon(const struct FAddonViewData& addonViewData);
	void ShowExternalPerk(const struct FPerkViewData& perkViewData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ExternalEffectsViewInterface">();
	}
	static class IExternalEffectsViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IExternalEffectsViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IExternalEffectsViewInterface) == 0x000001, "Wrong alignment on IExternalEffectsViewInterface");
static_assert(sizeof(IExternalEffectsViewInterface) == 0x000001, "Wrong size on IExternalEffectsViewInterface");

// Class DBDUIViewInterfaces.FearMarketPopupViewData
// 0x0020 (0x0210 - 0x01F0)
class UFearMarketPopupViewData final : public UGenericPopupViewData
{
public:
	class UMenuPerkViewData*                      ItemData;                                          // 0x01F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Cost;                                              // 0x01F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BloodpointConversion;                              // 0x01FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsPurchased;                                       // 0x0200(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AlreadyOwned;                                      // 0x0201(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_202[0x2];                                      // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AvailableTokens;                                   // 0x0204(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_208[0x8];                                      // 0x0208(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FearMarketPopupViewData">();
	}
	static class UFearMarketPopupViewData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFearMarketPopupViewData>();
	}
};
static_assert(alignof(UFearMarketPopupViewData) == 0x000010, "Wrong alignment on UFearMarketPopupViewData");
static_assert(sizeof(UFearMarketPopupViewData) == 0x000210, "Wrong size on UFearMarketPopupViewData");
static_assert(offsetof(UFearMarketPopupViewData, ItemData) == 0x0001F0, "Member 'UFearMarketPopupViewData::ItemData' has a wrong offset!");
static_assert(offsetof(UFearMarketPopupViewData, Cost) == 0x0001F8, "Member 'UFearMarketPopupViewData::Cost' has a wrong offset!");
static_assert(offsetof(UFearMarketPopupViewData, BloodpointConversion) == 0x0001FC, "Member 'UFearMarketPopupViewData::BloodpointConversion' has a wrong offset!");
static_assert(offsetof(UFearMarketPopupViewData, IsPurchased) == 0x000200, "Member 'UFearMarketPopupViewData::IsPurchased' has a wrong offset!");
static_assert(offsetof(UFearMarketPopupViewData, AlreadyOwned) == 0x000201, "Member 'UFearMarketPopupViewData::AlreadyOwned' has a wrong offset!");
static_assert(offsetof(UFearMarketPopupViewData, AvailableTokens) == 0x000204, "Member 'UFearMarketPopupViewData::AvailableTokens' has a wrong offset!");

// Class DBDUIViewInterfaces.FearMarketPopupViewInterface
// 0x0000 (0x0000 - 0x0000)
class IFearMarketPopupViewInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FearMarketPopupViewInterface">();
	}
	static class IFearMarketPopupViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFearMarketPopupViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IFearMarketPopupViewInterface) == 0x000001, "Wrong alignment on IFearMarketPopupViewInterface");
static_assert(sizeof(IFearMarketPopupViewInterface) == 0x000001, "Wrong size on IFearMarketPopupViewInterface");

// Class DBDUIViewInterfaces.GameManualViewInterface
// 0x0000 (0x0000 - 0x0000)
class IGameManualViewInterface final
{
public:
	void SetCategoryData(const struct FHelpCategoryData& categoryData, const TArray<struct FHelpTopicData>& topicsData);
	void SetCurrentManualMenuState(const EGameManualMenuState menuState);

	const EGameManualMenuState GetCurrentManualMenuState() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameManualViewInterface">();
	}
	static class IGameManualViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGameManualViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IGameManualViewInterface) == 0x000001, "Wrong alignment on IGameManualViewInterface");
static_assert(sizeof(IGameManualViewInterface) == 0x000001, "Wrong size on IGameManualViewInterface");

// Class DBDUIViewInterfaces.GenericPopupViewInterface
// 0x0000 (0x0000 - 0x0000)
class IGenericPopupViewInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GenericPopupViewInterface">();
	}
	static class IGenericPopupViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGenericPopupViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IGenericPopupViewInterface) == 0x000001, "Wrong alignment on IGenericPopupViewInterface");
static_assert(sizeof(IGenericPopupViewInterface) == 0x000001, "Wrong size on IGenericPopupViewInterface");

// Class DBDUIViewInterfaces.GenericTextInputPopupViewData
// 0x00E0 (0x02D0 - 0x01F0)
class UGenericTextInputPopupViewData final : public UGenericPopupViewData
{
public:
	uint8                                         Pad_1F0[0xE0];                                     // 0x01F0(0x00E0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GenericTextInputPopupViewData">();
	}
	static class UGenericTextInputPopupViewData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGenericTextInputPopupViewData>();
	}
};
static_assert(alignof(UGenericTextInputPopupViewData) == 0x000010, "Wrong alignment on UGenericTextInputPopupViewData");
static_assert(sizeof(UGenericTextInputPopupViewData) == 0x0002D0, "Wrong size on UGenericTextInputPopupViewData");

// Class DBDUIViewInterfaces.GenericTextInputPopupViewInterface
// 0x0000 (0x0000 - 0x0000)
class IGenericTextInputPopupViewInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GenericTextInputPopupViewInterface">();
	}
	static class IGenericTextInputPopupViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGenericTextInputPopupViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IGenericTextInputPopupViewInterface) == 0x000001, "Wrong alignment on IGenericTextInputPopupViewInterface");
static_assert(sizeof(IGenericTextInputPopupViewInterface) == 0x000001, "Wrong size on IGenericTextInputPopupViewInterface");

// Class DBDUIViewInterfaces.HookCountViewInterface
// 0x0000 (0x0000 - 0x0000)
class IHookCountViewInterface final
{
public:
	void ClearData();
	void InitWidget();
	void SetData(const int32 currentHookCount, const int32 maxHookCount, const int32 initialMaxHookCount);
	void SetHookCountVisibility(bool visible);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HookCountViewInterface">();
	}
	static class IHookCountViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IHookCountViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IHookCountViewInterface) == 0x000001, "Wrong alignment on IHookCountViewInterface");
static_assert(sizeof(IHookCountViewInterface) == 0x000001, "Wrong size on IHookCountViewInterface");

// Class DBDUIViewInterfaces.HudAlertViewInterface
// 0x0000 (0x0000 - 0x0000)
class IHudAlertViewInterface final
{
public:
	void FadeIn();
	void FadeOut(float delay);
	void SetScoreEventsVisibility(bool visible);
	void ShowScoreAlert(const struct FScoreAlertViewData& data);
	void ShowStatusEffectAlert(const struct FStatusEffectAlertViewData& data);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HudAlertViewInterface">();
	}
	static class IHudAlertViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IHudAlertViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IHudAlertViewInterface) == 0x000001, "Wrong alignment on IHudAlertViewInterface");
static_assert(sizeof(IHudAlertViewInterface) == 0x000001, "Wrong size on IHudAlertViewInterface");

// Class DBDUIViewInterfaces.HudDirectionalMiniGameViewInterface
// 0x0000 (0x0000 - 0x0000)
class IHudDirectionalMiniGameViewInterface final
{
public:
	void Hide();
	void Init(int32 maxItems);
	void Show(const TArray<EDirectionalInputKey>& directions);
	void UpdateFinalResult(EDirectionalMinigameResult finalResult);
	void UpdateResult(int32 index, bool isSuccessful);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HudDirectionalMiniGameViewInterface">();
	}
	static class IHudDirectionalMiniGameViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IHudDirectionalMiniGameViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IHudDirectionalMiniGameViewInterface) == 0x000001, "Wrong alignment on IHudDirectionalMiniGameViewInterface");
static_assert(sizeof(IHudDirectionalMiniGameViewInterface) == 0x000001, "Wrong size on IHudDirectionalMiniGameViewInterface");

// Class DBDUIViewInterfaces.HudObjectivesViewInterface
// 0x0000 (0x0000 - 0x0000)
class IHudObjectivesViewInterface final
{
public:
	void ClearData();
	void ClearHookCountData();
	void EnableEventProgression(bool isEnabled);
	void InitEventProgression(const struct FHudEventProgressionViewData& hudEventProgressionViewData);
	void InitWidget();
	void SetHookCountData(const int32 currentHookCount, const int32 maxHookCount, const int32 initialMaxHookCount);
	void SetHookCountVisibility(bool visible);
	void SetHudObjectiveData(const struct FHudObjectivesViewData& hudObjectiveViewData);
	void UpdateEventBankedProgress(const struct FHudEventProgressionViewData& hudEventProgressionViewData);
	void UpdateEventPendingProgress(const struct FHudEventProgressionViewData& hudEventProgressionViewData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HudObjectivesViewInterface">();
	}
	static class IHudObjectivesViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IHudObjectivesViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IHudObjectivesViewInterface) == 0x000001, "Wrong alignment on IHudObjectivesViewInterface");
static_assert(sizeof(IHudObjectivesViewInterface) == 0x000001, "Wrong size on IHudObjectivesViewInterface");

// Class DBDUIViewInterfaces.InteractionProgressViewInterface
// 0x0000 (0x0000 - 0x0000)
class IInteractionProgressViewInterface final
{
public:
	void HideInputProgressPrompt();
	void PlayHemorrhageAnimation();
	void SetInputProgressPrompt(const struct FInteractionProgressViewData& data);
	void UpdateInputProgress(const float progress, const float itemCharge);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InteractionProgressViewInterface">();
	}
	static class IInteractionProgressViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IInteractionProgressViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IInteractionProgressViewInterface) == 0x000001, "Wrong alignment on IInteractionProgressViewInterface");
static_assert(sizeof(IInteractionProgressViewInterface) == 0x000001, "Wrong size on IInteractionProgressViewInterface");

// Class DBDUIViewInterfaces.InteractionPromptsContainerViewInterface
// 0x0000 (0x0000 - 0x0000)
class IInteractionPromptsContainerViewInterface final
{
public:
	void AddPrompt(const struct FInteractionPromptViewData& data);
	void RemoveAllPrompts();
	void RemovePrompt(class FName id);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InteractionPromptsContainerViewInterface">();
	}
	static class IInteractionPromptsContainerViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IInteractionPromptsContainerViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IInteractionPromptsContainerViewInterface) == 0x000001, "Wrong alignment on IInteractionPromptsContainerViewInterface");
static_assert(sizeof(IInteractionPromptsContainerViewInterface) == 0x000001, "Wrong size on IInteractionPromptsContainerViewInterface");

// Class DBDUIViewInterfaces.ItemBundleViewInterface
// 0x0000 (0x0000 - 0x0000)
class IItemBundleViewInterface final
{
public:
	void ClearData();
	void SetData(const struct FItemBundleViewData& itemBundleViewData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemBundleViewInterface">();
	}
	static class IItemBundleViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IItemBundleViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IItemBundleViewInterface) == 0x000001, "Wrong alignment on IItemBundleViewInterface");
static_assert(sizeof(IItemBundleViewInterface) == 0x000001, "Wrong size on IItemBundleViewInterface");

// Class DBDUIViewInterfaces.ItemInteractionViewInterface
// 0x0000 (0x0000 - 0x0000)
class IItemInteractionViewInterface final
{
public:
	void ClearData();
	void SetData(const struct FItemBundleViewData& itemBundleData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemInteractionViewInterface">();
	}
	static class IItemInteractionViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IItemInteractionViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IItemInteractionViewInterface) == 0x000001, "Wrong alignment on IItemInteractionViewInterface");
static_assert(sizeof(IItemInteractionViewInterface) == 0x000001, "Wrong size on IItemInteractionViewInterface");

// Class DBDUIViewInterfaces.ItemViewInterface
// 0x0000 (0x0000 - 0x0000)
class IItemViewInterface final
{
public:
	void ClearData();
	void SetData(const struct FItemViewData& itemViewData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemViewInterface">();
	}
	static class IItemViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IItemViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IItemViewInterface) == 0x000001, "Wrong alignment on IItemViewInterface");
static_assert(sizeof(IItemViewInterface) == 0x000001, "Wrong size on IItemViewInterface");

// Class DBDUIViewInterfaces.LeaningArrowsViewInterface
// 0x0000 (0x0000 - 0x0000)
class ILeaningArrowsViewInterface final
{
public:
	void SetData(const ELeanState& leanState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LeaningArrowsViewInterface">();
	}
	static class ILeaningArrowsViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ILeaningArrowsViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(ILeaningArrowsViewInterface) == 0x000001, "Wrong alignment on ILeaningArrowsViewInterface");
static_assert(sizeof(ILeaningArrowsViewInterface) == 0x000001, "Wrong size on ILeaningArrowsViewInterface");

// Class DBDUIViewInterfaces.LightSensitivityViewInterface
// 0x0000 (0x0000 - 0x0000)
class ILightSensitivityViewInterface final
{
public:
	void StartFadeOut();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LightSensitivityViewInterface">();
	}
	static class ILightSensitivityViewInterface* GetDefaultObj()
	{
