#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDUIViewInterfaces

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "DBDUIViewInterfaces_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function DBDUIViewInterfaces.AddonViewInterface.SetData
// 0x0068 (0x0068 - 0x0000)
struct AddonViewInterface_SetData final
{
public:
	struct FAddonViewData                         baseLoadoutPartViewData;                           // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AddonViewInterface_SetData) == 0x000008, "Wrong alignment on AddonViewInterface_SetData");
static_assert(sizeof(AddonViewInterface_SetData) == 0x000068, "Wrong size on AddonViewInterface_SetData");
static_assert(offsetof(AddonViewInterface_SetData, baseLoadoutPartViewData) == 0x000000, "Member 'AddonViewInterface_SetData::baseLoadoutPartViewData' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveCompendiumViewInterface.SetPastTomesViewData
// 0x0010 (0x0010 - 0x0000)
struct ArchiveCompendiumViewInterface_SetPastTomesViewData final
{
public:
	TArray<struct FCompendiumButtonData>          pastStoryButtonData;                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveCompendiumViewInterface_SetPastTomesViewData) == 0x000008, "Wrong alignment on ArchiveCompendiumViewInterface_SetPastTomesViewData");
static_assert(sizeof(ArchiveCompendiumViewInterface_SetPastTomesViewData) == 0x000010, "Wrong size on ArchiveCompendiumViewInterface_SetPastTomesViewData");
static_assert(offsetof(ArchiveCompendiumViewInterface_SetPastTomesViewData, pastStoryButtonData) == 0x000000, "Member 'ArchiveCompendiumViewInterface_SetPastTomesViewData::pastStoryButtonData' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveEditorViewInterface.DisplayEditorSaving
// 0x0010 (0x0010 - 0x0000)
struct ArchiveEditorViewInterface_DisplayEditorSaving final
{
public:
	class FString                                 path;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveEditorViewInterface_DisplayEditorSaving) == 0x000008, "Wrong alignment on ArchiveEditorViewInterface_DisplayEditorSaving");
static_assert(sizeof(ArchiveEditorViewInterface_DisplayEditorSaving) == 0x000010, "Wrong size on ArchiveEditorViewInterface_DisplayEditorSaving");
static_assert(offsetof(ArchiveEditorViewInterface_DisplayEditorSaving, path) == 0x000000, "Member 'ArchiveEditorViewInterface_DisplayEditorSaving::path' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveImageViewerViewInterface.SetTextVisibility
// 0x0001 (0x0001 - 0x0000)
struct ArchiveImageViewerViewInterface_SetTextVisibility final
{
public:
	bool                                          visible;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveImageViewerViewInterface_SetTextVisibility) == 0x000001, "Wrong alignment on ArchiveImageViewerViewInterface_SetTextVisibility");
static_assert(sizeof(ArchiveImageViewerViewInterface_SetTextVisibility) == 0x000001, "Wrong size on ArchiveImageViewerViewInterface_SetTextVisibility");
static_assert(offsetof(ArchiveImageViewerViewInterface_SetTextVisibility, visible) == 0x000000, "Member 'ArchiveImageViewerViewInterface_SetTextVisibility::visible' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveImageViewerViewInterface.SetVoiceOverAutoplay
// 0x0001 (0x0001 - 0x0000)
struct ArchiveImageViewerViewInterface_SetVoiceOverAutoplay final
{
public:
	bool                                          voiceOverAutoplay;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveImageViewerViewInterface_SetVoiceOverAutoplay) == 0x000001, "Wrong alignment on ArchiveImageViewerViewInterface_SetVoiceOverAutoplay");
static_assert(sizeof(ArchiveImageViewerViewInterface_SetVoiceOverAutoplay) == 0x000001, "Wrong size on ArchiveImageViewerViewInterface_SetVoiceOverAutoplay");
static_assert(offsetof(ArchiveImageViewerViewInterface_SetVoiceOverAutoplay, voiceOverAutoplay) == 0x000000, "Member 'ArchiveImageViewerViewInterface_SetVoiceOverAutoplay::voiceOverAutoplay' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveImageViewerViewInterface.SetVoiceOverPlaying
// 0x0001 (0x0001 - 0x0000)
struct ArchiveImageViewerViewInterface_SetVoiceOverPlaying final
{
public:
	bool                                          voiceOverPlaying;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveImageViewerViewInterface_SetVoiceOverPlaying) == 0x000001, "Wrong alignment on ArchiveImageViewerViewInterface_SetVoiceOverPlaying");
static_assert(sizeof(ArchiveImageViewerViewInterface_SetVoiceOverPlaying) == 0x000001, "Wrong size on ArchiveImageViewerViewInterface_SetVoiceOverPlaying");
static_assert(offsetof(ArchiveImageViewerViewInterface_SetVoiceOverPlaying, voiceOverPlaying) == 0x000000, "Member 'ArchiveImageViewerViewInterface_SetVoiceOverPlaying::voiceOverPlaying' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveImageViewerViewInterface.UpdateContent
// 0x0070 (0x0070 - 0x0000)
struct ArchiveImageViewerViewInterface_UpdateContent final
{
public:
	struct FArchivesVignetteEntryViewData         data;                                              // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveImageViewerViewInterface_UpdateContent) == 0x000008, "Wrong alignment on ArchiveImageViewerViewInterface_UpdateContent");
static_assert(sizeof(ArchiveImageViewerViewInterface_UpdateContent) == 0x000070, "Wrong size on ArchiveImageViewerViewInterface_UpdateContent");
static_assert(offsetof(ArchiveImageViewerViewInterface_UpdateContent, data) == 0x000000, "Member 'ArchiveImageViewerViewInterface_UpdateContent::data' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveJournalViewInterface.OnImageViewerVoiceOverAutoplay
// 0x0001 (0x0001 - 0x0000)
struct ArchiveJournalViewInterface_OnImageViewerVoiceOverAutoplay final
{
public:
	bool                                          autoplay;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveJournalViewInterface_OnImageViewerVoiceOverAutoplay) == 0x000001, "Wrong alignment on ArchiveJournalViewInterface_OnImageViewerVoiceOverAutoplay");
static_assert(sizeof(ArchiveJournalViewInterface_OnImageViewerVoiceOverAutoplay) == 0x000001, "Wrong size on ArchiveJournalViewInterface_OnImageViewerVoiceOverAutoplay");
static_assert(offsetof(ArchiveJournalViewInterface_OnImageViewerVoiceOverAutoplay, autoplay) == 0x000000, "Member 'ArchiveJournalViewInterface_OnImageViewerVoiceOverAutoplay::autoplay' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveJournalViewInterface.SetCinematicButtonsEnabled
// 0x0001 (0x0001 - 0x0000)
struct ArchiveJournalViewInterface_SetCinematicButtonsEnabled final
{
public:
	bool                                          enabled;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveJournalViewInterface_SetCinematicButtonsEnabled) == 0x000001, "Wrong alignment on ArchiveJournalViewInterface_SetCinematicButtonsEnabled");
static_assert(sizeof(ArchiveJournalViewInterface_SetCinematicButtonsEnabled) == 0x000001, "Wrong size on ArchiveJournalViewInterface_SetCinematicButtonsEnabled");
static_assert(offsetof(ArchiveJournalViewInterface_SetCinematicButtonsEnabled, enabled) == 0x000000, "Member 'ArchiveJournalViewInterface_SetCinematicButtonsEnabled::enabled' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveJournalViewInterface.SetEntryData
// 0x0070 (0x0070 - 0x0000)
struct ArchiveJournalViewInterface_SetEntryData final
{
public:
	struct FArchivesVignetteEntryViewData         entryViewData;                                     // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveJournalViewInterface_SetEntryData) == 0x000008, "Wrong alignment on ArchiveJournalViewInterface_SetEntryData");
static_assert(sizeof(ArchiveJournalViewInterface_SetEntryData) == 0x000070, "Wrong size on ArchiveJournalViewInterface_SetEntryData");
static_assert(offsetof(ArchiveJournalViewInterface_SetEntryData, entryViewData) == 0x000000, "Member 'ArchiveJournalViewInterface_SetEntryData::entryViewData' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveJournalViewInterface.SetVignetteData
// 0x0060 (0x0060 - 0x0000)
struct ArchiveJournalViewInterface_SetVignetteData final
{
public:
	struct FArchivesVignetteViewData              vignetteViewData;                                  // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveJournalViewInterface_SetVignetteData) == 0x000008, "Wrong alignment on ArchiveJournalViewInterface_SetVignetteData");
static_assert(sizeof(ArchiveJournalViewInterface_SetVignetteData) == 0x000060, "Wrong size on ArchiveJournalViewInterface_SetVignetteData");
static_assert(offsetof(ArchiveJournalViewInterface_SetVignetteData, vignetteViewData) == 0x000000, "Member 'ArchiveJournalViewInterface_SetVignetteData::vignetteViewData' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveJournalViewInterface.SetVignetteInputsEnabled
// 0x0001 (0x0001 - 0x0000)
struct ArchiveJournalViewInterface_SetVignetteInputsEnabled final
{
public:
	bool                                          enabled;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveJournalViewInterface_SetVignetteInputsEnabled) == 0x000001, "Wrong alignment on ArchiveJournalViewInterface_SetVignetteInputsEnabled");
static_assert(sizeof(ArchiveJournalViewInterface_SetVignetteInputsEnabled) == 0x000001, "Wrong size on ArchiveJournalViewInterface_SetVignetteInputsEnabled");
static_assert(offsetof(ArchiveJournalViewInterface_SetVignetteInputsEnabled, enabled) == 0x000000, "Member 'ArchiveJournalViewInterface_SetVignetteInputsEnabled::enabled' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveJournalViewInterface.SetVignetteList
// 0x0010 (0x0010 - 0x0000)
struct ArchiveJournalViewInterface_SetVignetteList final
{
public:
	TArray<struct FArchivesVignetteViewData>      vignetteDataList;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveJournalViewInterface_SetVignetteList) == 0x000008, "Wrong alignment on ArchiveJournalViewInterface_SetVignetteList");
static_assert(sizeof(ArchiveJournalViewInterface_SetVignetteList) == 0x000010, "Wrong size on ArchiveJournalViewInterface_SetVignetteList");
static_assert(offsetof(ArchiveJournalViewInterface_SetVignetteList, vignetteDataList) == 0x000000, "Member 'ArchiveJournalViewInterface_SetVignetteList::vignetteDataList' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveJournalViewInterface.SetVoiceOverAutoplay
// 0x0001 (0x0001 - 0x0000)
struct ArchiveJournalViewInterface_SetVoiceOverAutoplay final
{
public:
	bool                                          voiceOverAutoplay;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveJournalViewInterface_SetVoiceOverAutoplay) == 0x000001, "Wrong alignment on ArchiveJournalViewInterface_SetVoiceOverAutoplay");
static_assert(sizeof(ArchiveJournalViewInterface_SetVoiceOverAutoplay) == 0x000001, "Wrong size on ArchiveJournalViewInterface_SetVoiceOverAutoplay");
static_assert(offsetof(ArchiveJournalViewInterface_SetVoiceOverAutoplay, voiceOverAutoplay) == 0x000000, "Member 'ArchiveJournalViewInterface_SetVoiceOverAutoplay::voiceOverAutoplay' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveJournalViewInterface.SetVoiceOverPlaying
// 0x0001 (0x0001 - 0x0000)
struct ArchiveJournalViewInterface_SetVoiceOverPlaying final
{
public:
	bool                                          voiceOverPlaying;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveJournalViewInterface_SetVoiceOverPlaying) == 0x000001, "Wrong alignment on ArchiveJournalViewInterface_SetVoiceOverPlaying");
static_assert(sizeof(ArchiveJournalViewInterface_SetVoiceOverPlaying) == 0x000001, "Wrong size on ArchiveJournalViewInterface_SetVoiceOverPlaying");
static_assert(offsetof(ArchiveJournalViewInterface_SetVoiceOverPlaying, voiceOverPlaying) == 0x000000, "Member 'ArchiveJournalViewInterface_SetVoiceOverPlaying::voiceOverPlaying' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveLevelProgressionViewInterface.GoToNextLevel
// 0x0004 (0x0004 - 0x0000)
struct ArchiveLevelProgressionViewInterface_GoToNextLevel final
{
public:
	int32                                         levelIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveLevelProgressionViewInterface_GoToNextLevel) == 0x000004, "Wrong alignment on ArchiveLevelProgressionViewInterface_GoToNextLevel");
static_assert(sizeof(ArchiveLevelProgressionViewInterface_GoToNextLevel) == 0x000004, "Wrong size on ArchiveLevelProgressionViewInterface_GoToNextLevel");
static_assert(offsetof(ArchiveLevelProgressionViewInterface_GoToNextLevel, levelIndex) == 0x000000, "Member 'ArchiveLevelProgressionViewInterface_GoToNextLevel::levelIndex' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveLevelProgressionViewInterface.SetActiveLevel
// 0x0008 (0x0008 - 0x0000)
struct ArchiveLevelProgressionViewInterface_SetActiveLevel final
{
public:
	int32                                         levelIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          performAction;                                     // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArchiveLevelProgressionViewInterface_SetActiveLevel) == 0x000004, "Wrong alignment on ArchiveLevelProgressionViewInterface_SetActiveLevel");
static_assert(sizeof(ArchiveLevelProgressionViewInterface_SetActiveLevel) == 0x000008, "Wrong size on ArchiveLevelProgressionViewInterface_SetActiveLevel");
static_assert(offsetof(ArchiveLevelProgressionViewInterface_SetActiveLevel, levelIndex) == 0x000000, "Member 'ArchiveLevelProgressionViewInterface_SetActiveLevel::levelIndex' has a wrong offset!");
static_assert(offsetof(ArchiveLevelProgressionViewInterface_SetActiveLevel, performAction) == 0x000004, "Member 'ArchiveLevelProgressionViewInterface_SetActiveLevel::performAction' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveLevelProgressionViewInterface.SetLevelSelectorEnabled
// 0x0001 (0x0001 - 0x0000)
struct ArchiveLevelProgressionViewInterface_SetLevelSelectorEnabled final
{
public:
	bool                                          enabled;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveLevelProgressionViewInterface_SetLevelSelectorEnabled) == 0x000001, "Wrong alignment on ArchiveLevelProgressionViewInterface_SetLevelSelectorEnabled");
static_assert(sizeof(ArchiveLevelProgressionViewInterface_SetLevelSelectorEnabled) == 0x000001, "Wrong size on ArchiveLevelProgressionViewInterface_SetLevelSelectorEnabled");
static_assert(offsetof(ArchiveLevelProgressionViewInterface_SetLevelSelectorEnabled, enabled) == 0x000000, "Member 'ArchiveLevelProgressionViewInterface_SetLevelSelectorEnabled::enabled' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveLevelProgressionViewInterface.SetLevelSelectorVisibility
// 0x0001 (0x0001 - 0x0000)
struct ArchiveLevelProgressionViewInterface_SetLevelSelectorVisibility final
{
public:
	bool                                          isVisible;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveLevelProgressionViewInterface_SetLevelSelectorVisibility) == 0x000001, "Wrong alignment on ArchiveLevelProgressionViewInterface_SetLevelSelectorVisibility");
static_assert(sizeof(ArchiveLevelProgressionViewInterface_SetLevelSelectorVisibility) == 0x000001, "Wrong size on ArchiveLevelProgressionViewInterface_SetLevelSelectorVisibility");
static_assert(offsetof(ArchiveLevelProgressionViewInterface_SetLevelSelectorVisibility, isVisible) == 0x000000, "Member 'ArchiveLevelProgressionViewInterface_SetLevelSelectorVisibility::isVisible' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveLevelProgressionViewInterface.SetRewardsContainerVisibility
// 0x0001 (0x0001 - 0x0000)
struct ArchiveLevelProgressionViewInterface_SetRewardsContainerVisibility final
{
public:
	bool                                          isVisible;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveLevelProgressionViewInterface_SetRewardsContainerVisibility) == 0x000001, "Wrong alignment on ArchiveLevelProgressionViewInterface_SetRewardsContainerVisibility");
static_assert(sizeof(ArchiveLevelProgressionViewInterface_SetRewardsContainerVisibility) == 0x000001, "Wrong size on ArchiveLevelProgressionViewInterface_SetRewardsContainerVisibility");
static_assert(offsetof(ArchiveLevelProgressionViewInterface_SetRewardsContainerVisibility, isVisible) == 0x000000, "Member 'ArchiveLevelProgressionViewInterface_SetRewardsContainerVisibility::isVisible' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveLevelProgressionViewInterface.SetTomeLevelsData
// 0x0018 (0x0018 - 0x0000)
struct ArchiveLevelProgressionViewInterface_SetTomeLevelsData final
{
public:
	TArray<class UArchiveStoryLevelViewData*>     levelsData;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         selectedLevel;                                     // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArchiveLevelProgressionViewInterface_SetTomeLevelsData) == 0x000008, "Wrong alignment on ArchiveLevelProgressionViewInterface_SetTomeLevelsData");
static_assert(sizeof(ArchiveLevelProgressionViewInterface_SetTomeLevelsData) == 0x000018, "Wrong size on ArchiveLevelProgressionViewInterface_SetTomeLevelsData");
static_assert(offsetof(ArchiveLevelProgressionViewInterface_SetTomeLevelsData, levelsData) == 0x000000, "Member 'ArchiveLevelProgressionViewInterface_SetTomeLevelsData::levelsData' has a wrong offset!");
static_assert(offsetof(ArchiveLevelProgressionViewInterface_SetTomeLevelsData, selectedLevel) == 0x000010, "Member 'ArchiveLevelProgressionViewInterface_SetTomeLevelsData::selectedLevel' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveLevelProgressionViewInterface.SetTomeRewardsData
// 0x0018 (0x0018 - 0x0000)
struct ArchiveLevelProgressionViewInterface_SetTomeRewardsData final
{
public:
	TArray<struct FRewardWrapperViewData>         rewardsData;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          areLocked;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArchiveLevelProgressionViewInterface_SetTomeRewardsData) == 0x000008, "Wrong alignment on ArchiveLevelProgressionViewInterface_SetTomeRewardsData");
static_assert(sizeof(ArchiveLevelProgressionViewInterface_SetTomeRewardsData) == 0x000018, "Wrong size on ArchiveLevelProgressionViewInterface_SetTomeRewardsData");
static_assert(offsetof(ArchiveLevelProgressionViewInterface_SetTomeRewardsData, rewardsData) == 0x000000, "Member 'ArchiveLevelProgressionViewInterface_SetTomeRewardsData::rewardsData' has a wrong offset!");
static_assert(offsetof(ArchiveLevelProgressionViewInterface_SetTomeRewardsData, areLocked) == 0x000010, "Member 'ArchiveLevelProgressionViewInterface_SetTomeRewardsData::areLocked' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveLevelProgressionViewInterface.UpdateLevelStatus
// 0x0008 (0x0008 - 0x0000)
struct ArchiveLevelProgressionViewInterface_UpdateLevelStatus final
{
public:
	int32                                         level;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EArchivesStoryLevelStatus                     status;                                            // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArchiveLevelProgressionViewInterface_UpdateLevelStatus) == 0x000004, "Wrong alignment on ArchiveLevelProgressionViewInterface_UpdateLevelStatus");
static_assert(sizeof(ArchiveLevelProgressionViewInterface_UpdateLevelStatus) == 0x000008, "Wrong size on ArchiveLevelProgressionViewInterface_UpdateLevelStatus");
static_assert(offsetof(ArchiveLevelProgressionViewInterface_UpdateLevelStatus, level) == 0x000000, "Member 'ArchiveLevelProgressionViewInterface_UpdateLevelStatus::level' has a wrong offset!");
static_assert(offsetof(ArchiveLevelProgressionViewInterface_UpdateLevelStatus, status) == 0x000004, "Member 'ArchiveLevelProgressionViewInterface_UpdateLevelStatus::status' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.ClearChallengeReminderData
// 0x0001 (0x0001 - 0x0000)
struct ArchiveMenuViewInterface_ClearChallengeReminderData final
{
public:
	EPlayerRole                                   role;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_ClearChallengeReminderData) == 0x000001, "Wrong alignment on ArchiveMenuViewInterface_ClearChallengeReminderData");
static_assert(sizeof(ArchiveMenuViewInterface_ClearChallengeReminderData) == 0x000001, "Wrong size on ArchiveMenuViewInterface_ClearChallengeReminderData");
static_assert(offsetof(ArchiveMenuViewInterface_ClearChallengeReminderData, role) == 0x000000, "Member 'ArchiveMenuViewInterface_ClearChallengeReminderData::role' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetChallengeReminderData
// 0x00E0 (0x00E0 - 0x0000)
struct ArchiveMenuViewInterface_SetChallengeReminderData final
{
public:
	struct FArchiveChallengeReminderViewData      data;                                              // 0x0000(0x00D0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EPlayerRole                                   role;                                              // 0x00D0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          needsAnimation;                                    // 0x00D1(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              animationOriginalPosition;                         // 0x00D4(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArchiveMenuViewInterface_SetChallengeReminderData) == 0x000008, "Wrong alignment on ArchiveMenuViewInterface_SetChallengeReminderData");
static_assert(sizeof(ArchiveMenuViewInterface_SetChallengeReminderData) == 0x0000E0, "Wrong size on ArchiveMenuViewInterface_SetChallengeReminderData");
static_assert(offsetof(ArchiveMenuViewInterface_SetChallengeReminderData, data) == 0x000000, "Member 'ArchiveMenuViewInterface_SetChallengeReminderData::data' has a wrong offset!");
static_assert(offsetof(ArchiveMenuViewInterface_SetChallengeReminderData, role) == 0x0000D0, "Member 'ArchiveMenuViewInterface_SetChallengeReminderData::role' has a wrong offset!");
static_assert(offsetof(ArchiveMenuViewInterface_SetChallengeReminderData, needsAnimation) == 0x0000D1, "Member 'ArchiveMenuViewInterface_SetChallengeReminderData::needsAnimation' has a wrong offset!");
static_assert(offsetof(ArchiveMenuViewInterface_SetChallengeReminderData, animationOriginalPosition) == 0x0000D4, "Member 'ArchiveMenuViewInterface_SetChallengeReminderData::animationOriginalPosition' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetChallengeReminderVisibility
// 0x0001 (0x0001 - 0x0000)
struct ArchiveMenuViewInterface_SetChallengeReminderVisibility final
{
public:
	bool                                          isVisible;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetChallengeReminderVisibility) == 0x000001, "Wrong alignment on ArchiveMenuViewInterface_SetChallengeReminderVisibility");
static_assert(sizeof(ArchiveMenuViewInterface_SetChallengeReminderVisibility) == 0x000001, "Wrong size on ArchiveMenuViewInterface_SetChallengeReminderVisibility");
static_assert(offsetof(ArchiveMenuViewInterface_SetChallengeReminderVisibility, isVisible) == 0x000000, "Member 'ArchiveMenuViewInterface_SetChallengeReminderVisibility::isVisible' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetControllerElementsEnabled
// 0x0001 (0x0001 - 0x0000)
struct ArchiveMenuViewInterface_SetControllerElementsEnabled final
{
public:
	bool                                          enabled;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetControllerElementsEnabled) == 0x000001, "Wrong alignment on ArchiveMenuViewInterface_SetControllerElementsEnabled");
static_assert(sizeof(ArchiveMenuViewInterface_SetControllerElementsEnabled) == 0x000001, "Wrong size on ArchiveMenuViewInterface_SetControllerElementsEnabled");
static_assert(offsetof(ArchiveMenuViewInterface_SetControllerElementsEnabled, enabled) == 0x000000, "Member 'ArchiveMenuViewInterface_SetControllerElementsEnabled::enabled' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetEventLabel
// 0x0010 (0x0010 - 0x0000)
struct ArchiveMenuViewInterface_SetEventLabel final
{
public:
	class FString                                 eventLabel;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetEventLabel) == 0x000008, "Wrong alignment on ArchiveMenuViewInterface_SetEventLabel");
static_assert(sizeof(ArchiveMenuViewInterface_SetEventLabel) == 0x000010, "Wrong size on ArchiveMenuViewInterface_SetEventLabel");
static_assert(offsetof(ArchiveMenuViewInterface_SetEventLabel, eventLabel) == 0x000000, "Member 'ArchiveMenuViewInterface_SetEventLabel::eventLabel' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetInfoButtonEnabled
// 0x0001 (0x0001 - 0x0000)
struct ArchiveMenuViewInterface_SetInfoButtonEnabled final
{
public:
	bool                                          isEnabled;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetInfoButtonEnabled) == 0x000001, "Wrong alignment on ArchiveMenuViewInterface_SetInfoButtonEnabled");
static_assert(sizeof(ArchiveMenuViewInterface_SetInfoButtonEnabled) == 0x000001, "Wrong size on ArchiveMenuViewInterface_SetInfoButtonEnabled");
static_assert(offsetof(ArchiveMenuViewInterface_SetInfoButtonEnabled, isEnabled) == 0x000000, "Member 'ArchiveMenuViewInterface_SetInfoButtonEnabled::isEnabled' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetInfoButtonVisible
// 0x0001 (0x0001 - 0x0000)
struct ArchiveMenuViewInterface_SetInfoButtonVisible final
{
public:
	bool                                          isVisible;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetInfoButtonVisible) == 0x000001, "Wrong alignment on ArchiveMenuViewInterface_SetInfoButtonVisible");
static_assert(sizeof(ArchiveMenuViewInterface_SetInfoButtonVisible) == 0x000001, "Wrong size on ArchiveMenuViewInterface_SetInfoButtonVisible");
static_assert(offsetof(ArchiveMenuViewInterface_SetInfoButtonVisible, isVisible) == 0x000000, "Member 'ArchiveMenuViewInterface_SetInfoButtonVisible::isVisible' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetMenuState
// 0x0001 (0x0001 - 0x0000)
struct ArchiveMenuViewInterface_SetMenuState final
{
public:
	EArchiveMenuState                             menuState;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetMenuState) == 0x000001, "Wrong alignment on ArchiveMenuViewInterface_SetMenuState");
static_assert(sizeof(ArchiveMenuViewInterface_SetMenuState) == 0x000001, "Wrong size on ArchiveMenuViewInterface_SetMenuState");
static_assert(offsetof(ArchiveMenuViewInterface_SetMenuState, menuState) == 0x000000, "Member 'ArchiveMenuViewInterface_SetMenuState::menuState' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetQuestNodeHoverEffect
// 0x0002 (0x0002 - 0x0000)
struct ArchiveMenuViewInterface_SetQuestNodeHoverEffect final
{
public:
	EPlayerRole                                   role;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isHovered;                                         // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetQuestNodeHoverEffect) == 0x000001, "Wrong alignment on ArchiveMenuViewInterface_SetQuestNodeHoverEffect");
static_assert(sizeof(ArchiveMenuViewInterface_SetQuestNodeHoverEffect) == 0x000002, "Wrong size on ArchiveMenuViewInterface_SetQuestNodeHoverEffect");
static_assert(offsetof(ArchiveMenuViewInterface_SetQuestNodeHoverEffect, role) == 0x000000, "Member 'ArchiveMenuViewInterface_SetQuestNodeHoverEffect::role' has a wrong offset!");
static_assert(offsetof(ArchiveMenuViewInterface_SetQuestNodeHoverEffect, isHovered) == 0x000001, "Member 'ArchiveMenuViewInterface_SetQuestNodeHoverEffect::isHovered' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetRemainingTime
// 0x0018 (0x0018 - 0x0000)
struct ArchiveMenuViewInterface_SetRemainingTime final
{
public:
	class FString                                 remainingTime;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isMoreThanWarningThreshold;                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EArchiveMenuState                             menuState;                                         // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArchiveMenuViewInterface_SetRemainingTime) == 0x000008, "Wrong alignment on ArchiveMenuViewInterface_SetRemainingTime");
static_assert(sizeof(ArchiveMenuViewInterface_SetRemainingTime) == 0x000018, "Wrong size on ArchiveMenuViewInterface_SetRemainingTime");
static_assert(offsetof(ArchiveMenuViewInterface_SetRemainingTime, remainingTime) == 0x000000, "Member 'ArchiveMenuViewInterface_SetRemainingTime::remainingTime' has a wrong offset!");
static_assert(offsetof(ArchiveMenuViewInterface_SetRemainingTime, isMoreThanWarningThreshold) == 0x000010, "Member 'ArchiveMenuViewInterface_SetRemainingTime::isMoreThanWarningThreshold' has a wrong offset!");
static_assert(offsetof(ArchiveMenuViewInterface_SetRemainingTime, menuState) == 0x000011, "Member 'ArchiveMenuViewInterface_SetRemainingTime::menuState' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetRemainingTimeVisible
// 0x0001 (0x0001 - 0x0000)
struct ArchiveMenuViewInterface_SetRemainingTimeVisible final
{
public:
	bool                                          isVisible;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetRemainingTimeVisible) == 0x000001, "Wrong alignment on ArchiveMenuViewInterface_SetRemainingTimeVisible");
static_assert(sizeof(ArchiveMenuViewInterface_SetRemainingTimeVisible) == 0x000001, "Wrong size on ArchiveMenuViewInterface_SetRemainingTimeVisible");
static_assert(offsetof(ArchiveMenuViewInterface_SetRemainingTimeVisible, isVisible) == 0x000000, "Member 'ArchiveMenuViewInterface_SetRemainingTimeVisible::isVisible' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetReminderSlotsEnabled
// 0x0001 (0x0001 - 0x0000)
struct ArchiveMenuViewInterface_SetReminderSlotsEnabled final
{
public:
	bool                                          enabled;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetReminderSlotsEnabled) == 0x000001, "Wrong alignment on ArchiveMenuViewInterface_SetReminderSlotsEnabled");
static_assert(sizeof(ArchiveMenuViewInterface_SetReminderSlotsEnabled) == 0x000001, "Wrong size on ArchiveMenuViewInterface_SetReminderSlotsEnabled");
static_assert(offsetof(ArchiveMenuViewInterface_SetReminderSlotsEnabled, enabled) == 0x000000, "Member 'ArchiveMenuViewInterface_SetReminderSlotsEnabled::enabled' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetSubtitle
// 0x0018 (0x0018 - 0x0000)
struct ArchiveMenuViewInterface_SetSubtitle final
{
public:
	class FText                                   subtitle;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetSubtitle) == 0x000008, "Wrong alignment on ArchiveMenuViewInterface_SetSubtitle");
static_assert(sizeof(ArchiveMenuViewInterface_SetSubtitle) == 0x000018, "Wrong size on ArchiveMenuViewInterface_SetSubtitle");
static_assert(offsetof(ArchiveMenuViewInterface_SetSubtitle, subtitle) == 0x000000, "Member 'ArchiveMenuViewInterface_SetSubtitle::subtitle' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetSubtitleVisible
// 0x0001 (0x0001 - 0x0000)
struct ArchiveMenuViewInterface_SetSubtitleVisible final
{
public:
	bool                                          isVisible;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetSubtitleVisible) == 0x000001, "Wrong alignment on ArchiveMenuViewInterface_SetSubtitleVisible");
static_assert(sizeof(ArchiveMenuViewInterface_SetSubtitleVisible) == 0x000001, "Wrong size on ArchiveMenuViewInterface_SetSubtitleVisible");
static_assert(offsetof(ArchiveMenuViewInterface_SetSubtitleVisible, isVisible) == 0x000000, "Member 'ArchiveMenuViewInterface_SetSubtitleVisible::isVisible' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetTabEnabled
// 0x0008 (0x0008 - 0x0000)
struct ArchiveMenuViewInterface_SetTabEnabled final
{
public:
	int32                                         key;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          enabled;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArchiveMenuViewInterface_SetTabEnabled) == 0x000004, "Wrong alignment on ArchiveMenuViewInterface_SetTabEnabled");
static_assert(sizeof(ArchiveMenuViewInterface_SetTabEnabled) == 0x000008, "Wrong size on ArchiveMenuViewInterface_SetTabEnabled");
static_assert(offsetof(ArchiveMenuViewInterface_SetTabEnabled, key) == 0x000000, "Member 'ArchiveMenuViewInterface_SetTabEnabled::key' has a wrong offset!");
static_assert(offsetof(ArchiveMenuViewInterface_SetTabEnabled, enabled) == 0x000004, "Member 'ArchiveMenuViewInterface_SetTabEnabled::enabled' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetTabsData
// 0x0018 (0x0018 - 0x0000)
struct ArchiveMenuViewInterface_SetTabsData final
{
public:
	TArray<struct FTabWidgetData>                 tabsData;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         selectedKey;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArchiveMenuViewInterface_SetTabsData) == 0x000008, "Wrong alignment on ArchiveMenuViewInterface_SetTabsData");
static_assert(sizeof(ArchiveMenuViewInterface_SetTabsData) == 0x000018, "Wrong size on ArchiveMenuViewInterface_SetTabsData");
static_assert(offsetof(ArchiveMenuViewInterface_SetTabsData, tabsData) == 0x000000, "Member 'ArchiveMenuViewInterface_SetTabsData::tabsData' has a wrong offset!");
static_assert(offsetof(ArchiveMenuViewInterface_SetTabsData, selectedKey) == 0x000010, "Member 'ArchiveMenuViewInterface_SetTabsData::selectedKey' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetTabSelected
// 0x0004 (0x0004 - 0x0000)
struct ArchiveMenuViewInterface_SetTabSelected final
{
public:
	int32                                         key;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetTabSelected) == 0x000004, "Wrong alignment on ArchiveMenuViewInterface_SetTabSelected");
static_assert(sizeof(ArchiveMenuViewInterface_SetTabSelected) == 0x000004, "Wrong size on ArchiveMenuViewInterface_SetTabSelected");
static_assert(offsetof(ArchiveMenuViewInterface_SetTabSelected, key) == 0x000000, "Member 'ArchiveMenuViewInterface_SetTabSelected::key' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetTabsInputsEnabled
// 0x0001 (0x0001 - 0x0000)
struct ArchiveMenuViewInterface_SetTabsInputsEnabled final
{
public:
	bool                                          enabled;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetTabsInputsEnabled) == 0x000001, "Wrong alignment on ArchiveMenuViewInterface_SetTabsInputsEnabled");
static_assert(sizeof(ArchiveMenuViewInterface_SetTabsInputsEnabled) == 0x000001, "Wrong size on ArchiveMenuViewInterface_SetTabsInputsEnabled");
static_assert(offsetof(ArchiveMenuViewInterface_SetTabsInputsEnabled, enabled) == 0x000000, "Member 'ArchiveMenuViewInterface_SetTabsInputsEnabled::enabled' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetTitle
// 0x0018 (0x0018 - 0x0000)
struct ArchiveMenuViewInterface_SetTitle final
{
public:
	class FText                                   title;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetTitle) == 0x000008, "Wrong alignment on ArchiveMenuViewInterface_SetTitle");
static_assert(sizeof(ArchiveMenuViewInterface_SetTitle) == 0x000018, "Wrong size on ArchiveMenuViewInterface_SetTitle");
static_assert(offsetof(ArchiveMenuViewInterface_SetTitle, title) == 0x000000, "Member 'ArchiveMenuViewInterface_SetTitle::title' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.ShowSlotSelector
// 0x00B8 (0x00B8 - 0x0000)
struct ArchiveMenuViewInterface_ShowSlotSelector final
{
public:
	struct FArchiveNodeViewData                   data;                                              // 0x0000(0x00B8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_ShowSlotSelector) == 0x000008, "Wrong alignment on ArchiveMenuViewInterface_ShowSlotSelector");
static_assert(sizeof(ArchiveMenuViewInterface_ShowSlotSelector) == 0x0000B8, "Wrong size on ArchiveMenuViewInterface_ShowSlotSelector");
static_assert(offsetof(ArchiveMenuViewInterface_ShowSlotSelector, data) == 0x000000, "Member 'ArchiveMenuViewInterface_ShowSlotSelector::data' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.UpdateBackgroundSkin
// 0x0040 (0x0040 - 0x0000)
struct ArchiveMenuViewInterface_UpdateBackgroundSkin final
{
public:
	int32                                         key;                                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FArchiveTomeSkinData                   data;                                              // 0x0008(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_UpdateBackgroundSkin) == 0x000008, "Wrong alignment on ArchiveMenuViewInterface_UpdateBackgroundSkin");
static_assert(sizeof(ArchiveMenuViewInterface_UpdateBackgroundSkin) == 0x000040, "Wrong size on ArchiveMenuViewInterface_UpdateBackgroundSkin");
static_assert(offsetof(ArchiveMenuViewInterface_UpdateBackgroundSkin, key) == 0x000000, "Member 'ArchiveMenuViewInterface_UpdateBackgroundSkin::key' has a wrong offset!");
static_assert(offsetof(ArchiveMenuViewInterface_UpdateBackgroundSkin, data) == 0x000008, "Member 'ArchiveMenuViewInterface_UpdateBackgroundSkin::data' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.GetArchiveCompendiumInterface
// 0x0010 (0x0010 - 0x0000)
struct ArchiveMenuViewInterface_GetArchiveCompendiumInterface final
{
public:
	TScriptInterface<class IArchiveCompendiumViewInterface> ReturnValue;                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_GetArchiveCompendiumInterface) == 0x000008, "Wrong alignment on ArchiveMenuViewInterface_GetArchiveCompendiumInterface");
static_assert(sizeof(ArchiveMenuViewInterface_GetArchiveCompendiumInterface) == 0x000010, "Wrong size on ArchiveMenuViewInterface_GetArchiveCompendiumInterface");
static_assert(offsetof(ArchiveMenuViewInterface_GetArchiveCompendiumInterface, ReturnValue) == 0x000000, "Member 'ArchiveMenuViewInterface_GetArchiveCompendiumInterface::ReturnValue' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.GetArchiveRiftInterface
// 0x0010 (0x0010 - 0x0000)
struct ArchiveMenuViewInterface_GetArchiveRiftInterface final
{
public:
	TScriptInterface<class IArchiveRiftViewInterface> ReturnValue;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_GetArchiveRiftInterface) == 0x000008, "Wrong alignment on ArchiveMenuViewInterface_GetArchiveRiftInterface");
static_assert(sizeof(ArchiveMenuViewInterface_GetArchiveRiftInterface) == 0x000010, "Wrong size on ArchiveMenuViewInterface_GetArchiveRiftInterface");
static_assert(offsetof(ArchiveMenuViewInterface_GetArchiveRiftInterface, ReturnValue) == 0x000000, "Member 'ArchiveMenuViewInterface_GetArchiveRiftInterface::ReturnValue' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.GetArchiveTomeInterface
// 0x0010 (0x0010 - 0x0000)
struct ArchiveMenuViewInterface_GetArchiveTomeInterface final
{
public:
	TScriptInterface<class IArchiveTomeViewInterface> ReturnValue;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_GetArchiveTomeInterface) == 0x000008, "Wrong alignment on ArchiveMenuViewInterface_GetArchiveTomeInterface");
static_assert(sizeof(ArchiveMenuViewInterface_GetArchiveTomeInterface) == 0x000010, "Wrong size on ArchiveMenuViewInterface_GetArchiveTomeInterface");
static_assert(offsetof(ArchiveMenuViewInterface_GetArchiveTomeInterface, ReturnValue) == 0x000000, "Member 'ArchiveMenuViewInterface_GetArchiveTomeInterface::ReturnValue' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveQuestMapViewInterface.SetLoadingSpinner
// 0x0001 (0x0001 - 0x0000)
struct ArchiveQuestMapViewInterface_SetLoadingSpinner final
{
public:
	bool                                          isLoading;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveQuestMapViewInterface_SetLoadingSpinner) == 0x000001, "Wrong alignment on ArchiveQuestMapViewInterface_SetLoadingSpinner");
static_assert(sizeof(ArchiveQuestMapViewInterface_SetLoadingSpinner) == 0x000001, "Wrong size on ArchiveQuestMapViewInterface_SetLoadingSpinner");
static_assert(offsetof(ArchiveQuestMapViewInterface_SetLoadingSpinner, isLoading) == 0x000000, "Member 'ArchiveQuestMapViewInterface_SetLoadingSpinner::isLoading' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveQuestMapViewInterface.SetQuestMapData
// 0x0028 (0x0028 - 0x0000)
struct ArchiveQuestMapViewInterface_SetQuestMapData final
{
public:
	TArray<struct FArchiveNodeGraphViewData>      nodeDataList;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FArchiveMapPathViewData>        pathDataList;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          needsCascadeAppear;                                // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArchiveQuestMapViewInterface_SetQuestMapData) == 0x000008, "Wrong alignment on ArchiveQuestMapViewInterface_SetQuestMapData");
static_assert(sizeof(ArchiveQuestMapViewInterface_SetQuestMapData) == 0x000028, "Wrong size on ArchiveQuestMapViewInterface_SetQuestMapData");
static_assert(offsetof(ArchiveQuestMapViewInterface_SetQuestMapData, nodeDataList) == 0x000000, "Member 'ArchiveQuestMapViewInterface_SetQuestMapData::nodeDataList' has a wrong offset!");
static_assert(offsetof(ArchiveQuestMapViewInterface_SetQuestMapData, pathDataList) == 0x000010, "Member 'ArchiveQuestMapViewInterface_SetQuestMapData::pathDataList' has a wrong offset!");
static_assert(offsetof(ArchiveQuestMapViewInterface_SetQuestMapData, needsCascadeAppear) == 0x000020, "Member 'ArchiveQuestMapViewInterface_SetQuestMapData::needsCascadeAppear' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveQuestMapViewInterface.UpdateQuestMapData
// 0x0020 (0x0020 - 0x0000)
struct ArchiveQuestMapViewInterface_UpdateQuestMapData final
{
public:
	TArray<struct FArchiveNodeGraphViewData>      nodeDataList;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FArchiveMapPathViewData>        pathDataList;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveQuestMapViewInterface_UpdateQuestMapData) == 0x000008, "Wrong alignment on ArchiveQuestMapViewInterface_UpdateQuestMapData");
static_assert(sizeof(ArchiveQuestMapViewInterface_UpdateQuestMapData) == 0x000020, "Wrong size on ArchiveQuestMapViewInterface_UpdateQuestMapData");
static_assert(offsetof(ArchiveQuestMapViewInterface_UpdateQuestMapData, nodeDataList) == 0x000000, "Member 'ArchiveQuestMapViewInterface_UpdateQuestMapData::nodeDataList' has a wrong offset!");
static_assert(offsetof(ArchiveQuestMapViewInterface_UpdateQuestMapData, pathDataList) == 0x000010, "Member 'ArchiveQuestMapViewInterface_UpdateQuestMapData::pathDataList' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveRiftViewInterface.PlayUnlockingAnimation
// 0x000C (0x000C - 0x0000)
struct ArchiveRiftViewInterface_PlayUnlockingAnimation final
{
public:
	struct FArchivesRiftUnlockSequenceData        data;                                              // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveRiftViewInterface_PlayUnlockingAnimation) == 0x000004, "Wrong alignment on ArchiveRiftViewInterface_PlayUnlockingAnimation");
static_assert(sizeof(ArchiveRiftViewInterface_PlayUnlockingAnimation) == 0x00000C, "Wrong size on ArchiveRiftViewInterface_PlayUnlockingAnimation");
static_assert(offsetof(ArchiveRiftViewInterface_PlayUnlockingAnimation, data) == 0x000000, "Member 'ArchiveRiftViewInterface_PlayUnlockingAnimation::data' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveRiftViewInterface.SetData
// 0x0020 (0x0020 - 0x0000)
struct ArchiveRiftViewInterface_SetData final
{
public:
	struct FArchivesRiftGenericViewData           data;                                              // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveRiftViewInterface_SetData) == 0x000008, "Wrong alignment on ArchiveRiftViewInterface_SetData");
static_assert(sizeof(ArchiveRiftViewInterface_SetData) == 0x000020, "Wrong size on ArchiveRiftViewInterface_SetData");
static_assert(offsetof(ArchiveRiftViewInterface_SetData, data) == 0x000000, "Member 'ArchiveRiftViewInterface_SetData::data' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveRiftViewInterface.SetLoadingSpinner
// 0x0001 (0x0001 - 0x0000)
struct ArchiveRiftViewInterface_SetLoadingSpinner final
{
public:
	bool                                          isLoading;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveRiftViewInterface_SetLoadingSpinner) == 0x000001, "Wrong alignment on ArchiveRiftViewInterface_SetLoadingSpinner");
static_assert(sizeof(ArchiveRiftViewInterface_SetLoadingSpinner) == 0x000001, "Wrong size on ArchiveRiftViewInterface_SetLoadingSpinner");
static_assert(offsetof(ArchiveRiftViewInterface_SetLoadingSpinner, isLoading) == 0x000000, "Member 'ArchiveRiftViewInterface_SetLoadingSpinner::isLoading' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveRiftViewInterface.SetMatchmakingSoftlockState
// 0x0001 (0x0001 - 0x0000)
struct ArchiveRiftViewInterface_SetMatchmakingSoftlockState final
{
public:
	bool                                          isInMatchmakingSoftlock;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveRiftViewInterface_SetMatchmakingSoftlockState) == 0x000001, "Wrong alignment on ArchiveRiftViewInterface_SetMatchmakingSoftlockState");
static_assert(sizeof(ArchiveRiftViewInterface_SetMatchmakingSoftlockState) == 0x000001, "Wrong size on ArchiveRiftViewInterface_SetMatchmakingSoftlockState");
static_assert(offsetof(ArchiveRiftViewInterface_SetMatchmakingSoftlockState, isInMatchmakingSoftlock) == 0x000000, "Member 'ArchiveRiftViewInterface_SetMatchmakingSoftlockState::isInMatchmakingSoftlock' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveRiftViewInterface.SetRewardTiersData
// 0x0010 (0x0010 - 0x0000)
struct ArchiveRiftViewInterface_SetRewardTiersData final
{
public:
	TArray<struct FArchiveRiftTierRewardsViewData> riftTiersData;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveRiftViewInterface_SetRewardTiersData) == 0x000008, "Wrong alignment on ArchiveRiftViewInterface_SetRewardTiersData");
static_assert(sizeof(ArchiveRiftViewInterface_SetRewardTiersData) == 0x000010, "Wrong size on ArchiveRiftViewInterface_SetRewardTiersData");
static_assert(offsetof(ArchiveRiftViewInterface_SetRewardTiersData, riftTiersData) == 0x000000, "Member 'ArchiveRiftViewInterface_SetRewardTiersData::riftTiersData' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveRiftViewInterface.SetRiftFragmentTooltipViewData
// 0x00C0 (0x00C0 - 0x0000)
struct ArchiveRiftViewInterface_SetRiftFragmentTooltipViewData final
{
public:
	struct FCurrencyProgressionTooltipViewData    RiftFragmentTooltipViewData;                       // 0x0000(0x00C0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveRiftViewInterface_SetRiftFragmentTooltipViewData) == 0x000008, "Wrong alignment on ArchiveRiftViewInterface_SetRiftFragmentTooltipViewData");
static_assert(sizeof(ArchiveRiftViewInterface_SetRiftFragmentTooltipViewData) == 0x0000C0, "Wrong size on ArchiveRiftViewInterface_SetRiftFragmentTooltipViewData");
static_assert(offsetof(ArchiveRiftViewInterface_SetRiftFragmentTooltipViewData, RiftFragmentTooltipViewData) == 0x000000, "Member 'ArchiveRiftViewInterface_SetRiftFragmentTooltipViewData::RiftFragmentTooltipViewData' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveTomeViewInterface.SetMenuState
// 0x0001 (0x0001 - 0x0000)
struct ArchiveTomeViewInterface_SetMenuState final
{
public:
	EArchiveTomeMenuState                         menuState;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveTomeViewInterface_SetMenuState) == 0x000001, "Wrong alignment on ArchiveTomeViewInterface_SetMenuState");
static_assert(sizeof(ArchiveTomeViewInterface_SetMenuState) == 0x000001, "Wrong size on ArchiveTomeViewInterface_SetMenuState");
static_assert(offsetof(ArchiveTomeViewInterface_SetMenuState, menuState) == 0x000000, "Member 'ArchiveTomeViewInterface_SetMenuState::menuState' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveTomeViewInterface.SetNotificationVisibility
// 0x0008 (0x0008 - 0x0000)
struct ArchiveTomeViewInterface_SetNotificationVisibility final
{
public:
	int32                                         key;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          hasNotification;                                   // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
