#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDUIViewsCore

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DBDUIViewInterfaces_structs.hpp"
#include "DBDInput_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "DBDUIViewsCore_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function DBDUIViewsCore.CoreBaseLoadoutPartWidget.SetLoadoutPartIcon
// 0x0030 (0x0030 - 0x0000)
struct CoreBaseLoadoutPartWidget_SetLoadoutPartIcon final
{
public:
	TSoftObjectPtr<class UTexture2D>              icon;                                              // 0x0000(0x0030)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreBaseLoadoutPartWidget_SetLoadoutPartIcon) == 0x000008, "Wrong alignment on CoreBaseLoadoutPartWidget_SetLoadoutPartIcon");
static_assert(sizeof(CoreBaseLoadoutPartWidget_SetLoadoutPartIcon) == 0x000030, "Wrong size on CoreBaseLoadoutPartWidget_SetLoadoutPartIcon");
static_assert(offsetof(CoreBaseLoadoutPartWidget_SetLoadoutPartIcon, icon) == 0x000000, "Member 'CoreBaseLoadoutPartWidget_SetLoadoutPartIcon::icon' has a wrong offset!");

// Function DBDUIViewsCore.CoreBaseLoadoutPartWidget.SetLoadoutPartRarity
// 0x0001 (0x0001 - 0x0000)
struct CoreBaseLoadoutPartWidget_SetLoadoutPartRarity final
{
public:
	EItemRarity                                   rarity;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreBaseLoadoutPartWidget_SetLoadoutPartRarity) == 0x000001, "Wrong alignment on CoreBaseLoadoutPartWidget_SetLoadoutPartRarity");
static_assert(sizeof(CoreBaseLoadoutPartWidget_SetLoadoutPartRarity) == 0x000001, "Wrong size on CoreBaseLoadoutPartWidget_SetLoadoutPartRarity");
static_assert(offsetof(CoreBaseLoadoutPartWidget_SetLoadoutPartRarity, rarity) == 0x000000, "Member 'CoreBaseLoadoutPartWidget_SetLoadoutPartRarity::rarity' has a wrong offset!");

// Function DBDUIViewsCore.CoreBaseLoadoutPartWidget.SetLoadoutStackCount
// 0x0004 (0x0004 - 0x0000)
struct CoreBaseLoadoutPartWidget_SetLoadoutStackCount final
{
public:
	int32                                         stackCount;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreBaseLoadoutPartWidget_SetLoadoutStackCount) == 0x000004, "Wrong alignment on CoreBaseLoadoutPartWidget_SetLoadoutStackCount");
static_assert(sizeof(CoreBaseLoadoutPartWidget_SetLoadoutStackCount) == 0x000004, "Wrong size on CoreBaseLoadoutPartWidget_SetLoadoutStackCount");
static_assert(offsetof(CoreBaseLoadoutPartWidget_SetLoadoutStackCount, stackCount) == 0x000000, "Member 'CoreBaseLoadoutPartWidget_SetLoadoutStackCount::stackCount' has a wrong offset!");

// Function DBDUIViewsCore.CoreBaseUserWidget.OnControlModeChangedBP
// 0x0001 (0x0001 - 0x0000)
struct CoreBaseUserWidget_OnControlModeChangedBP final
{
public:
	EControlMode                                  controlMode;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreBaseUserWidget_OnControlModeChangedBP) == 0x000001, "Wrong alignment on CoreBaseUserWidget_OnControlModeChangedBP");
static_assert(sizeof(CoreBaseUserWidget_OnControlModeChangedBP) == 0x000001, "Wrong size on CoreBaseUserWidget_OnControlModeChangedBP");
static_assert(offsetof(CoreBaseUserWidget_OnControlModeChangedBP, controlMode) == 0x000000, "Member 'CoreBaseUserWidget_OnControlModeChangedBP::controlMode' has a wrong offset!");

// Function DBDUIViewsCore.CoreBaseUserWidget.PlayAnimationByName
// 0x0020 (0x0020 - 0x0000)
struct CoreBaseUserWidget_PlayAnimationByName final
{
public:
	class FName                                   animName;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         starttime;                                         // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         loopcount;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUMGSequencePlayMode                          playMode;                                          // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         playbackspeed;                                     // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CoreBaseUserWidget_PlayAnimationByName) == 0x000004, "Wrong alignment on CoreBaseUserWidget_PlayAnimationByName");
static_assert(sizeof(CoreBaseUserWidget_PlayAnimationByName) == 0x000020, "Wrong size on CoreBaseUserWidget_PlayAnimationByName");
static_assert(offsetof(CoreBaseUserWidget_PlayAnimationByName, animName) == 0x000000, "Member 'CoreBaseUserWidget_PlayAnimationByName::animName' has a wrong offset!");
static_assert(offsetof(CoreBaseUserWidget_PlayAnimationByName, starttime) == 0x00000C, "Member 'CoreBaseUserWidget_PlayAnimationByName::starttime' has a wrong offset!");
static_assert(offsetof(CoreBaseUserWidget_PlayAnimationByName, loopcount) == 0x000010, "Member 'CoreBaseUserWidget_PlayAnimationByName::loopcount' has a wrong offset!");
static_assert(offsetof(CoreBaseUserWidget_PlayAnimationByName, playMode) == 0x000014, "Member 'CoreBaseUserWidget_PlayAnimationByName::playMode' has a wrong offset!");
static_assert(offsetof(CoreBaseUserWidget_PlayAnimationByName, playbackspeed) == 0x000018, "Member 'CoreBaseUserWidget_PlayAnimationByName::playbackspeed' has a wrong offset!");
static_assert(offsetof(CoreBaseUserWidget_PlayAnimationByName, ReturnValue) == 0x00001C, "Member 'CoreBaseUserWidget_PlayAnimationByName::ReturnValue' has a wrong offset!");

// Function DBDUIViewsCore.CoreBaseUserWidget.StopAnimationByName
// 0x0010 (0x0010 - 0x0000)
struct CoreBaseUserWidget_StopAnimationByName final
{
public:
	class FName                                   animName;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CoreBaseUserWidget_StopAnimationByName) == 0x000004, "Wrong alignment on CoreBaseUserWidget_StopAnimationByName");
static_assert(sizeof(CoreBaseUserWidget_StopAnimationByName) == 0x000010, "Wrong size on CoreBaseUserWidget_StopAnimationByName");
static_assert(offsetof(CoreBaseUserWidget_StopAnimationByName, animName) == 0x000000, "Member 'CoreBaseUserWidget_StopAnimationByName::animName' has a wrong offset!");
static_assert(offsetof(CoreBaseUserWidget_StopAnimationByName, ReturnValue) == 0x00000C, "Member 'CoreBaseUserWidget_StopAnimationByName::ReturnValue' has a wrong offset!");

// Function DBDUIViewsCore.CoreBaseUserWidget.UpdateScale
// 0x0004 (0x0004 - 0x0000)
struct CoreBaseUserWidget_UpdateScale final
{
public:
	float                                         scale;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreBaseUserWidget_UpdateScale) == 0x000004, "Wrong alignment on CoreBaseUserWidget_UpdateScale");
static_assert(sizeof(CoreBaseUserWidget_UpdateScale) == 0x000004, "Wrong size on CoreBaseUserWidget_UpdateScale");
static_assert(offsetof(CoreBaseUserWidget_UpdateScale, scale) == 0x000000, "Member 'CoreBaseUserWidget_UpdateScale::scale' has a wrong offset!");

// Function DBDUIViewsCore.CoreBaseUserWidget.GetAnimationByName
// 0x0018 (0x0018 - 0x0000)
struct CoreBaseUserWidget_GetAnimationByName final
{
public:
	class FName                                   animName;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreBaseUserWidget_GetAnimationByName) == 0x000008, "Wrong alignment on CoreBaseUserWidget_GetAnimationByName");
static_assert(sizeof(CoreBaseUserWidget_GetAnimationByName) == 0x000018, "Wrong size on CoreBaseUserWidget_GetAnimationByName");
static_assert(offsetof(CoreBaseUserWidget_GetAnimationByName, animName) == 0x000000, "Member 'CoreBaseUserWidget_GetAnimationByName::animName' has a wrong offset!");
static_assert(offsetof(CoreBaseUserWidget_GetAnimationByName, ReturnValue) == 0x000010, "Member 'CoreBaseUserWidget_GetAnimationByName::ReturnValue' has a wrong offset!");

// Function DBDUIViewsCore.CoreButtonWidget.OnAlignmentChanged
// 0x0001 (0x0001 - 0x0000)
struct CoreButtonWidget_OnAlignmentChanged final
{
public:
	ETextJustify                                  newAlignment;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreButtonWidget_OnAlignmentChanged) == 0x000001, "Wrong alignment on CoreButtonWidget_OnAlignmentChanged");
static_assert(sizeof(CoreButtonWidget_OnAlignmentChanged) == 0x000001, "Wrong size on CoreButtonWidget_OnAlignmentChanged");
static_assert(offsetof(CoreButtonWidget_OnAlignmentChanged, newAlignment) == 0x000000, "Member 'CoreButtonWidget_OnAlignmentChanged::newAlignment' has a wrong offset!");

// Function DBDUIViewsCore.CoreButtonWidget.OnEnabledChanged
// 0x0001 (0x0001 - 0x0000)
struct CoreButtonWidget_OnEnabledChanged final
{
public:
	bool                                          isEnabled;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreButtonWidget_OnEnabledChanged) == 0x000001, "Wrong alignment on CoreButtonWidget_OnEnabledChanged");
static_assert(sizeof(CoreButtonWidget_OnEnabledChanged) == 0x000001, "Wrong size on CoreButtonWidget_OnEnabledChanged");
static_assert(offsetof(CoreButtonWidget_OnEnabledChanged, isEnabled) == 0x000000, "Member 'CoreButtonWidget_OnEnabledChanged::isEnabled' has a wrong offset!");

// Function DBDUIViewsCore.CoreButtonWidget.SetAdditionalIcon
// 0x0030 (0x0030 - 0x0000)
struct CoreButtonWidget_SetAdditionalIcon final
{
public:
	TSoftObjectPtr<class UTexture2D>              iconTexture;                                       // 0x0000(0x0030)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreButtonWidget_SetAdditionalIcon) == 0x000008, "Wrong alignment on CoreButtonWidget_SetAdditionalIcon");
static_assert(sizeof(CoreButtonWidget_SetAdditionalIcon) == 0x000030, "Wrong size on CoreButtonWidget_SetAdditionalIcon");
static_assert(offsetof(CoreButtonWidget_SetAdditionalIcon, iconTexture) == 0x000000, "Member 'CoreButtonWidget_SetAdditionalIcon::iconTexture' has a wrong offset!");

// Function DBDUIViewsCore.CoreButtonWidget.SetAlignment
// 0x0001 (0x0001 - 0x0000)
struct CoreButtonWidget_SetAlignment final
{
public:
	ETextJustify                                  newAlignment;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreButtonWidget_SetAlignment) == 0x000001, "Wrong alignment on CoreButtonWidget_SetAlignment");
static_assert(sizeof(CoreButtonWidget_SetAlignment) == 0x000001, "Wrong size on CoreButtonWidget_SetAlignment");
static_assert(offsetof(CoreButtonWidget_SetAlignment, newAlignment) == 0x000000, "Member 'CoreButtonWidget_SetAlignment::newAlignment' has a wrong offset!");

// Function DBDUIViewsCore.CoreButtonWidget.SetBackground
// 0x0030 (0x0030 - 0x0000)
struct CoreButtonWidget_SetBackground final
{
public:
	TSoftObjectPtr<class UMaterialInstance>       backgroundMaterial;                                // 0x0000(0x0030)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreButtonWidget_SetBackground) == 0x000008, "Wrong alignment on CoreButtonWidget_SetBackground");
static_assert(sizeof(CoreButtonWidget_SetBackground) == 0x000030, "Wrong size on CoreButtonWidget_SetBackground");
static_assert(offsetof(CoreButtonWidget_SetBackground, backgroundMaterial) == 0x000000, "Member 'CoreButtonWidget_SetBackground::backgroundMaterial' has a wrong offset!");

// Function DBDUIViewsCore.CoreButtonWidget.SetChargeable
// 0x0001 (0x0001 - 0x0000)
struct CoreButtonWidget_SetChargeable final
{
public:
	bool                                          isChargeable;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreButtonWidget_SetChargeable) == 0x000001, "Wrong alignment on CoreButtonWidget_SetChargeable");
static_assert(sizeof(CoreButtonWidget_SetChargeable) == 0x000001, "Wrong size on CoreButtonWidget_SetChargeable");
static_assert(offsetof(CoreButtonWidget_SetChargeable, isChargeable) == 0x000000, "Member 'CoreButtonWidget_SetChargeable::isChargeable' has a wrong offset!");

// Function DBDUIViewsCore.CoreButtonWidget.SetClickable
// 0x0001 (0x0001 - 0x0000)
struct CoreButtonWidget_SetClickable final
{
public:
	bool                                          isClickable;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreButtonWidget_SetClickable) == 0x000001, "Wrong alignment on CoreButtonWidget_SetClickable");
static_assert(sizeof(CoreButtonWidget_SetClickable) == 0x000001, "Wrong size on CoreButtonWidget_SetClickable");
static_assert(offsetof(CoreButtonWidget_SetClickable, isClickable) == 0x000000, "Member 'CoreButtonWidget_SetClickable::isClickable' has a wrong offset!");

// Function DBDUIViewsCore.CoreButtonWidget.SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct CoreButtonWidget_SetEnabled final
{
public:
	bool                                          isEnabled;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreButtonWidget_SetEnabled) == 0x000001, "Wrong alignment on CoreButtonWidget_SetEnabled");
static_assert(sizeof(CoreButtonWidget_SetEnabled) == 0x000001, "Wrong size on CoreButtonWidget_SetEnabled");
static_assert(offsetof(CoreButtonWidget_SetEnabled, isEnabled) == 0x000000, "Member 'CoreButtonWidget_SetEnabled::isEnabled' has a wrong offset!");

// Function DBDUIViewsCore.CoreButtonWidget.SetHoldable
// 0x0001 (0x0001 - 0x0000)
struct CoreButtonWidget_SetHoldable final
{
public:
	bool                                          isHoldable;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreButtonWidget_SetHoldable) == 0x000001, "Wrong alignment on CoreButtonWidget_SetHoldable");
static_assert(sizeof(CoreButtonWidget_SetHoldable) == 0x000001, "Wrong size on CoreButtonWidget_SetHoldable");
static_assert(offsetof(CoreButtonWidget_SetHoldable, isHoldable) == 0x000000, "Member 'CoreButtonWidget_SetHoldable::isHoldable' has a wrong offset!");

// Function DBDUIViewsCore.CoreButtonWidget.SetHoverable
// 0x0001 (0x0001 - 0x0000)
struct CoreButtonWidget_SetHoverable final
{
public:
	bool                                          isHoverable;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreButtonWidget_SetHoverable) == 0x000001, "Wrong alignment on CoreButtonWidget_SetHoverable");
static_assert(sizeof(CoreButtonWidget_SetHoverable) == 0x000001, "Wrong size on CoreButtonWidget_SetHoverable");
static_assert(offsetof(CoreButtonWidget_SetHoverable, isHoverable) == 0x000000, "Member 'CoreButtonWidget_SetHoverable::isHoverable' has a wrong offset!");

// Function DBDUIViewsCore.CoreButtonWidget.SetLabel
// 0x0018 (0x0018 - 0x0000)
struct CoreButtonWidget_SetLabel final
{
public:
	class FText                                   label;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreButtonWidget_SetLabel) == 0x000008, "Wrong alignment on CoreButtonWidget_SetLabel");
static_assert(sizeof(CoreButtonWidget_SetLabel) == 0x000018, "Wrong size on CoreButtonWidget_SetLabel");
static_assert(offsetof(CoreButtonWidget_SetLabel, label) == 0x000000, "Member 'CoreButtonWidget_SetLabel::label' has a wrong offset!");

// Function DBDUIViewsCore.CoreButtonWidget.SetPressable
// 0x0001 (0x0001 - 0x0000)
struct CoreButtonWidget_SetPressable final
{
public:
	bool                                          isPressable;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreButtonWidget_SetPressable) == 0x000001, "Wrong alignment on CoreButtonWidget_SetPressable");
static_assert(sizeof(CoreButtonWidget_SetPressable) == 0x000001, "Wrong size on CoreButtonWidget_SetPressable");
static_assert(offsetof(CoreButtonWidget_SetPressable, isPressable) == 0x000000, "Member 'CoreButtonWidget_SetPressable::isPressable' has a wrong offset!");

// Function DBDUIViewsCore.CoreButtonWidget.SetRepeatable
// 0x0010 (0x0010 - 0x0000)
struct CoreButtonWidget_SetRepeatable final
{
public:
	bool                                          isRepeatable;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            repetitionDelayCurve;                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreButtonWidget_SetRepeatable) == 0x000008, "Wrong alignment on CoreButtonWidget_SetRepeatable");
static_assert(sizeof(CoreButtonWidget_SetRepeatable) == 0x000010, "Wrong size on CoreButtonWidget_SetRepeatable");
static_assert(offsetof(CoreButtonWidget_SetRepeatable, isRepeatable) == 0x000000, "Member 'CoreButtonWidget_SetRepeatable::isRepeatable' has a wrong offset!");
static_assert(offsetof(CoreButtonWidget_SetRepeatable, repetitionDelayCurve) == 0x000008, "Member 'CoreButtonWidget_SetRepeatable::repetitionDelayCurve' has a wrong offset!");

// Function DBDUIViewsCore.CoreButtonWidget.SetVisible
// 0x0001 (0x0001 - 0x0000)
struct CoreButtonWidget_SetVisible final
{
public:
	EButtonWidgetVisibility                       visible;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreButtonWidget_SetVisible) == 0x000001, "Wrong alignment on CoreButtonWidget_SetVisible");
static_assert(sizeof(CoreButtonWidget_SetVisible) == 0x000001, "Wrong size on CoreButtonWidget_SetVisible");
static_assert(offsetof(CoreButtonWidget_SetVisible, visible) == 0x000000, "Member 'CoreButtonWidget_SetVisible::visible' has a wrong offset!");

// Function DBDUIViewsCore.CoreButtonWidget.GetHitzonePaintSpaceGeometry
// 0x0038 (0x0038 - 0x0000)
struct CoreButtonWidget_GetHitzonePaintSpaceGeometry final
{
public:
	struct FGeometry                              ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreButtonWidget_GetHitzonePaintSpaceGeometry) == 0x000004, "Wrong alignment on CoreButtonWidget_GetHitzonePaintSpaceGeometry");
static_assert(sizeof(CoreButtonWidget_GetHitzonePaintSpaceGeometry) == 0x000038, "Wrong size on CoreButtonWidget_GetHitzonePaintSpaceGeometry");
static_assert(offsetof(CoreButtonWidget_GetHitzonePaintSpaceGeometry, ReturnValue) == 0x000000, "Member 'CoreButtonWidget_GetHitzonePaintSpaceGeometry::ReturnValue' has a wrong offset!");

// Function DBDUIViewsCore.CoreButtonWidget.IsEnabled
// 0x0001 (0x0001 - 0x0000)
struct CoreButtonWidget_IsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreButtonWidget_IsEnabled) == 0x000001, "Wrong alignment on CoreButtonWidget_IsEnabled");
static_assert(sizeof(CoreButtonWidget_IsEnabled) == 0x000001, "Wrong size on CoreButtonWidget_IsEnabled");
static_assert(offsetof(CoreButtonWidget_IsEnabled, ReturnValue) == 0x000000, "Member 'CoreButtonWidget_IsEnabled::ReturnValue' has a wrong offset!");

// Function DBDUIViewsCore.CoreGameManualCategoryButton.SetText
// 0x0030 (0x0030 - 0x0000)
struct CoreGameManualCategoryButton_SetText final
{
public:
	class FText                                   title;                                             // 0x0000(0x0018)(ConstParm, Parm, NativeAccessSpecifierPublic)
	class FText                                   description;                                       // 0x0018(0x0018)(ConstParm, Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreGameManualCategoryButton_SetText) == 0x000008, "Wrong alignment on CoreGameManualCategoryButton_SetText");
static_assert(sizeof(CoreGameManualCategoryButton_SetText) == 0x000030, "Wrong size on CoreGameManualCategoryButton_SetText");
static_assert(offsetof(CoreGameManualCategoryButton_SetText, title) == 0x000000, "Member 'CoreGameManualCategoryButton_SetText::title' has a wrong offset!");
static_assert(offsetof(CoreGameManualCategoryButton_SetText, description) == 0x000018, "Member 'CoreGameManualCategoryButton_SetText::description' has a wrong offset!");

// Function DBDUIViewsCore.ArchiveCompendiumTooltipWidget.SetTooltipData
// 0x0070 (0x0070 - 0x0000)
struct ArchiveCompendiumTooltipWidget_SetTooltipData final
{
public:
	struct FCompendiumButtonData                  tooltipViewData;                                   // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveCompendiumTooltipWidget_SetTooltipData) == 0x000008, "Wrong alignment on ArchiveCompendiumTooltipWidget_SetTooltipData");
static_assert(sizeof(ArchiveCompendiumTooltipWidget_SetTooltipData) == 0x000070, "Wrong size on ArchiveCompendiumTooltipWidget_SetTooltipData");
static_assert(offsetof(ArchiveCompendiumTooltipWidget_SetTooltipData, tooltipViewData) == 0x000000, "Member 'ArchiveCompendiumTooltipWidget_SetTooltipData::tooltipViewData' has a wrong offset!");

// Function DBDUIViewsCore.ArchiveNodeTooltipWidget.SetNodeType
// 0x0001 (0x0001 - 0x0000)
struct ArchiveNodeTooltipWidget_SetNodeType final
{
public:
	EArchiveNodeType                              type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveNodeTooltipWidget_SetNodeType) == 0x000001, "Wrong alignment on ArchiveNodeTooltipWidget_SetNodeType");
static_assert(sizeof(ArchiveNodeTooltipWidget_SetNodeType) == 0x000001, "Wrong size on ArchiveNodeTooltipWidget_SetNodeType");
static_assert(offsetof(ArchiveNodeTooltipWidget_SetNodeType, type) == 0x000000, "Member 'ArchiveNodeTooltipWidget_SetNodeType::type' has a wrong offset!");

// Function DBDUIViewsCore.ArchiveNodeTooltipWidget.SetTooltipData
// 0x00B8 (0x00B8 - 0x0000)
struct ArchiveNodeTooltipWidget_SetTooltipData final
{
public:
	struct FArchiveNodeViewData                   nodeViewData;                                      // 0x0000(0x00B8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveNodeTooltipWidget_SetTooltipData) == 0x000008, "Wrong alignment on ArchiveNodeTooltipWidget_SetTooltipData");
static_assert(sizeof(ArchiveNodeTooltipWidget_SetTooltipData) == 0x0000B8, "Wrong size on ArchiveNodeTooltipWidget_SetTooltipData");
static_assert(offsetof(ArchiveNodeTooltipWidget_SetTooltipData, nodeViewData) == 0x000000, "Member 'ArchiveNodeTooltipWidget_SetTooltipData::nodeViewData' has a wrong offset!");

// Function DBDUIViewsCore.AspectRatioBox.SetAspectRatio
// 0x0004 (0x0004 - 0x0000)
struct AspectRatioBox_SetAspectRatio final
{
public:
	float                                         inAspectRatio;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AspectRatioBox_SetAspectRatio) == 0x000004, "Wrong alignment on AspectRatioBox_SetAspectRatio");
static_assert(sizeof(AspectRatioBox_SetAspectRatio) == 0x000004, "Wrong size on AspectRatioBox_SetAspectRatio");
static_assert(offsetof(AspectRatioBox_SetAspectRatio, inAspectRatio) == 0x000000, "Member 'AspectRatioBox_SetAspectRatio::inAspectRatio' has a wrong offset!");

// Function DBDUIViewsCore.AspectRatioBoxSlot.SetHorizontalAlignment
// 0x0001 (0x0001 - 0x0000)
struct AspectRatioBoxSlot_SetHorizontalAlignment final
{
public:
	EHorizontalAlignment                          inHorizontalAlignment;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AspectRatioBoxSlot_SetHorizontalAlignment) == 0x000001, "Wrong alignment on AspectRatioBoxSlot_SetHorizontalAlignment");
static_assert(sizeof(AspectRatioBoxSlot_SetHorizontalAlignment) == 0x000001, "Wrong size on AspectRatioBoxSlot_SetHorizontalAlignment");
static_assert(offsetof(AspectRatioBoxSlot_SetHorizontalAlignment, inHorizontalAlignment) == 0x000000, "Member 'AspectRatioBoxSlot_SetHorizontalAlignment::inHorizontalAlignment' has a wrong offset!");

// Function DBDUIViewsCore.AspectRatioBoxSlot.SetPadding
// 0x0010 (0x0010 - 0x0000)
struct AspectRatioBoxSlot_SetPadding final
{
public:
	struct FMargin                                inPadding;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AspectRatioBoxSlot_SetPadding) == 0x000004, "Wrong alignment on AspectRatioBoxSlot_SetPadding");
static_assert(sizeof(AspectRatioBoxSlot_SetPadding) == 0x000010, "Wrong size on AspectRatioBoxSlot_SetPadding");
static_assert(offsetof(AspectRatioBoxSlot_SetPadding, inPadding) == 0x000000, "Member 'AspectRatioBoxSlot_SetPadding::inPadding' has a wrong offset!");

// Function DBDUIViewsCore.AspectRatioBoxSlot.SetVerticalAlignment
// 0x0001 (0x0001 - 0x0000)
struct AspectRatioBoxSlot_SetVerticalAlignment final
{
public:
	EVerticalAlignment                            inVerticalAlignment;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AspectRatioBoxSlot_SetVerticalAlignment) == 0x000001, "Wrong alignment on AspectRatioBoxSlot_SetVerticalAlignment");
static_assert(sizeof(AspectRatioBoxSlot_SetVerticalAlignment) == 0x000001, "Wrong size on AspectRatioBoxSlot_SetVerticalAlignment");
static_assert(offsetof(AspectRatioBoxSlot_SetVerticalAlignment, inVerticalAlignment) == 0x000000, "Member 'AspectRatioBoxSlot_SetVerticalAlignment::inVerticalAlignment' has a wrong offset!");

// Function DBDUIViewsCore.CharacterTooltipWidget.SetDifficulty
// 0x0001 (0x0001 - 0x0000)
struct CharacterTooltipWidget_SetDifficulty final
{
public:
	ECharacterDifficulty                          difficulty;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterTooltipWidget_SetDifficulty) == 0x000001, "Wrong alignment on CharacterTooltipWidget_SetDifficulty");
static_assert(sizeof(CharacterTooltipWidget_SetDifficulty) == 0x000001, "Wrong size on CharacterTooltipWidget_SetDifficulty");
static_assert(offsetof(CharacterTooltipWidget_SetDifficulty, difficulty) == 0x000000, "Member 'CharacterTooltipWidget_SetDifficulty::difficulty' has a wrong offset!");

// Function DBDUIViewsCore.CharacterTooltipWidget.SetLevel
// 0x0004 (0x0004 - 0x0000)
struct CharacterTooltipWidget_SetLevel final
{
public:
	int32                                         level;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterTooltipWidget_SetLevel) == 0x000004, "Wrong alignment on CharacterTooltipWidget_SetLevel");
static_assert(sizeof(CharacterTooltipWidget_SetLevel) == 0x000004, "Wrong size on CharacterTooltipWidget_SetLevel");
static_assert(offsetof(CharacterTooltipWidget_SetLevel, level) == 0x000000, "Member 'CharacterTooltipWidget_SetLevel::level' has a wrong offset!");

// Function DBDUIViewsCore.CharacterTooltipWidget.SetTooltipData
// 0x0070 (0x0070 - 0x0000)
struct CharacterTooltipWidget_SetTooltipData final
{
public:
	struct FCharacterTooltipViewData              characterViewData;                                 // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterTooltipWidget_SetTooltipData) == 0x000008, "Wrong alignment on CharacterTooltipWidget_SetTooltipData");
static_assert(sizeof(CharacterTooltipWidget_SetTooltipData) == 0x000070, "Wrong size on CharacterTooltipWidget_SetTooltipData");
static_assert(offsetof(CharacterTooltipWidget_SetTooltipData, characterViewData) == 0x000000, "Member 'CharacterTooltipWidget_SetTooltipData::characterViewData' has a wrong offset!");

// Function DBDUIViewsCore.CoreSelectableButtonWidget.OnSelectedChanged
// 0x0001 (0x0001 - 0x0000)
struct CoreSelectableButtonWidget_OnSelectedChanged final
{
public:
	bool                                          isSelected;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreSelectableButtonWidget_OnSelectedChanged) == 0x000001, "Wrong alignment on CoreSelectableButtonWidget_OnSelectedChanged");
static_assert(sizeof(CoreSelectableButtonWidget_OnSelectedChanged) == 0x000001, "Wrong size on CoreSelectableButtonWidget_OnSelectedChanged");
static_assert(offsetof(CoreSelectableButtonWidget_OnSelectedChanged, isSelected) == 0x000000, "Member 'CoreSelectableButtonWidget_OnSelectedChanged::isSelected' has a wrong offset!");

// Function DBDUIViewsCore.CoreSelectableButtonWidget.SetSelectable
// 0x0001 (0x0001 - 0x0000)
struct CoreSelectableButtonWidget_SetSelectable final
{
public:
	bool                                          isSelectable;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreSelectableButtonWidget_SetSelectable) == 0x000001, "Wrong alignment on CoreSelectableButtonWidget_SetSelectable");
static_assert(sizeof(CoreSelectableButtonWidget_SetSelectable) == 0x000001, "Wrong size on CoreSelectableButtonWidget_SetSelectable");
static_assert(offsetof(CoreSelectableButtonWidget_SetSelectable, isSelectable) == 0x000000, "Member 'CoreSelectableButtonWidget_SetSelectable::isSelectable' has a wrong offset!");

// Function DBDUIViewsCore.CoreSelectableButtonWidget.SetSelected
// 0x0001 (0x0001 - 0x0000)
struct CoreSelectableButtonWidget_SetSelected final
{
public:
	bool                                          isSelected;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreSelectableButtonWidget_SetSelected) == 0x000001, "Wrong alignment on CoreSelectableButtonWidget_SetSelected");
static_assert(sizeof(CoreSelectableButtonWidget_SetSelected) == 0x000001, "Wrong size on CoreSelectableButtonWidget_SetSelected");
static_assert(offsetof(CoreSelectableButtonWidget_SetSelected, isSelected) == 0x000000, "Member 'CoreSelectableButtonWidget_SetSelected::isSelected' has a wrong offset!");

// Function DBDUIViewsCore.CoreSelectableButtonWidget.UpdateBackgroundSkin
// 0x0008 (0x0008 - 0x0000)
struct CoreSelectableButtonWidget_UpdateBackgroundSkin final
{
public:
	class UMaterialInterface*                     skinMaterial;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreSelectableButtonWidget_UpdateBackgroundSkin) == 0x000008, "Wrong alignment on CoreSelectableButtonWidget_UpdateBackgroundSkin");
static_assert(sizeof(CoreSelectableButtonWidget_UpdateBackgroundSkin) == 0x000008, "Wrong size on CoreSelectableButtonWidget_UpdateBackgroundSkin");
static_assert(offsetof(CoreSelectableButtonWidget_UpdateBackgroundSkin, skinMaterial) == 0x000000, "Member 'CoreSelectableButtonWidget_UpdateBackgroundSkin::skinMaterial' has a wrong offset!");

// Function DBDUIViewsCore.CoreSelectableButtonWidget.IsSelectable
// 0x0001 (0x0001 - 0x0000)
struct CoreSelectableButtonWidget_IsSelectable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreSelectableButtonWidget_IsSelectable) == 0x000001, "Wrong alignment on CoreSelectableButtonWidget_IsSelectable");
static_assert(sizeof(CoreSelectableButtonWidget_IsSelectable) == 0x000001, "Wrong size on CoreSelectableButtonWidget_IsSelectable");
static_assert(offsetof(CoreSelectableButtonWidget_IsSelectable, ReturnValue) == 0x000000, "Member 'CoreSelectableButtonWidget_IsSelectable::ReturnValue' has a wrong offset!");

// Function DBDUIViewsCore.CoreSelectableButtonWidget.IsSelected
// 0x0001 (0x0001 - 0x0000)
struct CoreSelectableButtonWidget_IsSelected final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreSelectableButtonWidget_IsSelected) == 0x000001, "Wrong alignment on CoreSelectableButtonWidget_IsSelected");
static_assert(sizeof(CoreSelectableButtonWidget_IsSelected) == 0x000001, "Wrong size on CoreSelectableButtonWidget_IsSelected");
static_assert(offsetof(CoreSelectableButtonWidget_IsSelected, ReturnValue) == 0x000000, "Member 'CoreSelectableButtonWidget_IsSelected::ReturnValue' has a wrong offset!");

// Function DBDUIViewsCore.CoreArchiveChallengeReminderSlotWidget.Init
// 0x0001 (0x0001 - 0x0000)
struct CoreArchiveChallengeReminderSlotWidget_Init final
{
public:
	EPlayerRole                                   role;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreArchiveChallengeReminderSlotWidget_Init) == 0x000001, "Wrong alignment on CoreArchiveChallengeReminderSlotWidget_Init");
static_assert(sizeof(CoreArchiveChallengeReminderSlotWidget_Init) == 0x000001, "Wrong size on CoreArchiveChallengeReminderSlotWidget_Init");
static_assert(offsetof(CoreArchiveChallengeReminderSlotWidget_Init, role) == 0x000000, "Member 'CoreArchiveChallengeReminderSlotWidget_Init::role' has a wrong offset!");

// Function DBDUIViewsCore.CoreArchiveChallengeReminderSlotWidget.SetData
// 0x00D0 (0x00D0 - 0x0000)
struct CoreArchiveChallengeReminderSlotWidget_SetData final
{
public:
	struct FArchiveChallengeReminderViewData      data;                                              // 0x0000(0x00D0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreArchiveChallengeReminderSlotWidget_SetData) == 0x000008, "Wrong alignment on CoreArchiveChallengeReminderSlotWidget_SetData");
static_assert(sizeof(CoreArchiveChallengeReminderSlotWidget_SetData) == 0x0000D0, "Wrong size on CoreArchiveChallengeReminderSlotWidget_SetData");
static_assert(offsetof(CoreArchiveChallengeReminderSlotWidget_SetData, data) == 0x000000, "Member 'CoreArchiveChallengeReminderSlotWidget_SetData::data' has a wrong offset!");

// Function DBDUIViewsCore.CoreArchiveChallengeReminderSlotWidget.SetQuestNodeHoverEffect
// 0x0001 (0x0001 - 0x0000)
struct CoreArchiveChallengeReminderSlotWidget_SetQuestNodeHoverEffect final
{
public:
	bool                                          isHovered;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreArchiveChallengeReminderSlotWidget_SetQuestNodeHoverEffect) == 0x000001, "Wrong alignment on CoreArchiveChallengeReminderSlotWidget_SetQuestNodeHoverEffect");
static_assert(sizeof(CoreArchiveChallengeReminderSlotWidget_SetQuestNodeHoverEffect) == 0x000001, "Wrong size on CoreArchiveChallengeReminderSlotWidget_SetQuestNodeHoverEffect");
static_assert(offsetof(CoreArchiveChallengeReminderSlotWidget_SetQuestNodeHoverEffect, isHovered) == 0x000000, "Member 'CoreArchiveChallengeReminderSlotWidget_SetQuestNodeHoverEffect::isHovered' has a wrong offset!");

// Function DBDUIViewsCore.CoreArchiveChallengeReminderSlotWidget.SetSlotSelectorState
// 0x0001 (0x0001 - 0x0000)
struct CoreArchiveChallengeReminderSlotWidget_SetSlotSelectorState final
{
public:
	bool                                          isSelectorOpen;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreArchiveChallengeReminderSlotWidget_SetSlotSelectorState) == 0x000001, "Wrong alignment on CoreArchiveChallengeReminderSlotWidget_SetSlotSelectorState");
static_assert(sizeof(CoreArchiveChallengeReminderSlotWidget_SetSlotSelectorState) == 0x000001, "Wrong size on CoreArchiveChallengeReminderSlotWidget_SetSlotSelectorState");
static_assert(offsetof(CoreArchiveChallengeReminderSlotWidget_SetSlotSelectorState, isSelectorOpen) == 0x000000, "Member 'CoreArchiveChallengeReminderSlotWidget_SetSlotSelectorState::isSelectorOpen' has a wrong offset!");

// Function DBDUIViewsCore.CoreArchiveChallengeReminderSlotWidget.SwapChallenge
// 0x00D0 (0x00D0 - 0x0000)
struct CoreArchiveChallengeReminderSlotWidget_SwapChallenge final
{
public:
	struct FArchiveChallengeReminderViewData      data;                                              // 0x0000(0x00D0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreArchiveChallengeReminderSlotWidget_SwapChallenge) == 0x000008, "Wrong alignment on CoreArchiveChallengeReminderSlotWidget_SwapChallenge");
static_assert(sizeof(CoreArchiveChallengeReminderSlotWidget_SwapChallenge) == 0x0000D0, "Wrong size on CoreArchiveChallengeReminderSlotWidget_SwapChallenge");
static_assert(offsetof(CoreArchiveChallengeReminderSlotWidget_SwapChallenge, data) == 0x000000, "Member 'CoreArchiveChallengeReminderSlotWidget_SwapChallenge::data' has a wrong offset!");

// Function DBDUIViewsCore.CoreArchiveChallengeReminderSlotWidget.UpdateActiveState
// 0x0002 (0x0002 - 0x0000)
struct CoreArchiveChallengeReminderSlotWidget_UpdateActiveState final
{
public:
	bool                                          isActive;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          playAnimation;                                     // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreArchiveChallengeReminderSlotWidget_UpdateActiveState) == 0x000001, "Wrong alignment on CoreArchiveChallengeReminderSlotWidget_UpdateActiveState");
static_assert(sizeof(CoreArchiveChallengeReminderSlotWidget_UpdateActiveState) == 0x000002, "Wrong size on CoreArchiveChallengeReminderSlotWidget_UpdateActiveState");
static_assert(offsetof(CoreArchiveChallengeReminderSlotWidget_UpdateActiveState, isActive) == 0x000000, "Member 'CoreArchiveChallengeReminderSlotWidget_UpdateActiveState::isActive' has a wrong offset!");
static_assert(offsetof(CoreArchiveChallengeReminderSlotWidget_UpdateActiveState, playAnimation) == 0x000001, "Member 'CoreArchiveChallengeReminderSlotWidget_UpdateActiveState::playAnimation' has a wrong offset!");

// Function DBDUIViewsCore.CoreArchiveChallengeReminderSlotWidget.UpdateProgressBar
// 0x0004 (0x0004 - 0x0000)
struct CoreArchiveChallengeReminderSlotWidget_UpdateProgressBar final
{
public:
	float                                         progress;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreArchiveChallengeReminderSlotWidget_UpdateProgressBar) == 0x000004, "Wrong alignment on CoreArchiveChallengeReminderSlotWidget_UpdateProgressBar");
static_assert(sizeof(CoreArchiveChallengeReminderSlotWidget_UpdateProgressBar) == 0x000004, "Wrong size on CoreArchiveChallengeReminderSlotWidget_UpdateProgressBar");
static_assert(offsetof(CoreArchiveChallengeReminderSlotWidget_UpdateProgressBar, progress) == 0x000000, "Member 'CoreArchiveChallengeReminderSlotWidget_UpdateProgressBar::progress' has a wrong offset!");

// Function DBDUIViewsCore.CoreArchiveChallengeReminderSlotWidget.UpdateVisualState
// 0x00D0 (0x00D0 - 0x0000)
struct CoreArchiveChallengeReminderSlotWidget_UpdateVisualState final
{
public:
	struct FArchiveChallengeReminderViewData      data;                                              // 0x0000(0x00D0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreArchiveChallengeReminderSlotWidget_UpdateVisualState) == 0x000008, "Wrong alignment on CoreArchiveChallengeReminderSlotWidget_UpdateVisualState");
static_assert(sizeof(CoreArchiveChallengeReminderSlotWidget_UpdateVisualState) == 0x0000D0, "Wrong size on CoreArchiveChallengeReminderSlotWidget_UpdateVisualState");
static_assert(offsetof(CoreArchiveChallengeReminderSlotWidget_UpdateVisualState, data) == 0x000000, "Member 'CoreArchiveChallengeReminderSlotWidget_UpdateVisualState::data' has a wrong offset!");

// Function DBDUIViewsCore.CoreArchiveCompendiumButtonWidget.GetTomeId
// 0x0010 (0x0010 - 0x0000)
struct CoreArchiveCompendiumButtonWidget_GetTomeId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreArchiveCompendiumButtonWidget_GetTomeId) == 0x000008, "Wrong alignment on CoreArchiveCompendiumButtonWidget_GetTomeId");
static_assert(sizeof(CoreArchiveCompendiumButtonWidget_GetTomeId) == 0x000010, "Wrong size on CoreArchiveCompendiumButtonWidget_GetTomeId");
static_assert(offsetof(CoreArchiveCompendiumButtonWidget_GetTomeId, ReturnValue) == 0x000000, "Member 'CoreArchiveCompendiumButtonWidget_GetTomeId::ReturnValue' has a wrong offset!");

// Function DBDUIViewsCore.CoreArchiveCompendiumButtonWidget.SetButtonData
// 0x0070 (0x0070 - 0x0000)
struct CoreArchiveCompendiumButtonWidget_SetButtonData final
{
public:
	struct FCompendiumButtonData                  buttonData;                                        // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreArchiveCompendiumButtonWidget_SetButtonData) == 0x000008, "Wrong alignment on CoreArchiveCompendiumButtonWidget_SetButtonData");
static_assert(sizeof(CoreArchiveCompendiumButtonWidget_SetButtonData) == 0x000070, "Wrong size on CoreArchiveCompendiumButtonWidget_SetButtonData");
static_assert(offsetof(CoreArchiveCompendiumButtonWidget_SetButtonData, buttonData) == 0x000000, "Member 'CoreArchiveCompendiumButtonWidget_SetButtonData::buttonData' has a wrong offset!");

// Function DBDUIViewsCore.CoreArchiveCompendiumButtonWidget.SetButtonVisual
// 0x0070 (0x0070 - 0x0000)
struct CoreArchiveCompendiumButtonWidget_SetButtonVisual final
{
public:
	struct FCompendiumButtonData                  buttonData;                                        // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreArchiveCompendiumButtonWidget_SetButtonVisual) == 0x000008, "Wrong alignment on CoreArchiveCompendiumButtonWidget_SetButtonVisual");
static_assert(sizeof(CoreArchiveCompendiumButtonWidget_SetButtonVisual) == 0x000070, "Wrong size on CoreArchiveCompendiumButtonWidget_SetButtonVisual");
static_assert(offsetof(CoreArchiveCompendiumButtonWidget_SetButtonVisual, buttonData) == 0x000000, "Member 'CoreArchiveCompendiumButtonWidget_SetButtonVisual::buttonData' has a wrong offset!");

// Function DBDUIViewsCore.CoreArchiveCompendiumButtonWidget.SetGhostStory
// 0x0001 (0x0001 - 0x0000)
struct CoreArchiveCompendiumButtonWidget_SetGhostStory final
{
public:
	bool                                          isGhostStory;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreArchiveCompendiumButtonWidget_SetGhostStory) == 0x000001, "Wrong alignment on CoreArchiveCompendiumButtonWidget_SetGhostStory");
static_assert(sizeof(CoreArchiveCompendiumButtonWidget_SetGhostStory) == 0x000001, "Wrong size on CoreArchiveCompendiumButtonWidget_SetGhostStory");
static_assert(offsetof(CoreArchiveCompendiumButtonWidget_SetGhostStory, isGhostStory) == 0x000000, "Member 'CoreArchiveCompendiumButtonWidget_SetGhostStory::isGhostStory' has a wrong offset!");

// Function DBDUIViewsCore.CoreArchiveCompendiumButtonWidget.SetLevelProgressionVisual
// 0x0008 (0x0008 - 0x0000)
struct CoreArchiveCompendiumButtonWidget_SetLevelProgressionVisual final
{
public:
	int32                                         buttonLevel;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EArchivesStoryLevelStatus                     levelStatus;                                       // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CoreArchiveCompendiumButtonWidget_SetLevelProgressionVisual) == 0x000004, "Wrong alignment on CoreArchiveCompendiumButtonWidget_SetLevelProgressionVisual");
static_assert(sizeof(CoreArchiveCompendiumButtonWidget_SetLevelProgressionVisual) == 0x000008, "Wrong size on CoreArchiveCompendiumButtonWidget_SetLevelProgressionVisual");
static_assert(offsetof(CoreArchiveCompendiumButtonWidget_SetLevelProgressionVisual, buttonLevel) == 0x000000, "Member 'CoreArchiveCompendiumButtonWidget_SetLevelProgressionVisual::buttonLevel' has a wrong offset!");
static_assert(offsetof(CoreArchiveCompendiumButtonWidget_SetLevelProgressionVisual, levelStatus) == 0x000004, "Member 'CoreArchiveCompendiumButtonWidget_SetLevelProgressionVisual::levelStatus' has a wrong offset!");

// Function DBDUIViewsCore.CoreTabContentWidget.StopFadeInTweening
// 0x0004 (0x0004 - 0x0000)
struct CoreTabContentWidget_StopFadeInTweening final
{
public:
	float                                         opacityValue;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreTabContentWidget_StopFadeInTweening) == 0x000004, "Wrong alignment on CoreTabContentWidget_StopFadeInTweening");
static_assert(sizeof(CoreTabContentWidget_StopFadeInTweening) == 0x000004, "Wrong size on CoreTabContentWidget_StopFadeInTweening");
static_assert(offsetof(CoreTabContentWidget_StopFadeInTweening, opacityValue) == 0x000000, "Member 'CoreTabContentWidget_StopFadeInTweening::opacityValue' has a wrong offset!");

// Function DBDUIViewsCore.CoreArchiveCompendiumWidget.CreateAndAddButtonToGrid
// 0x0010 (0x0010 - 0x0000)
struct CoreArchiveCompendiumWidget_CreateAndAddButtonToGrid final
{
public:
	int32                                         index;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCoreArchiveCompendiumButtonWidget*     ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreArchiveCompendiumWidget_CreateAndAddButtonToGrid) == 0x000008, "Wrong alignment on CoreArchiveCompendiumWidget_CreateAndAddButtonToGrid");
static_assert(sizeof(CoreArchiveCompendiumWidget_CreateAndAddButtonToGrid) == 0x000010, "Wrong size on CoreArchiveCompendiumWidget_CreateAndAddButtonToGrid");
static_assert(offsetof(CoreArchiveCompendiumWidget_CreateAndAddButtonToGrid, index) == 0x000000, "Member 'CoreArchiveCompendiumWidget_CreateAndAddButtonToGrid::index' has a wrong offset!");
static_assert(offsetof(CoreArchiveCompendiumWidget_CreateAndAddButtonToGrid, ReturnValue) == 0x000008, "Member 'CoreArchiveCompendiumWidget_CreateAndAddButtonToGrid::ReturnValue' has a wrong offset!");

// Function DBDUIViewsCore.CoreArchiveCompendiumWidget.CreateGhostStories
// 0x0004 (0x0004 - 0x0000)
struct CoreArchiveCompendiumWidget_CreateGhostStories final
{
public:
	int32                                         currentStoryNum;                                   // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreArchiveCompendiumWidget_CreateGhostStories) == 0x000004, "Wrong alignment on CoreArchiveCompendiumWidget_CreateGhostStories");
static_assert(sizeof(CoreArchiveCompendiumWidget_CreateGhostStories) == 0x000004, "Wrong size on CoreArchiveCompendiumWidget_CreateGhostStories");
static_assert(offsetof(CoreArchiveCompendiumWidget_CreateGhostStories, currentStoryNum) == 0x000000, "Member 'CoreArchiveCompendiumWidget_CreateGhostStories::currentStoryNum' has a wrong offset!");

// Function DBDUIViewsCore.CoreArchiveCompendiumWidget.OnPastStoryClicked
// 0x0008 (0x0008 - 0x0000)
struct CoreArchiveCompendiumWidget_OnPastStoryClicked final
{
public:
	class UCoreButtonWidget*                      button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreArchiveCompendiumWidget_OnPastStoryClicked) == 0x000008, "Wrong alignment on CoreArchiveCompendiumWidget_OnPastStoryClicked");
static_assert(sizeof(CoreArchiveCompendiumWidget_OnPastStoryClicked) == 0x000008, "Wrong size on CoreArchiveCompendiumWidget_OnPastStoryClicked");
static_assert(offsetof(CoreArchiveCompendiumWidget_OnPastStoryClicked, button) == 0x000000, "Member 'CoreArchiveCompendiumWidget_OnPastStoryClicked::button' has a wrong offset!");

// Function DBDUIViewsCore.CoreArchiveCompendiumWidget.SetGridSlot
// 0x0010 (0x0010 - 0x0000)
struct CoreArchiveCompendiumWidget_SetGridSlot final
{
public:
	class UGridSlot*                              gridSlot;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         index;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CoreArchiveCompendiumWidget_SetGridSlot) == 0x000008, "Wrong alignment on CoreArchiveCompendiumWidget_SetGridSlot");
static_assert(sizeof(CoreArchiveCompendiumWidget_SetGridSlot) == 0x000010, "Wrong size on CoreArchiveCompendiumWidget_SetGridSlot");
static_assert(offsetof(CoreArchiveCompendiumWidget_SetGridSlot, gridSlot) == 0x000000, "Member 'CoreArchiveCompendiumWidget_SetGridSlot::gridSlot' has a wrong offset!");
static_assert(offsetof(CoreArchiveCompendiumWidget_SetGridSlot, index) == 0x000008, "Member 'CoreArchiveCompendiumWidget_SetGridSlot::index' has a wrong offset!");

// Function DBDUIViewsCore.CoreArchiveJournalImageViewerWidget.OnVoiceOverAutoPlay
// 0x0001 (0x0001 - 0x0000)
struct CoreArchiveJournalImageViewerWidget_OnVoiceOverAutoPlay final
{
public:
	bool                                          autoplay;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreArchiveJournalImageViewerWidget_OnVoiceOverAutoPlay) == 0x000001, "Wrong alignment on CoreArchiveJournalImageViewerWidget_OnVoiceOverAutoPlay");
static_assert(sizeof(CoreArchiveJournalImageViewerWidget_OnVoiceOverAutoPlay) == 0x000001, "Wrong size on CoreArchiveJournalImageViewerWidget_OnVoiceOverAutoPlay");
static_assert(offsetof(CoreArchiveJournalImageViewerWidget_OnVoiceOverAutoPlay, autoplay) == 0x000000, "Member 'CoreArchiveJournalImageViewerWidget_OnVoiceOverAutoPlay::autoplay' has a wrong offset!");

// Function DBDUIViewsCore.CoreArchiveJournalImageViewerWidget.SetData
// 0x0078 (0x0078 - 0x0000)
struct CoreArchiveJournalImageViewerWidget_SetData final
{
public:
	struct FArchivesVignetteEntryViewData         data;                                              // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          hasTitle;                                          // 0x0070(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          hasDescription;                                    // 0x0071(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CoreArchiveJournalImageViewerWidget_SetData) == 0x000008, "Wrong alignment on CoreArchiveJournalImageViewerWidget_SetData");
static_assert(sizeof(CoreArchiveJournalImageViewerWidget_SetData) == 0x000078, "Wrong size on CoreArchiveJournalImageViewerWidget_SetData");
static_assert(offsetof(CoreArchiveJournalImageViewerWidget_SetData, data) == 0x000000, "Member 'CoreArchiveJournalImageViewerWidget_SetData::data' has a wrong offset!");
static_assert(offsetof(CoreArchiveJournalImageViewerWidget_SetData, hasTitle) == 0x000070, "Member 'CoreArchiveJournalImageViewerWidget_SetData::hasTitle' has a wrong offset!");
static_assert(offsetof(CoreArchiveJournalImageViewerWidget_SetData, hasDescription) == 0x000071, "Member 'CoreArchiveJournalImageViewerWidget_SetData::hasDescription' has a wrong offset!");

// Function DBDUIViewsCore.CoreArchiveJournalImageViewerWidget.SetScrollData
// 0x0018 (0x0018 - 0x0000)
struct CoreArchiveJournalImageViewerWidget_SetScrollData final
{
public:
	class FText                                   journalEntryScrollPromptText;                      // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreArchiveJournalImageViewerWidget_SetScrollData) == 0x000008, "Wrong alignment on CoreArchiveJournalImageViewerWidget_SetScrollData");
static_assert(sizeof(CoreArchiveJournalImageViewerWidget_SetScrollData) == 0x000018, "Wrong size on CoreArchiveJournalImageViewerWidget_SetScrollData");
static_assert(offsetof(CoreArchiveJournalImageViewerWidget_SetScrollData, journalEntryScrollPromptText) == 0x000000, "Member 'CoreArchiveJournalImageViewerWidget_SetScrollData::journalEntryScrollPromptText' has a wrong offset!");

// Function DBDUIViewsCore.CoreArchiveJournalImageViewerWidget.SetTextVisibilityInputText
// 0x0030 (0x0030 - 0x0000)
struct CoreArchiveJournalImageViewerWidget_SetTextVisibilityInputText final
{
public:
	class FText                                   displayText;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
