#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDVideoPlayer

#include "Basic.hpp"


namespace SDK::Params
{

// Function DBDVideoPlayer.VideoBinkPlayer.OnMediaOpened
// 0x0010 (0x0010 - 0x0000)
struct VideoBinkPlayer_OnMediaOpened final
{
public:
	class FString                                 openedUrl;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VideoBinkPlayer_OnMediaOpened) == 0x000008, "Wrong alignment on VideoBinkPlayer_OnMediaOpened");
static_assert(sizeof(VideoBinkPlayer_OnMediaOpened) == 0x000010, "Wrong size on VideoBinkPlayer_OnMediaOpened");
static_assert(offsetof(VideoBinkPlayer_OnMediaOpened, openedUrl) == 0x000000, "Member 'VideoBinkPlayer_OnMediaOpened::openedUrl' has a wrong offset!");

// Function DBDVideoPlayer.VideoThumbnailPlayer.OnMediaOpened
// 0x0010 (0x0010 - 0x0000)
struct VideoThumbnailPlayer_OnMediaOpened final
{
public:
	class FString                                 openedUrl;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VideoThumbnailPlayer_OnMediaOpened) == 0x000008, "Wrong alignment on VideoThumbnailPlayer_OnMediaOpened");
static_assert(sizeof(VideoThumbnailPlayer_OnMediaOpened) == 0x000010, "Wrong size on VideoThumbnailPlayer_OnMediaOpened");
static_assert(offsetof(VideoThumbnailPlayer_OnMediaOpened, openedUrl) == 0x000000, "Member 'VideoThumbnailPlayer_OnMediaOpened::openedUrl' has a wrong offset!");

}

