#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDVideoPlayer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "DataTableUtilities_structs.hpp"


namespace SDK
{

// ScriptStruct DBDVideoPlayer.VideoThumbnailProperties
// 0x0048 (0x0050 - 0x0008)
struct FVideoThumbnailProperties final : public FDBDTableRowBase
{
public:
	class FName                                   _id;                                               // 0x0008(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _hasAudio;                                         // 0x0014(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              _size;                                             // 0x0018(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMediaSource>            _source;                                           // 0x0020(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FVideoThumbnailProperties) == 0x000008, "Wrong alignment on FVideoThumbnailProperties");
static_assert(sizeof(FVideoThumbnailProperties) == 0x000050, "Wrong size on FVideoThumbnailProperties");
static_assert(offsetof(FVideoThumbnailProperties, _id) == 0x000008, "Member 'FVideoThumbnailProperties::_id' has a wrong offset!");
static_assert(offsetof(FVideoThumbnailProperties, _hasAudio) == 0x000014, "Member 'FVideoThumbnailProperties::_hasAudio' has a wrong offset!");
static_assert(offsetof(FVideoThumbnailProperties, _size) == 0x000018, "Member 'FVideoThumbnailProperties::_size' has a wrong offset!");
static_assert(offsetof(FVideoThumbnailProperties, _source) == 0x000020, "Member 'FVideoThumbnailProperties::_source' has a wrong offset!");

}

