#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FXWidget

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "FXWidget_structs.hpp"


namespace SDK
{

// Class FXWidget.FXUserWidgetBase
// 0x0060 (0x02F8 - 0x0298)
class UFXUserWidgetBase final : public UUserWidget
{
public:
	class UNiagaraSystem*                         niagaraSystem;                                     // 0x0298(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isFillingWidget;                                   // 0x02A0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A1[0x17];                                     // 0x02A1(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFXWidgetPlayer                        _particlePlayer;                                   // 0x02B8(0x0010)(Transient, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C8[0x30];                                     // 0x02C8(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UNiagaraComponent* GetNiagaraFX();

	void PlayParticle(float startAtTime, int32 numLoopsToPlay) const;
	void StopParticle() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FXUserWidgetBase">();
	}
	static class UFXUserWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFXUserWidgetBase>();
	}
};
static_assert(alignof(UFXUserWidgetBase) == 0x000008, "Wrong alignment on UFXUserWidgetBase");
static_assert(sizeof(UFXUserWidgetBase) == 0x0002F8, "Wrong size on UFXUserWidgetBase");
static_assert(offsetof(UFXUserWidgetBase, niagaraSystem) == 0x000298, "Member 'UFXUserWidgetBase::niagaraSystem' has a wrong offset!");
static_assert(offsetof(UFXUserWidgetBase, isFillingWidget) == 0x0002A0, "Member 'UFXUserWidgetBase::isFillingWidget' has a wrong offset!");
static_assert(offsetof(UFXUserWidgetBase, _particlePlayer) == 0x0002B8, "Member 'UFXUserWidgetBase::_particlePlayer' has a wrong offset!");

}

