#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayTagUtilities

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct GameplayTagUtilities.QueryInstanceCollection
// 0x0010 (0x0010 - 0x0000)
struct FQueryInstanceCollection final
{
public:
	TArray<class UTagContainerQueryInstance*>     Instances;                                         // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FQueryInstanceCollection) == 0x000008, "Wrong alignment on FQueryInstanceCollection");
static_assert(sizeof(FQueryInstanceCollection) == 0x000010, "Wrong size on FQueryInstanceCollection");
static_assert(offsetof(FQueryInstanceCollection, Instances) == 0x000000, "Member 'FQueryInstanceCollection::Instances' has a wrong offset!");

// ScriptStruct GameplayTagUtilities.TagStateBool
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) FTagStateBool final
{
public:
	bool                                          _isTrue;                                           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1[0x2F];                                       // 0x0001(0x002F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTagStateBool) == 0x000008, "Wrong alignment on FTagStateBool");
static_assert(sizeof(FTagStateBool) == 0x000030, "Wrong size on FTagStateBool");
static_assert(offsetof(FTagStateBool, _isTrue) == 0x000000, "Member 'FTagStateBool::_isTrue' has a wrong offset!");

}

