#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Gnome2021

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "DataTableUtilities_structs.hpp"
#include "SpecialEventUtilities_classes.hpp"
#include "DeadByDaylight_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class Gnome2021.Gnome
// 0x00A0 (0x03F0 - 0x0350)
class AGnome final : public ARespawnableInteractable
{
public:
	class UGnomeInteraction*                      _gnomeInteraction;                                 // 0x0350(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGnomeInteraction*                      _gnomeInteractionKiller;                           // 0x0358(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChargeableComponent*                   _gnomeInteractionChargeable;                       // 0x0360(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChargeableComponent*                   _gnomeInteractionChargeableKiller;                 // 0x0368(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInteractor*                            _gnomeInteractor;                                  // 0x0370(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPrimitiveComponent*                    _gnomeInteractionZone;                             // 0x0378(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDBDOutlineComponent*                   _outlineComponent;                                 // 0x0380(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkeletalMeshComponent*                 _gnomeSkeletalMesh;                                // 0x0388(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _gnomeInteractionSecondsToCharge;                  // 0x0390(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _gnomeInteractionSecondsToChargeKiller;            // 0x03B8(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           _auraColorWhileInteracting;                        // 0x03E0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Cosmetic_OnInteractionCompleted(class ADBDPlayer* interactingPlayer);
	void Cosmetic_OnStartedInteracting(class ADBDPlayer* interactingPlayer, float interactionDuration);
	void Cosmetic_OnStoppedInteracting();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Gnome">();
	}
	static class AGnome* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGnome>();
	}
};
static_assert(alignof(AGnome) == 0x000008, "Wrong alignment on AGnome");
static_assert(sizeof(AGnome) == 0x0003F0, "Wrong size on AGnome");
static_assert(offsetof(AGnome, _gnomeInteraction) == 0x000350, "Member 'AGnome::_gnomeInteraction' has a wrong offset!");
static_assert(offsetof(AGnome, _gnomeInteractionKiller) == 0x000358, "Member 'AGnome::_gnomeInteractionKiller' has a wrong offset!");
static_assert(offsetof(AGnome, _gnomeInteractionChargeable) == 0x000360, "Member 'AGnome::_gnomeInteractionChargeable' has a wrong offset!");
static_assert(offsetof(AGnome, _gnomeInteractionChargeableKiller) == 0x000368, "Member 'AGnome::_gnomeInteractionChargeableKiller' has a wrong offset!");
static_assert(offsetof(AGnome, _gnomeInteractor) == 0x000370, "Member 'AGnome::_gnomeInteractor' has a wrong offset!");
static_assert(offsetof(AGnome, _gnomeInteractionZone) == 0x000378, "Member 'AGnome::_gnomeInteractionZone' has a wrong offset!");
static_assert(offsetof(AGnome, _outlineComponent) == 0x000380, "Member 'AGnome::_outlineComponent' has a wrong offset!");
static_assert(offsetof(AGnome, _gnomeSkeletalMesh) == 0x000388, "Member 'AGnome::_gnomeSkeletalMesh' has a wrong offset!");
static_assert(offsetof(AGnome, _gnomeInteractionSecondsToCharge) == 0x000390, "Member 'AGnome::_gnomeInteractionSecondsToCharge' has a wrong offset!");
static_assert(offsetof(AGnome, _gnomeInteractionSecondsToChargeKiller) == 0x0003B8, "Member 'AGnome::_gnomeInteractionSecondsToChargeKiller' has a wrong offset!");
static_assert(offsetof(AGnome, _auraColorWhileInteracting) == 0x0003E0, "Member 'AGnome::_auraColorWhileInteracting' has a wrong offset!");

// Class Gnome2021.GnomeEventComponent
// 0x0028 (0x00F0 - 0x00C8)
class UGnomeEventComponent final : public URespawningEventComponent
{
public:
	class UInteractionRespawnableTrigger*         _interactionRespawnableTrigger;                    // 0x00C8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTimedRespawnableTrigger*               _timedRespawnableTrigger;                          // 0x00D0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D8[0x18];                                      // 0x00D8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnEndGameStarted(const struct FGameplayTag& gameEventType, const struct FGameEventData& gameEventData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GnomeEventComponent">();
	}
	static class UGnomeEventComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGnomeEventComponent>();
	}
};
static_assert(alignof(UGnomeEventComponent) == 0x000008, "Wrong alignment on UGnomeEventComponent");
static_assert(sizeof(UGnomeEventComponent) == 0x0000F0, "Wrong size on UGnomeEventComponent");
static_assert(offsetof(UGnomeEventComponent, _interactionRespawnableTrigger) == 0x0000C8, "Member 'UGnomeEventComponent::_interactionRespawnableTrigger' has a wrong offset!");
static_assert(offsetof(UGnomeEventComponent, _timedRespawnableTrigger) == 0x0000D0, "Member 'UGnomeEventComponent::_timedRespawnableTrigger' has a wrong offset!");

// Class Gnome2021.GnomeInteraction
// 0x0020 (0x0760 - 0x0740)
class UGnomeInteraction final : public UChargeableInteractionDefinition
{
public:
	uint8                                         Pad_740[0x20];                                     // 0x0740(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GnomeInteraction">();
	}
	static class UGnomeInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGnomeInteraction>();
	}
};
static_assert(alignof(UGnomeInteraction) == 0x000010, "Wrong alignment on UGnomeInteraction");
static_assert(sizeof(UGnomeInteraction) == 0x000760, "Wrong size on UGnomeInteraction");

// Class Gnome2021.GnomePlayerComponent
// 0x0028 (0x00E0 - 0x00B8)
class UGnomePlayerComponent final : public UActorComponent
{
public:
	bool                                          _hasInteractedWithGnomeThisGame;                   // 0x00B8(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B9[0x27];                                      // 0x00B9(0x0027)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GnomePlayerComponent">();
	}
	static class UGnomePlayerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGnomePlayerComponent>();
	}
};
static_assert(alignof(UGnomePlayerComponent) == 0x000008, "Wrong alignment on UGnomePlayerComponent");
static_assert(sizeof(UGnomePlayerComponent) == 0x0000E0, "Wrong size on UGnomePlayerComponent");
static_assert(offsetof(UGnomePlayerComponent, _hasInteractedWithGnomeThisGame) == 0x0000B8, "Member 'UGnomePlayerComponent::_hasInteractedWithGnomeThisGame' has a wrong offset!");

}

