#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Halloween2021

#include "Basic.hpp"

#include "DeadByDaylight_classes.hpp"
#include "Halloween2021_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DataTableUtilities_structs.hpp"


namespace SDK
{

// Class Halloween2021.Pumpkin
// 0x01C0 (0x0528 - 0x0368)
class APumpkin final : public ASpecialBehaviourInteractable
{
public:
	uint8                                         Pad_368[0x18];                                     // 0x0368(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   _specialBehaviourId;                               // 0x0380(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EPumpkinType                                  _pumpkinType;                                      // 0x038C(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPumpkinInteraction*                    _pumpkinInteraction;                               // 0x0390(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPumpkinInteraction*                    _pumpkinInteractionKiller;                         // 0x0398(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChargeableComponent*                   _pumpkinInteractionChargeable;                     // 0x03A0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChargeableComponent*                   _pumpkinInteractionChargeableKiller;               // 0x03A8(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInteractor*                            _pumpkinInteractor;                                // 0x03B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPrimitiveComponent*                    _pumpkinInteractionZone;                           // 0x03B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _pumpkinInteractionSecondsToCharge;                // 0x03C0(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _pumpkinInteractionSecondsToChargeKiller;          // 0x03E8(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           _auraColorWhileInteracting;                        // 0x0410(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _pumpkinTreatChance;                               // 0x0420(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _pumpkinTrickChance;                               // 0x0448(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _pumpkinTreatDuration;                             // 0x0470(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _pumpkinTrickDuration;                             // 0x0498(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _pumpkinSpeedBoost;                                // 0x04C0(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _pumpkinSpeedDebuff;                               // 0x04E8(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _pumpkinTreatEffect;                               // 0x0510(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _pumpkinTrickEffect;                               // 0x0518(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStatusEffect*                          _pumpkinStatusEffect;                              // 0x0520(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Cosmetic_OnInteractionCompleted(class ADBDPlayer* interactingPlayer);
	void Cosmetic_OnIntroCompleted();
	void Cosmetic_OnStartedInteracting(class ADBDPlayer* interactingPlayer, float interactionDuration);
	void Cosmetic_OnStoppedInteracting();
	void OnInteractionCompleted(class ADBDPlayer* interactingPlayer);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Pumpkin">();
	}
	static class APumpkin* GetDefaultObj()
	{
		return GetDefaultObjImpl<APumpkin>();
	}
};
static_assert(alignof(APumpkin) == 0x000008, "Wrong alignment on APumpkin");
static_assert(sizeof(APumpkin) == 0x000528, "Wrong size on APumpkin");
static_assert(offsetof(APumpkin, _specialBehaviourId) == 0x000380, "Member 'APumpkin::_specialBehaviourId' has a wrong offset!");
static_assert(offsetof(APumpkin, _pumpkinType) == 0x00038C, "Member 'APumpkin::_pumpkinType' has a wrong offset!");
static_assert(offsetof(APumpkin, _pumpkinInteraction) == 0x000390, "Member 'APumpkin::_pumpkinInteraction' has a wrong offset!");
static_assert(offsetof(APumpkin, _pumpkinInteractionKiller) == 0x000398, "Member 'APumpkin::_pumpkinInteractionKiller' has a wrong offset!");
static_assert(offsetof(APumpkin, _pumpkinInteractionChargeable) == 0x0003A0, "Member 'APumpkin::_pumpkinInteractionChargeable' has a wrong offset!");
static_assert(offsetof(APumpkin, _pumpkinInteractionChargeableKiller) == 0x0003A8, "Member 'APumpkin::_pumpkinInteractionChargeableKiller' has a wrong offset!");
static_assert(offsetof(APumpkin, _pumpkinInteractor) == 0x0003B0, "Member 'APumpkin::_pumpkinInteractor' has a wrong offset!");
static_assert(offsetof(APumpkin, _pumpkinInteractionZone) == 0x0003B8, "Member 'APumpkin::_pumpkinInteractionZone' has a wrong offset!");
static_assert(offsetof(APumpkin, _pumpkinInteractionSecondsToCharge) == 0x0003C0, "Member 'APumpkin::_pumpkinInteractionSecondsToCharge' has a wrong offset!");
static_assert(offsetof(APumpkin, _pumpkinInteractionSecondsToChargeKiller) == 0x0003E8, "Member 'APumpkin::_pumpkinInteractionSecondsToChargeKiller' has a wrong offset!");
static_assert(offsetof(APumpkin, _auraColorWhileInteracting) == 0x000410, "Member 'APumpkin::_auraColorWhileInteracting' has a wrong offset!");
static_assert(offsetof(APumpkin, _pumpkinTreatChance) == 0x000420, "Member 'APumpkin::_pumpkinTreatChance' has a wrong offset!");
static_assert(offsetof(APumpkin, _pumpkinTrickChance) == 0x000448, "Member 'APumpkin::_pumpkinTrickChance' has a wrong offset!");
static_assert(offsetof(APumpkin, _pumpkinTreatDuration) == 0x000470, "Member 'APumpkin::_pumpkinTreatDuration' has a wrong offset!");
static_assert(offsetof(APumpkin, _pumpkinTrickDuration) == 0x000498, "Member 'APumpkin::_pumpkinTrickDuration' has a wrong offset!");
static_assert(offsetof(APumpkin, _pumpkinSpeedBoost) == 0x0004C0, "Member 'APumpkin::_pumpkinSpeedBoost' has a wrong offset!");
static_assert(offsetof(APumpkin, _pumpkinSpeedDebuff) == 0x0004E8, "Member 'APumpkin::_pumpkinSpeedDebuff' has a wrong offset!");
static_assert(offsetof(APumpkin, _pumpkinTreatEffect) == 0x000510, "Member 'APumpkin::_pumpkinTreatEffect' has a wrong offset!");
static_assert(offsetof(APumpkin, _pumpkinTrickEffect) == 0x000518, "Member 'APumpkin::_pumpkinTrickEffect' has a wrong offset!");
static_assert(offsetof(APumpkin, _pumpkinStatusEffect) == 0x000520, "Member 'APumpkin::_pumpkinStatusEffect' has a wrong offset!");

// Class Halloween2021.PumpkinInteraction
// 0x0040 (0x0780 - 0x0740)
class UPumpkinInteraction final : public UChargeableInteractionDefinition
{
public:
	uint8                                         Pad_740[0x40];                                     // 0x0740(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PumpkinInteraction">();
	}
	static class UPumpkinInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPumpkinInteraction>();
	}
};
static_assert(alignof(UPumpkinInteraction) == 0x000010, "Wrong alignment on UPumpkinInteraction");
static_assert(sizeof(UPumpkinInteraction) == 0x000780, "Wrong size on UPumpkinInteraction");

}

