#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InputUtilities

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct InputUtilities.ButtonSequenceData
// 0x0040 (0x0048 - 0x0008)
struct FButtonSequenceData final : public FTableRowBase
{
public:
	class FName                                   SequenceId;                                        // 0x0008(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           Sequence;                                          // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         Timeout;                                           // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Platforms;                                         // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         MinKeysForFailedAttempt;                           // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FButtonSequenceData) == 0x000008, "Wrong alignment on FButtonSequenceData");
static_assert(sizeof(FButtonSequenceData) == 0x000048, "Wrong size on FButtonSequenceData");
static_assert(offsetof(FButtonSequenceData, SequenceId) == 0x000008, "Member 'FButtonSequenceData::SequenceId' has a wrong offset!");
static_assert(offsetof(FButtonSequenceData, Sequence) == 0x000018, "Member 'FButtonSequenceData::Sequence' has a wrong offset!");
static_assert(offsetof(FButtonSequenceData, Timeout) == 0x000028, "Member 'FButtonSequenceData::Timeout' has a wrong offset!");
static_assert(offsetof(FButtonSequenceData, Platforms) == 0x000030, "Member 'FButtonSequenceData::Platforms' has a wrong offset!");
static_assert(offsetof(FButtonSequenceData, MinKeysForFailedAttempt) == 0x000040, "Member 'FButtonSequenceData::MinKeysForFailedAttempt' has a wrong offset!");

}

