#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelGenerator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DeadByDaylight_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LevelGenerator.LevelGenerator_C
// 0x0018 (0x1028 - 0x1010)
class ALevelGenerator_C final : public AProceduralLevelBuilder
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1010(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x1018(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         initialMistDensity;                                // 0x1020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LevelGenerator(int32 EntryPoint);
	void ApplyMist(float modifier);
	void RemoveMist();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LevelGenerator_C">();
	}
	static class ALevelGenerator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALevelGenerator_C>();
	}
};
static_assert(alignof(ALevelGenerator_C) == 0x000008, "Wrong alignment on ALevelGenerator_C");
static_assert(sizeof(ALevelGenerator_C) == 0x001028, "Wrong size on ALevelGenerator_C");
static_assert(offsetof(ALevelGenerator_C, UberGraphFrame) == 0x001010, "Member 'ALevelGenerator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALevelGenerator_C, DefaultSceneRoot) == 0x001018, "Member 'ALevelGenerator_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ALevelGenerator_C, initialMistDensity) == 0x001020, "Member 'ALevelGenerator_C::initialMistDensity' has a wrong offset!");

}

