#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PhysicsUtilities

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class PhysicsUtilities.DynamicCapsuleResizerComponent
// 0x0038 (0x00F0 - 0x00B8)
class UDynamicCapsuleResizerComponent final : public UActorComponent
{
public:
	class UCapsuleComponent*                      _capsule;                                          // 0x00B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C0[0x14];                                      // 0x00C0(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _shrinkPercent;                                    // 0x00D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _shrinkDuration;                                   // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _expandDuration;                                   // 0x00DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _stayShrunkenDuration;                             // 0x00E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _expandOverlapTestMinDeltaTime;                    // 0x00E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _isShrinkingEnabled;                               // 0x00E8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _isShrinkingAlwaysEnabled;                         // 0x00E9(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnHit(class UPrimitiveComponent* hitComponent, class AActor* otherActor, class UPrimitiveComponent* otherComp, const struct FVector& normalImpulse, const struct FHitResult& hit);
	void OnRep_IsShrinkingAlwaysEnabled();
	void SetShrinkingEnabled(bool enabled);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicCapsuleResizerComponent">();
	}
	static class UDynamicCapsuleResizerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicCapsuleResizerComponent>();
	}
};
static_assert(alignof(UDynamicCapsuleResizerComponent) == 0x000008, "Wrong alignment on UDynamicCapsuleResizerComponent");
static_assert(sizeof(UDynamicCapsuleResizerComponent) == 0x0000F0, "Wrong size on UDynamicCapsuleResizerComponent");
static_assert(offsetof(UDynamicCapsuleResizerComponent, _capsule) == 0x0000B8, "Member 'UDynamicCapsuleResizerComponent::_capsule' has a wrong offset!");
static_assert(offsetof(UDynamicCapsuleResizerComponent, _shrinkPercent) == 0x0000D4, "Member 'UDynamicCapsuleResizerComponent::_shrinkPercent' has a wrong offset!");
static_assert(offsetof(UDynamicCapsuleResizerComponent, _shrinkDuration) == 0x0000D8, "Member 'UDynamicCapsuleResizerComponent::_shrinkDuration' has a wrong offset!");
static_assert(offsetof(UDynamicCapsuleResizerComponent, _expandDuration) == 0x0000DC, "Member 'UDynamicCapsuleResizerComponent::_expandDuration' has a wrong offset!");
static_assert(offsetof(UDynamicCapsuleResizerComponent, _stayShrunkenDuration) == 0x0000E0, "Member 'UDynamicCapsuleResizerComponent::_stayShrunkenDuration' has a wrong offset!");
static_assert(offsetof(UDynamicCapsuleResizerComponent, _expandOverlapTestMinDeltaTime) == 0x0000E4, "Member 'UDynamicCapsuleResizerComponent::_expandOverlapTestMinDeltaTime' has a wrong offset!");
static_assert(offsetof(UDynamicCapsuleResizerComponent, _isShrinkingEnabled) == 0x0000E8, "Member 'UDynamicCapsuleResizerComponent::_isShrinkingEnabled' has a wrong offset!");
static_assert(offsetof(UDynamicCapsuleResizerComponent, _isShrinkingAlwaysEnabled) == 0x0000E9, "Member 'UDynamicCapsuleResizerComponent::_isShrinkingAlwaysEnabled' has a wrong offset!");

// Class PhysicsUtilities.PrimitiveCollection
// 0x0050 (0x0080 - 0x0030)
class UPrimitiveCollection final : public UObject
{
public:
	TSet<TWeakObjectPtr<class UPrimitiveComponent>> _primitives;                                     // 0x0030(0x0050)(ExportObject, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	void Add(class UPrimitiveComponent* primitive);
	void Remove(class UPrimitiveComponent* primitive);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PrimitiveCollection">();
	}
	static class UPrimitiveCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrimitiveCollection>();
	}
};
static_assert(alignof(UPrimitiveCollection) == 0x000008, "Wrong alignment on UPrimitiveCollection");
static_assert(sizeof(UPrimitiveCollection) == 0x000080, "Wrong size on UPrimitiveCollection");
static_assert(offsetof(UPrimitiveCollection, _primitives) == 0x000030, "Member 'UPrimitiveCollection::_primitives' has a wrong offset!");

// Class PhysicsUtilities.PrimitivesRegistererComponent
// 0x0018 (0x00D0 - 0x00B8)
class UPrimitivesRegistererComponent final : public UActorComponent
{
public:
	TArray<class UPrimitiveComponent*>            _primitives;                                       // 0x00B8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UPrimitiveCollection>    _primitiveCollection;                              // 0x00C8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetPrimitives(const TArray<class UPrimitiveComponent*>& primitives);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PrimitivesRegistererComponent">();
	}
	static class UPrimitivesRegistererComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrimitivesRegistererComponent>();
	}
};
static_assert(alignof(UPrimitivesRegistererComponent) == 0x000008, "Wrong alignment on UPrimitivesRegistererComponent");
static_assert(sizeof(UPrimitivesRegistererComponent) == 0x0000D0, "Wrong size on UPrimitivesRegistererComponent");
static_assert(offsetof(UPrimitivesRegistererComponent, _primitives) == 0x0000B8, "Member 'UPrimitivesRegistererComponent::_primitives' has a wrong offset!");
static_assert(offsetof(UPrimitivesRegistererComponent, _primitiveCollection) == 0x0000C8, "Member 'UPrimitivesRegistererComponent::_primitiveCollection' has a wrong offset!");

}

