#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RemoteSession

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "MediaIOCore_classes.hpp"


namespace SDK
{

// Class RemoteSession.RemoteSessionMediaOutput
// 0x0010 (0x0048 - 0x0038)
class URemoteSessionMediaOutput final : public UMediaOutput
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RemoteSessionMediaOutput">();
	}
	static class URemoteSessionMediaOutput* GetDefaultObj()
	{
		return GetDefaultObjImpl<URemoteSessionMediaOutput>();
	}
};
static_assert(alignof(URemoteSessionMediaOutput) == 0x000008, "Wrong alignment on URemoteSessionMediaOutput");
static_assert(sizeof(URemoteSessionMediaOutput) == 0x000048, "Wrong size on URemoteSessionMediaOutput");

// Class RemoteSession.RemoteSessionMediaCapture
// 0x0010 (0x0120 - 0x0110)
class URemoteSessionMediaCapture final : public UMediaCapture
{
public:
	uint8                                         Pad_110[0x10];                                     // 0x0110(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RemoteSessionMediaCapture">();
	}
	static class URemoteSessionMediaCapture* GetDefaultObj()
	{
		return GetDefaultObjImpl<URemoteSessionMediaCapture>();
	}
};
static_assert(alignof(URemoteSessionMediaCapture) == 0x000008, "Wrong alignment on URemoteSessionMediaCapture");
static_assert(sizeof(URemoteSessionMediaCapture) == 0x000120, "Wrong size on URemoteSessionMediaCapture");

// Class RemoteSession.RemoteSessionSettings
// 0x0040 (0x0070 - 0x0030)
class URemoteSessionSettings final : public UObject
{
public:
	int32                                         HostPort;                                          // 0x0030(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ConnectionTimeout;                                 // 0x0034(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ConnectionTimeoutWhenDebugging;                    // 0x0038(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PingTime;                                          // 0x003C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowInShipping;                                  // 0x0040(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoHostWithPIE;                                  // 0x0041(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoHostWithGame;                                 // 0x0042(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ImageQuality;                                      // 0x0044(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FrameRate;                                         // 0x0048(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         WhitelistedChannels;                               // 0x0050(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         BlacklistedChannels;                               // 0x0060(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RemoteSessionSettings">();
	}
	static class URemoteSessionSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<URemoteSessionSettings>();
	}
};
static_assert(alignof(URemoteSessionSettings) == 0x000008, "Wrong alignment on URemoteSessionSettings");
static_assert(sizeof(URemoteSessionSettings) == 0x000070, "Wrong size on URemoteSessionSettings");
static_assert(offsetof(URemoteSessionSettings, HostPort) == 0x000030, "Member 'URemoteSessionSettings::HostPort' has a wrong offset!");
static_assert(offsetof(URemoteSessionSettings, ConnectionTimeout) == 0x000034, "Member 'URemoteSessionSettings::ConnectionTimeout' has a wrong offset!");
static_assert(offsetof(URemoteSessionSettings, ConnectionTimeoutWhenDebugging) == 0x000038, "Member 'URemoteSessionSettings::ConnectionTimeoutWhenDebugging' has a wrong offset!");
static_assert(offsetof(URemoteSessionSettings, PingTime) == 0x00003C, "Member 'URemoteSessionSettings::PingTime' has a wrong offset!");
static_assert(offsetof(URemoteSessionSettings, bAllowInShipping) == 0x000040, "Member 'URemoteSessionSettings::bAllowInShipping' has a wrong offset!");
static_assert(offsetof(URemoteSessionSettings, bAutoHostWithPIE) == 0x000041, "Member 'URemoteSessionSettings::bAutoHostWithPIE' has a wrong offset!");
static_assert(offsetof(URemoteSessionSettings, bAutoHostWithGame) == 0x000042, "Member 'URemoteSessionSettings::bAutoHostWithGame' has a wrong offset!");
static_assert(offsetof(URemoteSessionSettings, ImageQuality) == 0x000044, "Member 'URemoteSessionSettings::ImageQuality' has a wrong offset!");
static_assert(offsetof(URemoteSessionSettings, FrameRate) == 0x000048, "Member 'URemoteSessionSettings::FrameRate' has a wrong offset!");
static_assert(offsetof(URemoteSessionSettings, WhitelistedChannels) == 0x000050, "Member 'URemoteSessionSettings::WhitelistedChannels' has a wrong offset!");
static_assert(offsetof(URemoteSessionSettings, BlacklistedChannels) == 0x000060, "Member 'URemoteSessionSettings::BlacklistedChannels' has a wrong offset!");

}

