#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SnowmanWinterEvent

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "SnowmanWinterEvent_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SnowmanWinterEvent.HideInSnowmanInteraction.Multicast_StartControllingSnowman
// 0x0008 (0x0008 - 0x0000)
struct HideInSnowmanInteraction_Multicast_StartControllingSnowman final
{
public:
	class ADBDPlayer*                             player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HideInSnowmanInteraction_Multicast_StartControllingSnowman) == 0x000008, "Wrong alignment on HideInSnowmanInteraction_Multicast_StartControllingSnowman");
static_assert(sizeof(HideInSnowmanInteraction_Multicast_StartControllingSnowman) == 0x000008, "Wrong size on HideInSnowmanInteraction_Multicast_StartControllingSnowman");
static_assert(offsetof(HideInSnowmanInteraction_Multicast_StartControllingSnowman, player) == 0x000000, "Member 'HideInSnowmanInteraction_Multicast_StartControllingSnowman::player' has a wrong offset!");

// Function SnowmanWinterEvent.HideInSnowmanInteraction.Multicast_StopControllingSnowman
// 0x0008 (0x0008 - 0x0000)
struct HideInSnowmanInteraction_Multicast_StopControllingSnowman final
{
public:
	class ADBDPlayer*                             player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HideInSnowmanInteraction_Multicast_StopControllingSnowman) == 0x000008, "Wrong alignment on HideInSnowmanInteraction_Multicast_StopControllingSnowman");
static_assert(sizeof(HideInSnowmanInteraction_Multicast_StopControllingSnowman) == 0x000008, "Wrong size on HideInSnowmanInteraction_Multicast_StopControllingSnowman");
static_assert(offsetof(HideInSnowmanInteraction_Multicast_StopControllingSnowman, player) == 0x000000, "Member 'HideInSnowmanInteraction_Multicast_StopControllingSnowman::player' has a wrong offset!");

// Function SnowmanWinterEvent.Snowman.Authority_OnSnowmanHandOverlapBegin
// 0x00B0 (0x00B0 - 0x0000)
struct Snowman_Authority_OnSnowmanHandOverlapBegin final
{
public:
	class UPrimitiveComponent*                    hitComponent;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 otherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    otherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         otherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             sweepResult;                                       // 0x0020(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(Snowman_Authority_OnSnowmanHandOverlapBegin) == 0x000008, "Wrong alignment on Snowman_Authority_OnSnowmanHandOverlapBegin");
static_assert(sizeof(Snowman_Authority_OnSnowmanHandOverlapBegin) == 0x0000B0, "Wrong size on Snowman_Authority_OnSnowmanHandOverlapBegin");
static_assert(offsetof(Snowman_Authority_OnSnowmanHandOverlapBegin, hitComponent) == 0x000000, "Member 'Snowman_Authority_OnSnowmanHandOverlapBegin::hitComponent' has a wrong offset!");
static_assert(offsetof(Snowman_Authority_OnSnowmanHandOverlapBegin, otherActor) == 0x000008, "Member 'Snowman_Authority_OnSnowmanHandOverlapBegin::otherActor' has a wrong offset!");
static_assert(offsetof(Snowman_Authority_OnSnowmanHandOverlapBegin, otherComp) == 0x000010, "Member 'Snowman_Authority_OnSnowmanHandOverlapBegin::otherComp' has a wrong offset!");
static_assert(offsetof(Snowman_Authority_OnSnowmanHandOverlapBegin, otherBodyIndex) == 0x000018, "Member 'Snowman_Authority_OnSnowmanHandOverlapBegin::otherBodyIndex' has a wrong offset!");
static_assert(offsetof(Snowman_Authority_OnSnowmanHandOverlapBegin, bFromSweep) == 0x00001C, "Member 'Snowman_Authority_OnSnowmanHandOverlapBegin::bFromSweep' has a wrong offset!");
static_assert(offsetof(Snowman_Authority_OnSnowmanHandOverlapBegin, sweepResult) == 0x000020, "Member 'Snowman_Authority_OnSnowmanHandOverlapBegin::sweepResult' has a wrong offset!");

// Function SnowmanWinterEvent.Snowman.Authority_OnSnowmanHandOverlapEnd
// 0x0020 (0x0020 - 0x0000)
struct Snowman_Authority_OnSnowmanHandOverlapEnd final
{
public:
	class UPrimitiveComponent*                    hitComponent;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 otherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    otherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         otherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Snowman_Authority_OnSnowmanHandOverlapEnd) == 0x000008, "Wrong alignment on Snowman_Authority_OnSnowmanHandOverlapEnd");
static_assert(sizeof(Snowman_Authority_OnSnowmanHandOverlapEnd) == 0x000020, "Wrong size on Snowman_Authority_OnSnowmanHandOverlapEnd");
static_assert(offsetof(Snowman_Authority_OnSnowmanHandOverlapEnd, hitComponent) == 0x000000, "Member 'Snowman_Authority_OnSnowmanHandOverlapEnd::hitComponent' has a wrong offset!");
static_assert(offsetof(Snowman_Authority_OnSnowmanHandOverlapEnd, otherActor) == 0x000008, "Member 'Snowman_Authority_OnSnowmanHandOverlapEnd::otherActor' has a wrong offset!");
static_assert(offsetof(Snowman_Authority_OnSnowmanHandOverlapEnd, otherComp) == 0x000010, "Member 'Snowman_Authority_OnSnowmanHandOverlapEnd::otherComp' has a wrong offset!");
static_assert(offsetof(Snowman_Authority_OnSnowmanHandOverlapEnd, otherBodyIndex) == 0x000018, "Member 'Snowman_Authority_OnSnowmanHandOverlapEnd::otherBodyIndex' has a wrong offset!");

// Function SnowmanWinterEvent.Snowman.Cosmetic_OnCosmeticUnlockRequirementsSatisfiedForKiller
// 0x0008 (0x0008 - 0x0000)
struct Snowman_Cosmetic_OnCosmeticUnlockRequirementsSatisfiedForKiller final
{
public:
	class ASlasherPlayer*                         killerAttackingSnowman;                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Snowman_Cosmetic_OnCosmeticUnlockRequirementsSatisfiedForKiller) == 0x000008, "Wrong alignment on Snowman_Cosmetic_OnCosmeticUnlockRequirementsSatisfiedForKiller");
static_assert(sizeof(Snowman_Cosmetic_OnCosmeticUnlockRequirementsSatisfiedForKiller) == 0x000008, "Wrong size on Snowman_Cosmetic_OnCosmeticUnlockRequirementsSatisfiedForKiller");
static_assert(offsetof(Snowman_Cosmetic_OnCosmeticUnlockRequirementsSatisfiedForKiller, killerAttackingSnowman) == 0x000000, "Member 'Snowman_Cosmetic_OnCosmeticUnlockRequirementsSatisfiedForKiller::killerAttackingSnowman' has a wrong offset!");

// Function SnowmanWinterEvent.Snowman.Cosmetic_OnCosmeticUnlockRequirementsSatisfiedForSurvivor
// 0x0008 (0x0008 - 0x0000)
struct Snowman_Cosmetic_OnCosmeticUnlockRequirementsSatisfiedForSurvivor final
{
public:
	class ACamperPlayer*                          survivorUsingSnowman;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Snowman_Cosmetic_OnCosmeticUnlockRequirementsSatisfiedForSurvivor) == 0x000008, "Wrong alignment on Snowman_Cosmetic_OnCosmeticUnlockRequirementsSatisfiedForSurvivor");
static_assert(sizeof(Snowman_Cosmetic_OnCosmeticUnlockRequirementsSatisfiedForSurvivor) == 0x000008, "Wrong size on Snowman_Cosmetic_OnCosmeticUnlockRequirementsSatisfiedForSurvivor");
static_assert(offsetof(Snowman_Cosmetic_OnCosmeticUnlockRequirementsSatisfiedForSurvivor, survivorUsingSnowman) == 0x000000, "Member 'Snowman_Cosmetic_OnCosmeticUnlockRequirementsSatisfiedForSurvivor::survivorUsingSnowman' has a wrong offset!");

// Function SnowmanWinterEvent.Snowman.Cosmetic_OnSnowmanDestroyedByAttackWhileControlled
// 0x0010 (0x0010 - 0x0000)
struct Snowman_Cosmetic_OnSnowmanDestroyedByAttackWhileControlled final
{
public:
	class ACamperPlayer*                          survivorUsingSnowman;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASlasherPlayer*                         killerAttackingSnowman;                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Snowman_Cosmetic_OnSnowmanDestroyedByAttackWhileControlled) == 0x000008, "Wrong alignment on Snowman_Cosmetic_OnSnowmanDestroyedByAttackWhileControlled");
static_assert(sizeof(Snowman_Cosmetic_OnSnowmanDestroyedByAttackWhileControlled) == 0x000010, "Wrong size on Snowman_Cosmetic_OnSnowmanDestroyedByAttackWhileControlled");
static_assert(offsetof(Snowman_Cosmetic_OnSnowmanDestroyedByAttackWhileControlled, survivorUsingSnowman) == 0x000000, "Member 'Snowman_Cosmetic_OnSnowmanDestroyedByAttackWhileControlled::survivorUsingSnowman' has a wrong offset!");
static_assert(offsetof(Snowman_Cosmetic_OnSnowmanDestroyedByAttackWhileControlled, killerAttackingSnowman) == 0x000008, "Member 'Snowman_Cosmetic_OnSnowmanDestroyedByAttackWhileControlled::killerAttackingSnowman' has a wrong offset!");

// Function SnowmanWinterEvent.Snowman.Cosmetic_OnSnowmanDestroyedByAttackWhileEmpty
// 0x0008 (0x0008 - 0x0000)
struct Snowman_Cosmetic_OnSnowmanDestroyedByAttackWhileEmpty final
{
public:
	class ASlasherPlayer*                         killerAttackingSnowman;                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Snowman_Cosmetic_OnSnowmanDestroyedByAttackWhileEmpty) == 0x000008, "Wrong alignment on Snowman_Cosmetic_OnSnowmanDestroyedByAttackWhileEmpty");
static_assert(sizeof(Snowman_Cosmetic_OnSnowmanDestroyedByAttackWhileEmpty) == 0x000008, "Wrong size on Snowman_Cosmetic_OnSnowmanDestroyedByAttackWhileEmpty");
static_assert(offsetof(Snowman_Cosmetic_OnSnowmanDestroyedByAttackWhileEmpty, killerAttackingSnowman) == 0x000000, "Member 'Snowman_Cosmetic_OnSnowmanDestroyedByAttackWhileEmpty::killerAttackingSnowman' has a wrong offset!");

// Function SnowmanWinterEvent.Snowman.Cosmetic_OnSnowmanDestroyedByKillerAttackExit
// 0x0008 (0x0008 - 0x0000)
struct Snowman_Cosmetic_OnSnowmanDestroyedByKillerAttackExit final
{
public:
	class ASlasherPlayer*                         killerUsingSnowman;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Snowman_Cosmetic_OnSnowmanDestroyedByKillerAttackExit) == 0x000008, "Wrong alignment on Snowman_Cosmetic_OnSnowmanDestroyedByKillerAttackExit");
static_assert(sizeof(Snowman_Cosmetic_OnSnowmanDestroyedByKillerAttackExit) == 0x000008, "Wrong size on Snowman_Cosmetic_OnSnowmanDestroyedByKillerAttackExit");
static_assert(offsetof(Snowman_Cosmetic_OnSnowmanDestroyedByKillerAttackExit, killerUsingSnowman) == 0x000000, "Member 'Snowman_Cosmetic_OnSnowmanDestroyedByKillerAttackExit::killerUsingSnowman' has a wrong offset!");

// Function SnowmanWinterEvent.Snowman.Cosmetic_OnSnowmanDestroyedBySurvivorRunExit
// 0x0008 (0x0008 - 0x0000)
struct Snowman_Cosmetic_OnSnowmanDestroyedBySurvivorRunExit final
{
public:
	class ACamperPlayer*                          survivorUsingSnowman;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Snowman_Cosmetic_OnSnowmanDestroyedBySurvivorRunExit) == 0x000008, "Wrong alignment on Snowman_Cosmetic_OnSnowmanDestroyedBySurvivorRunExit");
static_assert(sizeof(Snowman_Cosmetic_OnSnowmanDestroyedBySurvivorRunExit) == 0x000008, "Wrong size on Snowman_Cosmetic_OnSnowmanDestroyedBySurvivorRunExit");
static_assert(offsetof(Snowman_Cosmetic_OnSnowmanDestroyedBySurvivorRunExit, survivorUsingSnowman) == 0x000000, "Member 'Snowman_Cosmetic_OnSnowmanDestroyedBySurvivorRunExit::survivorUsingSnowman' has a wrong offset!");

// Function SnowmanWinterEvent.Snowman.Cosmetic_OnSnowmanHighFive
// 0x0008 (0x0008 - 0x0000)
struct Snowman_Cosmetic_OnSnowmanHighFive final
{
public:
	class ASnowman*                               otherSnowman;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Snowman_Cosmetic_OnSnowmanHighFive) == 0x000008, "Wrong alignment on Snowman_Cosmetic_OnSnowmanHighFive");
static_assert(sizeof(Snowman_Cosmetic_OnSnowmanHighFive) == 0x000008, "Wrong size on Snowman_Cosmetic_OnSnowmanHighFive");
static_assert(offsetof(Snowman_Cosmetic_OnSnowmanHighFive, otherSnowman) == 0x000000, "Member 'Snowman_Cosmetic_OnSnowmanHighFive::otherSnowman' has a wrong offset!");

// Function SnowmanWinterEvent.Snowman.Cosmetic_OnSnowmanStartBeingControlledByKiller
// 0x0008 (0x0008 - 0x0000)
struct Snowman_Cosmetic_OnSnowmanStartBeingControlledByKiller final
{
public:
	class ASlasherPlayer*                         killerUsingSnowman;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Snowman_Cosmetic_OnSnowmanStartBeingControlledByKiller) == 0x000008, "Wrong alignment on Snowman_Cosmetic_OnSnowmanStartBeingControlledByKiller");
static_assert(sizeof(Snowman_Cosmetic_OnSnowmanStartBeingControlledByKiller) == 0x000008, "Wrong size on Snowman_Cosmetic_OnSnowmanStartBeingControlledByKiller");
static_assert(offsetof(Snowman_Cosmetic_OnSnowmanStartBeingControlledByKiller, killerUsingSnowman) == 0x000000, "Member 'Snowman_Cosmetic_OnSnowmanStartBeingControlledByKiller::killerUsingSnowman' has a wrong offset!");

// Function SnowmanWinterEvent.Snowman.Cosmetic_OnSnowmanStartBeingControlledBySurvivor
// 0x0008 (0x0008 - 0x0000)
struct Snowman_Cosmetic_OnSnowmanStartBeingControlledBySurvivor final
{
public:
	class ACamperPlayer*                          survivorUsingSnowman;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Snowman_Cosmetic_OnSnowmanStartBeingControlledBySurvivor) == 0x000008, "Wrong alignment on Snowman_Cosmetic_OnSnowmanStartBeingControlledBySurvivor");
static_assert(sizeof(Snowman_Cosmetic_OnSnowmanStartBeingControlledBySurvivor) == 0x000008, "Wrong size on Snowman_Cosmetic_OnSnowmanStartBeingControlledBySurvivor");
static_assert(offsetof(Snowman_Cosmetic_OnSnowmanStartBeingControlledBySurvivor, survivorUsingSnowman) == 0x000000, "Member 'Snowman_Cosmetic_OnSnowmanStartBeingControlledBySurvivor::survivorUsingSnowman' has a wrong offset!");

// Function SnowmanWinterEvent.Snowman.Cosmetic_OnSnowmanStartBeingUsedByKiller
// 0x0008 (0x0008 - 0x0000)
struct Snowman_Cosmetic_OnSnowmanStartBeingUsedByKiller final
{
public:
	class ASlasherPlayer*                         killerUsingSnowman;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Snowman_Cosmetic_OnSnowmanStartBeingUsedByKiller) == 0x000008, "Wrong alignment on Snowman_Cosmetic_OnSnowmanStartBeingUsedByKiller");
static_assert(sizeof(Snowman_Cosmetic_OnSnowmanStartBeingUsedByKiller) == 0x000008, "Wrong size on Snowman_Cosmetic_OnSnowmanStartBeingUsedByKiller");
static_assert(offsetof(Snowman_Cosmetic_OnSnowmanStartBeingUsedByKiller, killerUsingSnowman) == 0x000000, "Member 'Snowman_Cosmetic_OnSnowmanStartBeingUsedByKiller::killerUsingSnowman' has a wrong offset!");

// Function SnowmanWinterEvent.Snowman.Cosmetic_OnSnowmanStartBeingUsedBySurvivor
// 0x0008 (0x0008 - 0x0000)
struct Snowman_Cosmetic_OnSnowmanStartBeingUsedBySurvivor final
{
public:
	class ACamperPlayer*                          survivorUsingSnowman;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Snowman_Cosmetic_OnSnowmanStartBeingUsedBySurvivor) == 0x000008, "Wrong alignment on Snowman_Cosmetic_OnSnowmanStartBeingUsedBySurvivor");
static_assert(sizeof(Snowman_Cosmetic_OnSnowmanStartBeingUsedBySurvivor) == 0x000008, "Wrong size on Snowman_Cosmetic_OnSnowmanStartBeingUsedBySurvivor");
static_assert(offsetof(Snowman_Cosmetic_OnSnowmanStartBeingUsedBySurvivor, survivorUsingSnowman) == 0x000000, "Member 'Snowman_Cosmetic_OnSnowmanStartBeingUsedBySurvivor::survivorUsingSnowman' has a wrong offset!");

// Function SnowmanWinterEvent.Snowman.Cosmetic_SetSnowmanMaterialVariant
// 0x0004 (0x0004 - 0x0000)
struct Snowman_Cosmetic_SetSnowmanMaterialVariant final
{
public:
	int32                                         materialVariantIndex;                              // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Snowman_Cosmetic_SetSnowmanMaterialVariant) == 0x000004, "Wrong alignment on Snowman_Cosmetic_SetSnowmanMaterialVariant");
static_assert(sizeof(Snowman_Cosmetic_SetSnowmanMaterialVariant) == 0x000004, "Wrong size on Snowman_Cosmetic_SetSnowmanMaterialVariant");
static_assert(offsetof(Snowman_Cosmetic_SetSnowmanMaterialVariant, materialVariantIndex) == 0x000000, "Member 'Snowman_Cosmetic_SetSnowmanMaterialVariant::materialVariantIndex' has a wrong offset!");

// Function SnowmanWinterEvent.Snowman.Multicast_OnSnowmanStartBeingControlledByKiller
// 0x0008 (0x0008 - 0x0000)
struct Snowman_Multicast_OnSnowmanStartBeingControlledByKiller final
{
public:
	class ASlasherPlayer*                         killerUsingSnowman;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Snowman_Multicast_OnSnowmanStartBeingControlledByKiller) == 0x000008, "Wrong alignment on Snowman_Multicast_OnSnowmanStartBeingControlledByKiller");
static_assert(sizeof(Snowman_Multicast_OnSnowmanStartBeingControlledByKiller) == 0x000008, "Wrong size on Snowman_Multicast_OnSnowmanStartBeingControlledByKiller");
static_assert(offsetof(Snowman_Multicast_OnSnowmanStartBeingControlledByKiller, killerUsingSnowman) == 0x000000, "Member 'Snowman_Multicast_OnSnowmanStartBeingControlledByKiller::killerUsingSnowman' has a wrong offset!");

// Function SnowmanWinterEvent.Snowman.Multicast_OnSnowmanStartBeingControlledBySurvivor
// 0x0008 (0x0008 - 0x0000)
struct Snowman_Multicast_OnSnowmanStartBeingControlledBySurvivor final
{
public:
	class ACamperPlayer*                          survivorUsingSnowman;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Snowman_Multicast_OnSnowmanStartBeingControlledBySurvivor) == 0x000008, "Wrong alignment on Snowman_Multicast_OnSnowmanStartBeingControlledBySurvivor");
static_assert(sizeof(Snowman_Multicast_OnSnowmanStartBeingControlledBySurvivor) == 0x000008, "Wrong size on Snowman_Multicast_OnSnowmanStartBeingControlledBySurvivor");
static_assert(offsetof(Snowman_Multicast_OnSnowmanStartBeingControlledBySurvivor, survivorUsingSnowman) == 0x000000, "Member 'Snowman_Multicast_OnSnowmanStartBeingControlledBySurvivor::survivorUsingSnowman' has a wrong offset!");

// Function SnowmanWinterEvent.Snowman.Multicast_OnSnowmanStartBeingUsedByKiller
// 0x0008 (0x0008 - 0x0000)
struct Snowman_Multicast_OnSnowmanStartBeingUsedByKiller final
{
public:
	class ASlasherPlayer*                         killerUsingSnowman;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Snowman_Multicast_OnSnowmanStartBeingUsedByKiller) == 0x000008, "Wrong alignment on Snowman_Multicast_OnSnowmanStartBeingUsedByKiller");
static_assert(sizeof(Snowman_Multicast_OnSnowmanStartBeingUsedByKiller) == 0x000008, "Wrong size on Snowman_Multicast_OnSnowmanStartBeingUsedByKiller");
static_assert(offsetof(Snowman_Multicast_OnSnowmanStartBeingUsedByKiller, killerUsingSnowman) == 0x000000, "Member 'Snowman_Multicast_OnSnowmanStartBeingUsedByKiller::killerUsingSnowman' has a wrong offset!");

// Function SnowmanWinterEvent.Snowman.Multicast_OnSnowmanStartBeingUsedBySurvivor
// 0x0008 (0x0008 - 0x0000)
struct Snowman_Multicast_OnSnowmanStartBeingUsedBySurvivor final
{
public:
	class ACamperPlayer*                          survivorUsingSnowman;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Snowman_Multicast_OnSnowmanStartBeingUsedBySurvivor) == 0x000008, "Wrong alignment on Snowman_Multicast_OnSnowmanStartBeingUsedBySurvivor");
static_assert(sizeof(Snowman_Multicast_OnSnowmanStartBeingUsedBySurvivor) == 0x000008, "Wrong size on Snowman_Multicast_OnSnowmanStartBeingUsedBySurvivor");
static_assert(offsetof(Snowman_Multicast_OnSnowmanStartBeingUsedBySurvivor, survivorUsingSnowman) == 0x000000, "Member 'Snowman_Multicast_OnSnowmanStartBeingUsedBySurvivor::survivorUsingSnowman' has a wrong offset!");

// Function SnowmanWinterEvent.Snowman.Multicast_SetSnowmanHiddenInGame
// 0x0001 (0x0001 - 0x0000)
struct Snowman_Multicast_SetSnowmanHiddenInGame final
{
public:
	bool                                          isHidden;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Snowman_Multicast_SetSnowmanHiddenInGame) == 0x000001, "Wrong alignment on Snowman_Multicast_SetSnowmanHiddenInGame");
static_assert(sizeof(Snowman_Multicast_SetSnowmanHiddenInGame) == 0x000001, "Wrong size on Snowman_Multicast_SetSnowmanHiddenInGame");
static_assert(offsetof(Snowman_Multicast_SetSnowmanHiddenInGame, isHidden) == 0x000000, "Member 'Snowman_Multicast_SetSnowmanHiddenInGame::isHidden' has a wrong offset!");

// Function SnowmanWinterEvent.Snowman.Multicast_SetSnowmanMaterialVariant
// 0x0004 (0x0004 - 0x0000)
struct Snowman_Multicast_SetSnowmanMaterialVariant final
{
public:
	int32                                         materialVariantIndex;                              // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Snowman_Multicast_SetSnowmanMaterialVariant) == 0x000004, "Wrong alignment on Snowman_Multicast_SetSnowmanMaterialVariant");
static_assert(sizeof(Snowman_Multicast_SetSnowmanMaterialVariant) == 0x000004, "Wrong size on Snowman_Multicast_SetSnowmanMaterialVariant");
static_assert(offsetof(Snowman_Multicast_SetSnowmanMaterialVariant, materialVariantIndex) == 0x000000, "Member 'Snowman_Multicast_SetSnowmanMaterialVariant::materialVariantIndex' has a wrong offset!");

// Function SnowmanWinterEvent.Snowman.Multicast_SpawnSnowman
// 0x0018 (0x0018 - 0x0000)
struct Snowman_Multicast_SpawnSnowman final
{
public:
	struct FSnowmanSpawnData                      spawnData;                                         // 0x0000(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Snowman_Multicast_SpawnSnowman) == 0x000004, "Wrong alignment on Snowman_Multicast_SpawnSnowman");
static_assert(sizeof(Snowman_Multicast_SpawnSnowman) == 0x000018, "Wrong size on Snowman_Multicast_SpawnSnowman");
static_assert(offsetof(Snowman_Multicast_SpawnSnowman, spawnData) == 0x000000, "Member 'Snowman_Multicast_SpawnSnowman::spawnData' has a wrong offset!");

// Function SnowmanWinterEvent.Snowman.Multicast_StartSnowmanDestruction
// 0x0010 (0x0010 - 0x0000)
struct Snowman_Multicast_StartSnowmanDestruction final
{
public:
	ESnowmanDestructionType                       snowmanDestructionType;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          unlockRequirementsSatisfiedForSurvivor;            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          unlockRequirementsSatisfiedForKiller;              // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             playerInSnowman;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Snowman_Multicast_StartSnowmanDestruction) == 0x000008, "Wrong alignment on Snowman_Multicast_StartSnowmanDestruction");
static_assert(sizeof(Snowman_Multicast_StartSnowmanDestruction) == 0x000010, "Wrong size on Snowman_Multicast_StartSnowmanDestruction");
static_assert(offsetof(Snowman_Multicast_StartSnowmanDestruction, snowmanDestructionType) == 0x000000, "Member 'Snowman_Multicast_StartSnowmanDestruction::snowmanDestructionType' has a wrong offset!");
static_assert(offsetof(Snowman_Multicast_StartSnowmanDestruction, unlockRequirementsSatisfiedForSurvivor) == 0x000001, "Member 'Snowman_Multicast_StartSnowmanDestruction::unlockRequirementsSatisfiedForSurvivor' has a wrong offset!");
static_assert(offsetof(Snowman_Multicast_StartSnowmanDestruction, unlockRequirementsSatisfiedForKiller) == 0x000002, "Member 'Snowman_Multicast_StartSnowmanDestruction::unlockRequirementsSatisfiedForKiller' has a wrong offset!");
static_assert(offsetof(Snowman_Multicast_StartSnowmanDestruction, playerInSnowman) == 0x000008, "Member 'Snowman_Multicast_StartSnowmanDestruction::playerInSnowman' has a wrong offset!");

// Function SnowmanWinterEvent.Snowman.OnFinishedPlaying
// 0x0038 (0x0038 - 0x0000)
struct Snowman_OnFinishedPlaying final
{
public:
	struct FGameplayTag                           gameEventType;                                     // 0x0000(0x000C)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         gameEventData;                                     // 0x0010(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Snowman_OnFinishedPlaying) == 0x000008, "Wrong alignment on Snowman_OnFinishedPlaying");
static_assert(sizeof(Snowman_OnFinishedPlaying) == 0x000038, "Wrong size on Snowman_OnFinishedPlaying");
static_assert(offsetof(Snowman_OnFinishedPlaying, gameEventType) == 0x000000, "Member 'Snowman_OnFinishedPlaying::gameEventType' has a wrong offset!");
static_assert(offsetof(Snowman_OnFinishedPlaying, gameEventData) == 0x000010, "Member 'Snowman_OnFinishedPlaying::gameEventData' has a wrong offset!");

// Function SnowmanWinterEvent.Snowman.Multicast_DrawDebugCollisionCheck
// 0x0010 (0x0010 - 0x0000)
struct Snowman_Multicast_DrawDebugCollisionCheck final
{
public:
	struct FVector                                boxExtent;                                         // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         debugLifetime;                                     // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Snowman_Multicast_DrawDebugCollisionCheck) == 0x000004, "Wrong alignment on Snowman_Multicast_DrawDebugCollisionCheck");
static_assert(sizeof(Snowman_Multicast_DrawDebugCollisionCheck) == 0x000010, "Wrong size on Snowman_Multicast_DrawDebugCollisionCheck");
static_assert(offsetof(Snowman_Multicast_DrawDebugCollisionCheck, boxExtent) == 0x000000, "Member 'Snowman_Multicast_DrawDebugCollisionCheck::boxExtent' has a wrong offset!");
static_assert(offsetof(Snowman_Multicast_DrawDebugCollisionCheck, debugLifetime) == 0x00000C, "Member 'Snowman_Multicast_DrawDebugCollisionCheck::debugLifetime' has a wrong offset!");

// Function SnowmanWinterEvent.SnowmanAnimInstance.Cosmetic_OnSnowmanDestroyedEvent
// 0x0001 (0x0001 - 0x0000)
struct SnowmanAnimInstance_Cosmetic_OnSnowmanDestroyedEvent final
{
public:
	ESnowmanDestructionType                       snowmanDestructionType;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnowmanAnimInstance_Cosmetic_OnSnowmanDestroyedEvent) == 0x000001, "Wrong alignment on SnowmanAnimInstance_Cosmetic_OnSnowmanDestroyedEvent");
static_assert(sizeof(SnowmanAnimInstance_Cosmetic_OnSnowmanDestroyedEvent) == 0x000001, "Wrong size on SnowmanAnimInstance_Cosmetic_OnSnowmanDestroyedEvent");
static_assert(offsetof(SnowmanAnimInstance_Cosmetic_OnSnowmanDestroyedEvent, snowmanDestructionType) == 0x000000, "Member 'SnowmanAnimInstance_Cosmetic_OnSnowmanDestroyedEvent::snowmanDestructionType' has a wrong offset!");

// Function SnowmanWinterEvent.SnowmanWinterEventComponent.DBD_Winter2021ShowSnowmenSpawnCollisionChecks
// 0x0004 (0x0004 - 0x0000)
struct SnowmanWinterEventComponent_DBD_Winter2021ShowSnowmenSpawnCollisionChecks final
{
public:
	float                                         numberOfSeconds;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnowmanWinterEventComponent_DBD_Winter2021ShowSnowmenSpawnCollisionChecks) == 0x000004, "Wrong alignment on SnowmanWinterEventComponent_DBD_Winter2021ShowSnowmenSpawnCollisionChecks");
static_assert(sizeof(SnowmanWinterEventComponent_DBD_Winter2021ShowSnowmenSpawnCollisionChecks) == 0x000004, "Wrong size on SnowmanWinterEventComponent_DBD_Winter2021ShowSnowmenSpawnCollisionChecks");
static_assert(offsetof(SnowmanWinterEventComponent_DBD_Winter2021ShowSnowmenSpawnCollisionChecks, numberOfSeconds) == 0x000000, "Member 'SnowmanWinterEventComponent_DBD_Winter2021ShowSnowmenSpawnCollisionChecks::numberOfSeconds' has a wrong offset!");

// Function SnowmanWinterEvent.SnowmanWinterEventComponent.DBD_Winter2021VisualizeCalculatedSpawnData
// 0x0004 (0x0004 - 0x0000)
struct SnowmanWinterEventComponent_DBD_Winter2021VisualizeCalculatedSpawnData final
{
public:
	float                                         numberOfSeconds;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnowmanWinterEventComponent_DBD_Winter2021VisualizeCalculatedSpawnData) == 0x000004, "Wrong alignment on SnowmanWinterEventComponent_DBD_Winter2021VisualizeCalculatedSpawnData");
static_assert(sizeof(SnowmanWinterEventComponent_DBD_Winter2021VisualizeCalculatedSpawnData) == 0x000004, "Wrong size on SnowmanWinterEventComponent_DBD_Winter2021VisualizeCalculatedSpawnData");
static_assert(offsetof(SnowmanWinterEventComponent_DBD_Winter2021VisualizeCalculatedSpawnData, numberOfSeconds) == 0x000000, "Member 'SnowmanWinterEventComponent_DBD_Winter2021VisualizeCalculatedSpawnData::numberOfSeconds' has a wrong offset!");

// Function SnowmanWinterEvent.SurvivorHideInSnowmanInteraction.Authority_OnDamageStateChanged
// 0x0002 (0x0002 - 0x0000)
struct SurvivorHideInSnowmanInteraction_Authority_OnDamageStateChanged final
{
public:
	ECamperDamageState                            oldDamageState;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECamperDamageState                            currentDamageState;                                // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SurvivorHideInSnowmanInteraction_Authority_OnDamageStateChanged) == 0x000001, "Wrong alignment on SurvivorHideInSnowmanInteraction_Authority_OnDamageStateChanged");
static_assert(sizeof(SurvivorHideInSnowmanInteraction_Authority_OnDamageStateChanged) == 0x000002, "Wrong size on SurvivorHideInSnowmanInteraction_Authority_OnDamageStateChanged");
static_assert(offsetof(SurvivorHideInSnowmanInteraction_Authority_OnDamageStateChanged, oldDamageState) == 0x000000, "Member 'SurvivorHideInSnowmanInteraction_Authority_OnDamageStateChanged::oldDamageState' has a wrong offset!");
static_assert(offsetof(SurvivorHideInSnowmanInteraction_Authority_OnDamageStateChanged, currentDamageState) == 0x000001, "Member 'SurvivorHideInSnowmanInteraction_Authority_OnDamageStateChanged::currentDamageState' has a wrong offset!");

}

