#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StartupInitializer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function StartupInitializer.ClientStartupInitializer.OnHealthCheckTriggered
// 0x0018 (0x0018 - 0x0000)
struct ClientStartupInitializer_OnHealthCheckTriggered final
{
public:
	bool                                          requestSuccess;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         providerError;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          datetimeIsSet;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              utcTime;                                           // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClientStartupInitializer_OnHealthCheckTriggered) == 0x000008, "Wrong alignment on ClientStartupInitializer_OnHealthCheckTriggered");
static_assert(sizeof(ClientStartupInitializer_OnHealthCheckTriggered) == 0x000018, "Wrong size on ClientStartupInitializer_OnHealthCheckTriggered");
static_assert(offsetof(ClientStartupInitializer_OnHealthCheckTriggered, requestSuccess) == 0x000000, "Member 'ClientStartupInitializer_OnHealthCheckTriggered::requestSuccess' has a wrong offset!");
static_assert(offsetof(ClientStartupInitializer_OnHealthCheckTriggered, providerError) == 0x000004, "Member 'ClientStartupInitializer_OnHealthCheckTriggered::providerError' has a wrong offset!");
static_assert(offsetof(ClientStartupInitializer_OnHealthCheckTriggered, datetimeIsSet) == 0x000008, "Member 'ClientStartupInitializer_OnHealthCheckTriggered::datetimeIsSet' has a wrong offset!");
static_assert(offsetof(ClientStartupInitializer_OnHealthCheckTriggered, utcTime) == 0x000010, "Member 'ClientStartupInitializer_OnHealthCheckTriggered::utcTime' has a wrong offset!");

}

