#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StartupInitializer

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class StartupInitializer.StartupInitializer
// 0x0058 (0x0088 - 0x0030)
class UStartupInitializer : public UObject
{
public:
	uint8                                         Pad_30[0x58];                                      // 0x0030(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StartupInitializer">();
	}
	static class UStartupInitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStartupInitializer>();
	}
};
static_assert(alignof(UStartupInitializer) == 0x000008, "Wrong alignment on UStartupInitializer");
static_assert(sizeof(UStartupInitializer) == 0x000088, "Wrong size on UStartupInitializer");

// Class StartupInitializer.ClientStartupInitializer
// 0x0138 (0x01C0 - 0x0088)
class UClientStartupInitializer final : public UStartupInitializer
{
public:
	uint8                                         Pad_88[0x138];                                     // 0x0088(0x0138)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnHealthCheckTriggered(bool requestSuccess, int32 providerError, bool datetimeIsSet, const struct FDateTime& utcTime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClientStartupInitializer">();
	}
	static class UClientStartupInitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClientStartupInitializer>();
	}
};
static_assert(alignof(UClientStartupInitializer) == 0x000008, "Wrong alignment on UClientStartupInitializer");
static_assert(sizeof(UClientStartupInitializer) == 0x0001C0, "Wrong size on UClientStartupInitializer");

// Class StartupInitializer.DedicatedServerStartupInitializer
// 0x0030 (0x00B8 - 0x0088)
class UDedicatedServerStartupInitializer final : public UStartupInitializer
{
public:
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UDBDTimeUtilities*                      _dbdTimeUtilities;                                 // 0x0090(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_98[0x20];                                      // 0x0098(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DedicatedServerStartupInitializer">();
	}
	static class UDedicatedServerStartupInitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDedicatedServerStartupInitializer>();
	}
};
static_assert(alignof(UDedicatedServerStartupInitializer) == 0x000008, "Wrong alignment on UDedicatedServerStartupInitializer");
static_assert(sizeof(UDedicatedServerStartupInitializer) == 0x0000B8, "Wrong size on UDedicatedServerStartupInitializer");
static_assert(offsetof(UDedicatedServerStartupInitializer, _dbdTimeUtilities) == 0x000090, "Member 'UDedicatedServerStartupInitializer::_dbdTimeUtilities' has a wrong offset!");

}

