#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SWBP_LevelInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_LevelState_structs.hpp"


namespace SDK::Params
{

// Function SWBP_LevelInfo.SWBP_LevelInfo_C.ExecuteUbergraph_SWBP_LevelInfo
// 0x0770 (0x0770 - 0x0000)
struct SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0030(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x00C8(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00F0(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0130(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0148(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0158(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0170(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0188(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x01C8(0x0010)(ReferenceParm)
	class ULevel*                                 CallFunc_GetLoadedLevel_ReturnValue;               // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x01E0(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_LevelState                                  Temp_byte_Variable;                                // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_LevelState                                  Temp_byte_Variable_1;                              // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FB[0x5];                                      // 0x01FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_DateTime_Year;                        // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_DateTime_Month;                       // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_DateTime_Day;                         // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_DateTime_Hour;                        // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_DateTime_Minute;                      // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_DateTime_Second;                      // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_DateTime_Millisecond;                 // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0270(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_5;          // 0x0288(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x02A0(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x02E0(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_6;          // 0x0320(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_7;          // 0x0338(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x0350(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x0390(0x0040)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_8;          // 0x03D8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_8;            // 0x03F0(0x0040)(HasGetValueTypeHash)
	E_LevelState                                  K2Node_Select_Default;                             // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0448(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_9;          // 0x0458(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_9;            // 0x0470(0x0040)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x04B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x04C8(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x04E0(0x0018)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F9[0x3];                                      // 0x04F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x04FC(0x0014)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0510(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_DateTime_Year_1;                      // 0x0518(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_DateTime_Month_1;                     // 0x0528(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_DateTime_Day_1;                       // 0x0538(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_DateTime_Hour_1;                      // 0x0548(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_DateTime_Minute_1;                    // 0x0558(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_DateTime_Second_1;                    // 0x0568(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_DateTime_Millisecond_1;               // 0x0578(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_10;         // 0x0588(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_11;         // 0x05A0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_10;           // 0x05B8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_11;           // 0x05F8(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_12;         // 0x0638(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_13;         // 0x0650(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_12;           // 0x0668(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_13;           // 0x06A8(0x0040)(HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_14;         // 0x06F0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_14;           // 0x0708(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x0748(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x0758(0x0018)()
};
static_assert(alignof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo) == 0x000008, "Wrong alignment on SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo");
static_assert(sizeof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo) == 0x000770, "Wrong size on SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, EntryPoint) == 0x000000, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000030, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, K2Node_MakeStruct_FormatArgumentData_1) == 0x000088, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0000C8, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, K2Node_MakeArray_Array) == 0x0000E0, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000F0, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Format_ReturnValue) == 0x000130, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, K2Node_MakeArray_Array_1) == 0x000148, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Format_ReturnValue_1) == 0x000158, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000170, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, K2Node_MakeStruct_FormatArgumentData_3) == 0x000188, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, K2Node_MakeArray_Array_2) == 0x0001C8, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_GetLoadedLevel_ReturnValue) == 0x0001D8, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_GetLoadedLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Format_ReturnValue_2) == 0x0001E0, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_IsValid_ReturnValue) == 0x0001F8, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, Temp_byte_Variable) == 0x0001F9, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, Temp_byte_Variable_1) == 0x0001FA, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Get_DateTime_Year) == 0x000200, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Get_DateTime_Year' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Get_DateTime_Month) == 0x000210, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Get_DateTime_Month' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Get_DateTime_Day) == 0x000220, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Get_DateTime_Day' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Get_DateTime_Hour) == 0x000230, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Get_DateTime_Hour' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Get_DateTime_Minute) == 0x000240, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Get_DateTime_Minute' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Get_DateTime_Second) == 0x000250, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Get_DateTime_Second' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Get_DateTime_Millisecond) == 0x000260, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Get_DateTime_Millisecond' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Conv_StringToText_ReturnValue_4) == 0x000270, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Conv_StringToText_ReturnValue_5) == 0x000288, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Conv_StringToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, K2Node_MakeStruct_FormatArgumentData_4) == 0x0002A0, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, K2Node_MakeStruct_FormatArgumentData_5) == 0x0002E0, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Conv_StringToText_ReturnValue_6) == 0x000320, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Conv_StringToText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Conv_StringToText_ReturnValue_7) == 0x000338, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Conv_StringToText_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, K2Node_MakeStruct_FormatArgumentData_6) == 0x000350, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::K2Node_MakeStruct_FormatArgumentData_6' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, K2Node_MakeStruct_FormatArgumentData_7) == 0x000390, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::K2Node_MakeStruct_FormatArgumentData_7' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, Temp_bool_Variable) == 0x0003D0, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Conv_StringToText_ReturnValue_8) == 0x0003D8, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Conv_StringToText_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, K2Node_MakeStruct_FormatArgumentData_8) == 0x0003F0, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::K2Node_MakeStruct_FormatArgumentData_8' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, K2Node_Select_Default) == 0x000430, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_GetPlayerController_ReturnValue) == 0x000438, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000440, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000448, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Conv_StringToText_ReturnValue_9) == 0x000458, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Conv_StringToText_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, K2Node_MakeStruct_FormatArgumentData_9) == 0x000470, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::K2Node_MakeStruct_FormatArgumentData_9' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, Temp_bool_Variable_1) == 0x0004B0, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, K2Node_MakeArray_Array_3) == 0x0004B8, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Format_ReturnValue_3) == 0x0004C8, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, K2Node_Select_Default_1) == 0x0004E0, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x0004F8, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, K2Node_CreateDelegate_OutputDelegate) == 0x0004FC, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000510, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Get_DateTime_Year_1) == 0x000518, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Get_DateTime_Year_1' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Get_DateTime_Month_1) == 0x000528, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Get_DateTime_Month_1' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Get_DateTime_Day_1) == 0x000538, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Get_DateTime_Day_1' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Get_DateTime_Hour_1) == 0x000548, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Get_DateTime_Hour_1' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Get_DateTime_Minute_1) == 0x000558, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Get_DateTime_Minute_1' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Get_DateTime_Second_1) == 0x000568, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Get_DateTime_Second_1' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Get_DateTime_Millisecond_1) == 0x000578, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Get_DateTime_Millisecond_1' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Conv_StringToText_ReturnValue_10) == 0x000588, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Conv_StringToText_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Conv_StringToText_ReturnValue_11) == 0x0005A0, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Conv_StringToText_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, K2Node_MakeStruct_FormatArgumentData_10) == 0x0005B8, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::K2Node_MakeStruct_FormatArgumentData_10' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, K2Node_MakeStruct_FormatArgumentData_11) == 0x0005F8, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::K2Node_MakeStruct_FormatArgumentData_11' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Conv_StringToText_ReturnValue_12) == 0x000638, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Conv_StringToText_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Conv_StringToText_ReturnValue_13) == 0x000650, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Conv_StringToText_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, K2Node_MakeStruct_FormatArgumentData_12) == 0x000668, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::K2Node_MakeStruct_FormatArgumentData_12' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, K2Node_MakeStruct_FormatArgumentData_13) == 0x0006A8, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::K2Node_MakeStruct_FormatArgumentData_13' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_GetPlayerController_ReturnValue_1) == 0x0006E8, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Conv_StringToText_ReturnValue_14) == 0x0006F0, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Conv_StringToText_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, K2Node_MakeStruct_FormatArgumentData_14) == 0x000708, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::K2Node_MakeStruct_FormatArgumentData_14' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, K2Node_MakeArray_Array_4) == 0x000748, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo, CallFunc_Format_ReturnValue_4) == 0x000758, "Member 'SWBP_LevelInfo_C_ExecuteUbergraph_SWBP_LevelInfo::CallFunc_Format_ReturnValue_4' has a wrong offset!");

}

