#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SWBP_LevelInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_LevelState_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SWBP_LevelInfo.SWBP_LevelInfo_C
// 0x0030 (0x02C8 - 0x0298)
class USWBP_LevelInfo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URichTextBlock*                         RichTextBlock_LevelPath;                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 LevelPath;                                         // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class ULevelStreaming*                        LevelStreamingReference;                           // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	E_LevelState                                  PreviousLevelState;                                // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWasInitialUpdatePerformed;                        // 0x02C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_SWBP_LevelInfo(int32 EntryPoint);
	void Event_InvalidateWidget();
	void Event_UpdateLevelRichText();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SWBP_LevelInfo_C">();
	}
	static class USWBP_LevelInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USWBP_LevelInfo_C>();
	}
};
static_assert(alignof(USWBP_LevelInfo_C) == 0x000008, "Wrong alignment on USWBP_LevelInfo_C");
static_assert(sizeof(USWBP_LevelInfo_C) == 0x0002C8, "Wrong size on USWBP_LevelInfo_C");
static_assert(offsetof(USWBP_LevelInfo_C, UberGraphFrame) == 0x000298, "Member 'USWBP_LevelInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USWBP_LevelInfo_C, RichTextBlock_LevelPath) == 0x0002A0, "Member 'USWBP_LevelInfo_C::RichTextBlock_LevelPath' has a wrong offset!");
static_assert(offsetof(USWBP_LevelInfo_C, LevelPath) == 0x0002A8, "Member 'USWBP_LevelInfo_C::LevelPath' has a wrong offset!");
static_assert(offsetof(USWBP_LevelInfo_C, LevelStreamingReference) == 0x0002B8, "Member 'USWBP_LevelInfo_C::LevelStreamingReference' has a wrong offset!");
static_assert(offsetof(USWBP_LevelInfo_C, PreviousLevelState) == 0x0002C0, "Member 'USWBP_LevelInfo_C::PreviousLevelState' has a wrong offset!");
static_assert(offsetof(USWBP_LevelInfo_C, bWasInitialUpdatePerformed) == 0x0002C1, "Member 'USWBP_LevelInfo_C::bWasInitialUpdatePerformed' has a wrong offset!");

}

