#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheBlight

#include "Basic.hpp"

#include "TheBlight_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "DeadByDaylight_structs.hpp"


namespace SDK::Params
{

// Function TheBlight.Addon_TheBlight_17.Multicast_SpawnParticleOnSurvivors
// 0x0010 (0x0010 - 0x0000)
struct Addon_TheBlight_17_Multicast_SpawnParticleOnSurvivors final
{
public:
	TArray<class ACamperPlayer*>                  survivors;                                         // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(Addon_TheBlight_17_Multicast_SpawnParticleOnSurvivors) == 0x000008, "Wrong alignment on Addon_TheBlight_17_Multicast_SpawnParticleOnSurvivors");
static_assert(sizeof(Addon_TheBlight_17_Multicast_SpawnParticleOnSurvivors) == 0x000010, "Wrong size on Addon_TheBlight_17_Multicast_SpawnParticleOnSurvivors");
static_assert(offsetof(Addon_TheBlight_17_Multicast_SpawnParticleOnSurvivors, survivors) == 0x000000, "Member 'Addon_TheBlight_17_Multicast_SpawnParticleOnSurvivors::survivors' has a wrong offset!");

// Function TheBlight.Addon_TheBlight_17.SpawnParticleOnSurvivor
// 0x0008 (0x0008 - 0x0000)
struct Addon_TheBlight_17_SpawnParticleOnSurvivor final
{
public:
	const class ACamperPlayer*                    camperPlayer;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Addon_TheBlight_17_SpawnParticleOnSurvivor) == 0x000008, "Wrong alignment on Addon_TheBlight_17_SpawnParticleOnSurvivor");
static_assert(sizeof(Addon_TheBlight_17_SpawnParticleOnSurvivor) == 0x000008, "Wrong size on Addon_TheBlight_17_SpawnParticleOnSurvivor");
static_assert(offsetof(Addon_TheBlight_17_SpawnParticleOnSurvivor, camperPlayer) == 0x000000, "Member 'Addon_TheBlight_17_SpawnParticleOnSurvivor::camperPlayer' has a wrong offset!");

// Function TheBlight.BlightPower.OnPowerStateChanged
// 0x0002 (0x0002 - 0x0000)
struct BlightPower_OnPowerStateChanged final
{
public:
	EWallGrabState                                previousState;                                     // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWallGrabState                                newState;                                          // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlightPower_OnPowerStateChanged) == 0x000001, "Wrong alignment on BlightPower_OnPowerStateChanged");
static_assert(sizeof(BlightPower_OnPowerStateChanged) == 0x000002, "Wrong size on BlightPower_OnPowerStateChanged");
static_assert(offsetof(BlightPower_OnPowerStateChanged, previousState) == 0x000000, "Member 'BlightPower_OnPowerStateChanged::previousState' has a wrong offset!");
static_assert(offsetof(BlightPower_OnPowerStateChanged, newState) == 0x000001, "Member 'BlightPower_OnPowerStateChanged::newState' has a wrong offset!");

// Function TheBlight.BlightPowerState.GetStateDuration
// 0x0004 (0x0004 - 0x0000)
struct BlightPowerState_GetStateDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlightPowerState_GetStateDuration) == 0x000004, "Wrong alignment on BlightPowerState_GetStateDuration");
static_assert(sizeof(BlightPowerState_GetStateDuration) == 0x000004, "Wrong size on BlightPowerState_GetStateDuration");
static_assert(offsetof(BlightPowerState_GetStateDuration, ReturnValue) == 0x000000, "Member 'BlightPowerState_GetStateDuration::ReturnValue' has a wrong offset!");

// Function TheBlight.BlightPowerStateComponent.Multicast_SetWallGrabState
// 0x0001 (0x0001 - 0x0000)
struct BlightPowerStateComponent_Multicast_SetWallGrabState final
{
public:
	EWallGrabState                                newState;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlightPowerStateComponent_Multicast_SetWallGrabState) == 0x000001, "Wrong alignment on BlightPowerStateComponent_Multicast_SetWallGrabState");
static_assert(sizeof(BlightPowerStateComponent_Multicast_SetWallGrabState) == 0x000001, "Wrong size on BlightPowerStateComponent_Multicast_SetWallGrabState");
static_assert(offsetof(BlightPowerStateComponent_Multicast_SetWallGrabState, newState) == 0x000000, "Member 'BlightPowerStateComponent_Multicast_SetWallGrabState::newState' has a wrong offset!");

// Function TheBlight.BlightPowerStateComponent.Server_SetWallGrabState
// 0x0001 (0x0001 - 0x0000)
struct BlightPowerStateComponent_Server_SetWallGrabState final
{
public:
	EWallGrabState                                newState;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlightPowerStateComponent_Server_SetWallGrabState) == 0x000001, "Wrong alignment on BlightPowerStateComponent_Server_SetWallGrabState");
static_assert(sizeof(BlightPowerStateComponent_Server_SetWallGrabState) == 0x000001, "Wrong size on BlightPowerStateComponent_Server_SetWallGrabState");
static_assert(offsetof(BlightPowerStateComponent_Server_SetWallGrabState, newState) == 0x000000, "Member 'BlightPowerStateComponent_Server_SetWallGrabState::newState' has a wrong offset!");

// Function TheBlight.BlightPowerStateComponent.CanDash
// 0x0001 (0x0001 - 0x0000)
struct BlightPowerStateComponent_CanDash final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlightPowerStateComponent_CanDash) == 0x000001, "Wrong alignment on BlightPowerStateComponent_CanDash");
static_assert(sizeof(BlightPowerStateComponent_CanDash) == 0x000001, "Wrong size on BlightPowerStateComponent_CanDash");
static_assert(offsetof(BlightPowerStateComponent_CanDash, ReturnValue) == 0x000000, "Member 'BlightPowerStateComponent_CanDash::ReturnValue' has a wrong offset!");

// Function TheBlight.BlightPowerStateComponent.GetCurrentPowerState
// 0x0008 (0x0008 - 0x0000)
struct BlightPowerStateComponent_GetCurrentPowerState final
{
public:
	class UBlightPowerState*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlightPowerStateComponent_GetCurrentPowerState) == 0x000008, "Wrong alignment on BlightPowerStateComponent_GetCurrentPowerState");
static_assert(sizeof(BlightPowerStateComponent_GetCurrentPowerState) == 0x000008, "Wrong size on BlightPowerStateComponent_GetCurrentPowerState");
static_assert(offsetof(BlightPowerStateComponent_GetCurrentPowerState, ReturnValue) == 0x000000, "Member 'BlightPowerStateComponent_GetCurrentPowerState::ReturnValue' has a wrong offset!");

// Function TheBlight.BlightPowerStateComponent.GetDashTokensRemaining
// 0x0001 (0x0001 - 0x0000)
struct BlightPowerStateComponent_GetDashTokensRemaining final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlightPowerStateComponent_GetDashTokensRemaining) == 0x000001, "Wrong alignment on BlightPowerStateComponent_GetDashTokensRemaining");
static_assert(sizeof(BlightPowerStateComponent_GetDashTokensRemaining) == 0x000001, "Wrong size on BlightPowerStateComponent_GetDashTokensRemaining");
static_assert(offsetof(BlightPowerStateComponent_GetDashTokensRemaining, ReturnValue) == 0x000000, "Member 'BlightPowerStateComponent_GetDashTokensRemaining::ReturnValue' has a wrong offset!");

// Function TheBlight.BlightPowerStateComponent.GetLookAngleDegrees
// 0x0004 (0x0004 - 0x0000)
struct BlightPowerStateComponent_GetLookAngleDegrees final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlightPowerStateComponent_GetLookAngleDegrees) == 0x000004, "Wrong alignment on BlightPowerStateComponent_GetLookAngleDegrees");
static_assert(sizeof(BlightPowerStateComponent_GetLookAngleDegrees) == 0x000004, "Wrong size on BlightPowerStateComponent_GetLookAngleDegrees");
static_assert(offsetof(BlightPowerStateComponent_GetLookAngleDegrees, ReturnValue) == 0x000000, "Member 'BlightPowerStateComponent_GetLookAngleDegrees::ReturnValue' has a wrong offset!");

// Function TheBlight.BlightPowerStateComponent.GetPowerState
// 0x0001 (0x0001 - 0x0000)
struct BlightPowerStateComponent_GetPowerState final
{
public:
	EWallGrabState                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlightPowerStateComponent_GetPowerState) == 0x000001, "Wrong alignment on BlightPowerStateComponent_GetPowerState");
static_assert(sizeof(BlightPowerStateComponent_GetPowerState) == 0x000001, "Wrong size on BlightPowerStateComponent_GetPowerState");
static_assert(offsetof(BlightPowerStateComponent_GetPowerState, ReturnValue) == 0x000000, "Member 'BlightPowerStateComponent_GetPowerState::ReturnValue' has a wrong offset!");

// Function TheBlight.BlightPowerStateComponent.GetPowerStateByEnum
// 0x0010 (0x0010 - 0x0000)
struct BlightPowerStateComponent_GetPowerStateByEnum final
{
public:
	EWallGrabState                                stateEnum;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlightPowerState*                      ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlightPowerStateComponent_GetPowerStateByEnum) == 0x000008, "Wrong alignment on BlightPowerStateComponent_GetPowerStateByEnum");
static_assert(sizeof(BlightPowerStateComponent_GetPowerStateByEnum) == 0x000010, "Wrong size on BlightPowerStateComponent_GetPowerStateByEnum");
static_assert(offsetof(BlightPowerStateComponent_GetPowerStateByEnum, stateEnum) == 0x000000, "Member 'BlightPowerStateComponent_GetPowerStateByEnum::stateEnum' has a wrong offset!");
static_assert(offsetof(BlightPowerStateComponent_GetPowerStateByEnum, ReturnValue) == 0x000008, "Member 'BlightPowerStateComponent_GetPowerStateByEnum::ReturnValue' has a wrong offset!");

// Function TheBlight.BlightPowerStateComponent.GetStateTimeElapsed
// 0x0004 (0x0004 - 0x0000)
struct BlightPowerStateComponent_GetStateTimeElapsed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlightPowerStateComponent_GetStateTimeElapsed) == 0x000004, "Wrong alignment on BlightPowerStateComponent_GetStateTimeElapsed");
static_assert(sizeof(BlightPowerStateComponent_GetStateTimeElapsed) == 0x000004, "Wrong size on BlightPowerStateComponent_GetStateTimeElapsed");
static_assert(offsetof(BlightPowerStateComponent_GetStateTimeElapsed, ReturnValue) == 0x000000, "Member 'BlightPowerStateComponent_GetStateTimeElapsed::ReturnValue' has a wrong offset!");

// Function TheBlight.BlightPowerStateComponent.GetStateTimer
// 0x0008 (0x0008 - 0x0000)
struct BlightPowerStateComponent_GetStateTimer final
{
public:
	class UTimerObject*                           ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlightPowerStateComponent_GetStateTimer) == 0x000008, "Wrong alignment on BlightPowerStateComponent_GetStateTimer");
static_assert(sizeof(BlightPowerStateComponent_GetStateTimer) == 0x000008, "Wrong size on BlightPowerStateComponent_GetStateTimer");
static_assert(offsetof(BlightPowerStateComponent_GetStateTimer, ReturnValue) == 0x000000, "Member 'BlightPowerStateComponent_GetStateTimer::ReturnValue' has a wrong offset!");

// Function TheBlight.BlightPowerStateComponent.GetStateTimeRemaining
// 0x0004 (0x0004 - 0x0000)
struct BlightPowerStateComponent_GetStateTimeRemaining final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlightPowerStateComponent_GetStateTimeRemaining) == 0x000004, "Wrong alignment on BlightPowerStateComponent_GetStateTimeRemaining");
static_assert(sizeof(BlightPowerStateComponent_GetStateTimeRemaining) == 0x000004, "Wrong size on BlightPowerStateComponent_GetStateTimeRemaining");
static_assert(offsetof(BlightPowerStateComponent_GetStateTimeRemaining, ReturnValue) == 0x000000, "Member 'BlightPowerStateComponent_GetStateTimeRemaining::ReturnValue' has a wrong offset!");

// Function TheBlight.DragonsGrip.Multicast_OnRevealSurvivor
// 0x0008 (0x0008 - 0x0000)
struct DragonsGrip_Multicast_OnRevealSurvivor final
{
public:
	class ADBDPlayer*                             survivor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DragonsGrip_Multicast_OnRevealSurvivor) == 0x000008, "Wrong alignment on DragonsGrip_Multicast_OnRevealSurvivor");
static_assert(sizeof(DragonsGrip_Multicast_OnRevealSurvivor) == 0x000008, "Wrong size on DragonsGrip_Multicast_OnRevealSurvivor");
static_assert(offsetof(DragonsGrip_Multicast_OnRevealSurvivor, survivor) == 0x000000, "Member 'DragonsGrip_Multicast_OnRevealSurvivor::survivor' has a wrong offset!");

// Function TheBlight.DragonsGrip.OnRevealSurvivor
// 0x0008 (0x0008 - 0x0000)
struct DragonsGrip_OnRevealSurvivor final
{
public:
	class ADBDPlayer*                             instigator;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DragonsGrip_OnRevealSurvivor) == 0x000008, "Wrong alignment on DragonsGrip_OnRevealSurvivor");
static_assert(sizeof(DragonsGrip_OnRevealSurvivor) == 0x000008, "Wrong size on DragonsGrip_OnRevealSurvivor");
static_assert(offsetof(DragonsGrip_OnRevealSurvivor, instigator) == 0x000000, "Member 'DragonsGrip_OnRevealSurvivor::instigator' has a wrong offset!");

// Function TheBlight.HexUndying.Authority_OnCamperCleansedHexPerk
// 0x0038 (0x0038 - 0x0000)
struct HexUndying_Authority_OnCamperCleansedHexPerk final
{
public:
	struct FGameplayTag                           gameplayTag;                                       // 0x0000(0x000C)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         gameEventData;                                     // 0x0010(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(HexUndying_Authority_OnCamperCleansedHexPerk) == 0x000008, "Wrong alignment on HexUndying_Authority_OnCamperCleansedHexPerk");
static_assert(sizeof(HexUndying_Authority_OnCamperCleansedHexPerk) == 0x000038, "Wrong size on HexUndying_Authority_OnCamperCleansedHexPerk");
static_assert(offsetof(HexUndying_Authority_OnCamperCleansedHexPerk, gameplayTag) == 0x000000, "Member 'HexUndying_Authority_OnCamperCleansedHexPerk::gameplayTag' has a wrong offset!");
static_assert(offsetof(HexUndying_Authority_OnCamperCleansedHexPerk, gameEventData) == 0x000010, "Member 'HexUndying_Authority_OnCamperCleansedHexPerk::gameEventData' has a wrong offset!");

// Function TheBlight.HexUndying.Authority_OnSurvivorAdded
// 0x0008 (0x0008 - 0x0000)
struct HexUndying_Authority_OnSurvivorAdded final
{
public:
	class ACamperPlayer*                          survivor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HexUndying_Authority_OnSurvivorAdded) == 0x000008, "Wrong alignment on HexUndying_Authority_OnSurvivorAdded");
static_assert(sizeof(HexUndying_Authority_OnSurvivorAdded) == 0x000008, "Wrong size on HexUndying_Authority_OnSurvivorAdded");
static_assert(offsetof(HexUndying_Authority_OnSurvivorAdded, survivor) == 0x000000, "Member 'HexUndying_Authority_OnSurvivorAdded::survivor' has a wrong offset!");

// Function TheBlight.HexUndying.Authority_UpdateHexPerkStatusView
// 0x0010 (0x0010 - 0x0000)
struct HexUndying_Authority_UpdateHexPerkStatusView final
{
public:
	class UGameplayModifierContainer*             gameplayModifierContainer;                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isApplicable;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HexUndying_Authority_UpdateHexPerkStatusView) == 0x000008, "Wrong alignment on HexUndying_Authority_UpdateHexPerkStatusView");
static_assert(sizeof(HexUndying_Authority_UpdateHexPerkStatusView) == 0x000010, "Wrong size on HexUndying_Authority_UpdateHexPerkStatusView");
static_assert(offsetof(HexUndying_Authority_UpdateHexPerkStatusView, gameplayModifierContainer) == 0x000000, "Member 'HexUndying_Authority_UpdateHexPerkStatusView::gameplayModifierContainer' has a wrong offset!");
static_assert(offsetof(HexUndying_Authority_UpdateHexPerkStatusView, isApplicable) == 0x000008, "Member 'HexUndying_Authority_UpdateHexPerkStatusView::isApplicable' has a wrong offset!");

// Function TheBlight.Visionary.GetCooldownAtLevel
// 0x0004 (0x0004 - 0x0000)
struct Visionary_GetCooldownAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Visionary_GetCooldownAtLevel) == 0x000004, "Wrong alignment on Visionary_GetCooldownAtLevel");
static_assert(sizeof(Visionary_GetCooldownAtLevel) == 0x000004, "Wrong size on Visionary_GetCooldownAtLevel");
static_assert(offsetof(Visionary_GetCooldownAtLevel, ReturnValue) == 0x000000, "Member 'Visionary_GetCooldownAtLevel::ReturnValue' has a wrong offset!");

// Function TheBlight.Visionary.GetRangeAtLevel
// 0x0004 (0x0004 - 0x0000)
struct Visionary_GetRangeAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Visionary_GetRangeAtLevel) == 0x000004, "Wrong alignment on Visionary_GetRangeAtLevel");
static_assert(sizeof(Visionary_GetRangeAtLevel) == 0x000004, "Wrong size on Visionary_GetRangeAtLevel");
static_assert(offsetof(Visionary_GetRangeAtLevel, ReturnValue) == 0x000000, "Member 'Visionary_GetRangeAtLevel::ReturnValue' has a wrong offset!");

}

