#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheCannibal

#include "Basic.hpp"


namespace SDK::Params
{

// Function TheCannibal.BBQAndChili.GetMinDistanceToKillerByLevel
// 0x0008 (0x0008 - 0x0000)
struct BBQAndChili_GetMinDistanceToKillerByLevel final
{
public:
	int32                                         level;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BBQAndChili_GetMinDistanceToKillerByLevel) == 0x000004, "Wrong alignment on BBQAndChili_GetMinDistanceToKillerByLevel");
static_assert(sizeof(BBQAndChili_GetMinDistanceToKillerByLevel) == 0x000008, "Wrong size on BBQAndChili_GetMinDistanceToKillerByLevel");
static_assert(offsetof(BBQAndChili_GetMinDistanceToKillerByLevel, level) == 0x000000, "Member 'BBQAndChili_GetMinDistanceToKillerByLevel::level' has a wrong offset!");
static_assert(offsetof(BBQAndChili_GetMinDistanceToKillerByLevel, ReturnValue) == 0x000004, "Member 'BBQAndChili_GetMinDistanceToKillerByLevel::ReturnValue' has a wrong offset!");

// Function TheCannibal.CannibalChainsawPowerComponent.OnRep_NumPowerCharges
// 0x0004 (0x0004 - 0x0000)
struct CannibalChainsawPowerComponent_OnRep_NumPowerCharges final
{
public:
	int32                                         previousNumPowerCharges;                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CannibalChainsawPowerComponent_OnRep_NumPowerCharges) == 0x000004, "Wrong alignment on CannibalChainsawPowerComponent_OnRep_NumPowerCharges");
static_assert(sizeof(CannibalChainsawPowerComponent_OnRep_NumPowerCharges) == 0x000004, "Wrong size on CannibalChainsawPowerComponent_OnRep_NumPowerCharges");
static_assert(offsetof(CannibalChainsawPowerComponent_OnRep_NumPowerCharges, previousNumPowerCharges) == 0x000000, "Member 'CannibalChainsawPowerComponent_OnRep_NumPowerCharges::previousNumPowerCharges' has a wrong offset!");

// Function TheCannibal.CannibalChainsawPowerComponent.GetNumberOfChainsawPowerCharges
// 0x0004 (0x0004 - 0x0000)
struct CannibalChainsawPowerComponent_GetNumberOfChainsawPowerCharges final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CannibalChainsawPowerComponent_GetNumberOfChainsawPowerCharges) == 0x000004, "Wrong alignment on CannibalChainsawPowerComponent_GetNumberOfChainsawPowerCharges");
static_assert(sizeof(CannibalChainsawPowerComponent_GetNumberOfChainsawPowerCharges) == 0x000004, "Wrong size on CannibalChainsawPowerComponent_GetNumberOfChainsawPowerCharges");
static_assert(offsetof(CannibalChainsawPowerComponent_GetNumberOfChainsawPowerCharges, ReturnValue) == 0x000000, "Member 'CannibalChainsawPowerComponent_GetNumberOfChainsawPowerCharges::ReturnValue' has a wrong offset!");

// Function TheCannibal.CannibalPowerPresentationItemProgressComponent.SetCannibalChainsawPowerComponent
// 0x0008 (0x0008 - 0x0000)
struct CannibalPowerPresentationItemProgressComponent_SetCannibalChainsawPowerComponent final
{
public:
	class UCannibalChainsawPowerComponent*        cannibalPowerChainsawComponent;                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CannibalPowerPresentationItemProgressComponent_SetCannibalChainsawPowerComponent) == 0x000008, "Wrong alignment on CannibalPowerPresentationItemProgressComponent_SetCannibalChainsawPowerComponent");
static_assert(sizeof(CannibalPowerPresentationItemProgressComponent_SetCannibalChainsawPowerComponent) == 0x000008, "Wrong size on CannibalPowerPresentationItemProgressComponent_SetCannibalChainsawPowerComponent");
static_assert(offsetof(CannibalPowerPresentationItemProgressComponent_SetCannibalChainsawPowerComponent, cannibalPowerChainsawComponent) == 0x000000, "Member 'CannibalPowerPresentationItemProgressComponent_SetCannibalChainsawPowerComponent::cannibalPowerChainsawComponent' has a wrong offset!");

}

