#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheClown

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "TheClown_structs.hpp"
#include "DeadByDaylight_structs.hpp"


namespace SDK::Params
{

// Function TheClown.BaseGasCloudProjectile.Authority_SetCumulativeLifetime
// 0x0004 (0x0004 - 0x0000)
struct BaseGasCloudProjectile_Authority_SetCumulativeLifetime final
{
public:
	float                                         value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseGasCloudProjectile_Authority_SetCumulativeLifetime) == 0x000004, "Wrong alignment on BaseGasCloudProjectile_Authority_SetCumulativeLifetime");
static_assert(sizeof(BaseGasCloudProjectile_Authority_SetCumulativeLifetime) == 0x000004, "Wrong size on BaseGasCloudProjectile_Authority_SetCumulativeLifetime");
static_assert(offsetof(BaseGasCloudProjectile_Authority_SetCumulativeLifetime, value) == 0x000000, "Member 'BaseGasCloudProjectile_Authority_SetCumulativeLifetime::value' has a wrong offset!");

// Function TheClown.BaseGasCloudProjectile.GetGasType
// 0x0001 (0x0001 - 0x0000)
struct BaseGasCloudProjectile_GetGasType final
{
public:
	EBombType                                     ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseGasCloudProjectile_GetGasType) == 0x000001, "Wrong alignment on BaseGasCloudProjectile_GetGasType");
static_assert(sizeof(BaseGasCloudProjectile_GetGasType) == 0x000001, "Wrong size on BaseGasCloudProjectile_GetGasType");
static_assert(offsetof(BaseGasCloudProjectile_GetGasType, ReturnValue) == 0x000000, "Member 'BaseGasCloudProjectile_GetGasType::ReturnValue' has a wrong offset!");

// Function TheClown.BaseGasCloudProjectile.IsDissipating
// 0x0001 (0x0001 - 0x0000)
struct BaseGasCloudProjectile_IsDissipating final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseGasCloudProjectile_IsDissipating) == 0x000001, "Wrong alignment on BaseGasCloudProjectile_IsDissipating");
static_assert(sizeof(BaseGasCloudProjectile_IsDissipating) == 0x000001, "Wrong size on BaseGasCloudProjectile_IsDissipating");
static_assert(offsetof(BaseGasCloudProjectile_IsDissipating, ReturnValue) == 0x000000, "Member 'BaseGasCloudProjectile_IsDissipating::ReturnValue' has a wrong offset!");

// Function TheClown.BaseGasCloudProjectile.IsSurvivorDetectionEnabled
// 0x0001 (0x0001 - 0x0000)
struct BaseGasCloudProjectile_IsSurvivorDetectionEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseGasCloudProjectile_IsSurvivorDetectionEnabled) == 0x000001, "Wrong alignment on BaseGasCloudProjectile_IsSurvivorDetectionEnabled");
static_assert(sizeof(BaseGasCloudProjectile_IsSurvivorDetectionEnabled) == 0x000001, "Wrong size on BaseGasCloudProjectile_IsSurvivorDetectionEnabled");
static_assert(offsetof(BaseGasCloudProjectile_IsSurvivorDetectionEnabled, ReturnValue) == 0x000000, "Member 'BaseGasCloudProjectile_IsSurvivorDetectionEnabled::ReturnValue' has a wrong offset!");

// Function TheClown.BaseGasCloudProjectile.OnAcquiredChanged
// 0x0001 (0x0001 - 0x0000)
struct BaseGasCloudProjectile_OnAcquiredChanged final
{
public:
	bool                                          acquired;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseGasCloudProjectile_OnAcquiredChanged) == 0x000001, "Wrong alignment on BaseGasCloudProjectile_OnAcquiredChanged");
static_assert(sizeof(BaseGasCloudProjectile_OnAcquiredChanged) == 0x000001, "Wrong size on BaseGasCloudProjectile_OnAcquiredChanged");
static_assert(offsetof(BaseGasCloudProjectile_OnAcquiredChanged, acquired) == 0x000000, "Member 'BaseGasCloudProjectile_OnAcquiredChanged::acquired' has a wrong offset!");

// Function TheClown.BaseGasCloudProjectile.OnDelayedActivationStart
// 0x0004 (0x0004 - 0x0000)
struct BaseGasCloudProjectile_OnDelayedActivationStart final
{
public:
	float                                         delay;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseGasCloudProjectile_OnDelayedActivationStart) == 0x000004, "Wrong alignment on BaseGasCloudProjectile_OnDelayedActivationStart");
static_assert(sizeof(BaseGasCloudProjectile_OnDelayedActivationStart) == 0x000004, "Wrong size on BaseGasCloudProjectile_OnDelayedActivationStart");
static_assert(offsetof(BaseGasCloudProjectile_OnDelayedActivationStart, delay) == 0x000000, "Member 'BaseGasCloudProjectile_OnDelayedActivationStart::delay' has a wrong offset!");

// Function TheClown.BaseGasCloudProjectile.OnOverlapBegin
// 0x00B0 (0x00B0 - 0x0000)
struct BaseGasCloudProjectile_OnOverlapBegin final
{
public:
	class UPrimitiveComponent*                    hitComp;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 otherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    otherComponent;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         otherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             sweepResult;                                       // 0x0020(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseGasCloudProjectile_OnOverlapBegin) == 0x000008, "Wrong alignment on BaseGasCloudProjectile_OnOverlapBegin");
static_assert(sizeof(BaseGasCloudProjectile_OnOverlapBegin) == 0x0000B0, "Wrong size on BaseGasCloudProjectile_OnOverlapBegin");
static_assert(offsetof(BaseGasCloudProjectile_OnOverlapBegin, hitComp) == 0x000000, "Member 'BaseGasCloudProjectile_OnOverlapBegin::hitComp' has a wrong offset!");
static_assert(offsetof(BaseGasCloudProjectile_OnOverlapBegin, otherActor) == 0x000008, "Member 'BaseGasCloudProjectile_OnOverlapBegin::otherActor' has a wrong offset!");
static_assert(offsetof(BaseGasCloudProjectile_OnOverlapBegin, otherComponent) == 0x000010, "Member 'BaseGasCloudProjectile_OnOverlapBegin::otherComponent' has a wrong offset!");
static_assert(offsetof(BaseGasCloudProjectile_OnOverlapBegin, otherBodyIndex) == 0x000018, "Member 'BaseGasCloudProjectile_OnOverlapBegin::otherBodyIndex' has a wrong offset!");
static_assert(offsetof(BaseGasCloudProjectile_OnOverlapBegin, bFromSweep) == 0x00001C, "Member 'BaseGasCloudProjectile_OnOverlapBegin::bFromSweep' has a wrong offset!");
static_assert(offsetof(BaseGasCloudProjectile_OnOverlapBegin, sweepResult) == 0x000020, "Member 'BaseGasCloudProjectile_OnOverlapBegin::sweepResult' has a wrong offset!");

// Function TheClown.BaseGasCloudProjectile.OnOverlapEnd
// 0x0020 (0x0020 - 0x0000)
struct BaseGasCloudProjectile_OnOverlapEnd final
{
public:
	class UPrimitiveComponent*                    hitComp;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 otherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    otherComponent;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         otherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BaseGasCloudProjectile_OnOverlapEnd) == 0x000008, "Wrong alignment on BaseGasCloudProjectile_OnOverlapEnd");
static_assert(sizeof(BaseGasCloudProjectile_OnOverlapEnd) == 0x000020, "Wrong size on BaseGasCloudProjectile_OnOverlapEnd");
static_assert(offsetof(BaseGasCloudProjectile_OnOverlapEnd, hitComp) == 0x000000, "Member 'BaseGasCloudProjectile_OnOverlapEnd::hitComp' has a wrong offset!");
static_assert(offsetof(BaseGasCloudProjectile_OnOverlapEnd, otherActor) == 0x000008, "Member 'BaseGasCloudProjectile_OnOverlapEnd::otherActor' has a wrong offset!");
static_assert(offsetof(BaseGasCloudProjectile_OnOverlapEnd, otherComponent) == 0x000010, "Member 'BaseGasCloudProjectile_OnOverlapEnd::otherComponent' has a wrong offset!");
static_assert(offsetof(BaseGasCloudProjectile_OnOverlapEnd, otherBodyIndex) == 0x000018, "Member 'BaseGasCloudProjectile_OnOverlapEnd::otherBodyIndex' has a wrong offset!");

// Function TheClown.BaseGasCloudProjectile.SetGasAudioActive
// 0x0001 (0x0001 - 0x0000)
struct BaseGasCloudProjectile_SetGasAudioActive final
{
public:
	bool                                          activated;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseGasCloudProjectile_SetGasAudioActive) == 0x000001, "Wrong alignment on BaseGasCloudProjectile_SetGasAudioActive");
static_assert(sizeof(BaseGasCloudProjectile_SetGasAudioActive) == 0x000001, "Wrong size on BaseGasCloudProjectile_SetGasAudioActive");
static_assert(offsetof(BaseGasCloudProjectile_SetGasAudioActive, activated) == 0x000000, "Member 'BaseGasCloudProjectile_SetGasAudioActive::activated' has a wrong offset!");

// Function TheClown.BaseGasCloudProjectile.SetIsDissipating
// 0x0001 (0x0001 - 0x0000)
struct BaseGasCloudProjectile_SetIsDissipating final
{
public:
	bool                                          isDissipating;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseGasCloudProjectile_SetIsDissipating) == 0x000001, "Wrong alignment on BaseGasCloudProjectile_SetIsDissipating");
static_assert(sizeof(BaseGasCloudProjectile_SetIsDissipating) == 0x000001, "Wrong size on BaseGasCloudProjectile_SetIsDissipating");
static_assert(offsetof(BaseGasCloudProjectile_SetIsDissipating, isDissipating) == 0x000000, "Member 'BaseGasCloudProjectile_SetIsDissipating::isDissipating' has a wrong offset!");

// Function TheClown.BaseGasCloudProjectile.Authority_GetCumulativeLifetime
// 0x0004 (0x0004 - 0x0000)
struct BaseGasCloudProjectile_Authority_GetCumulativeLifetime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseGasCloudProjectile_Authority_GetCumulativeLifetime) == 0x000004, "Wrong alignment on BaseGasCloudProjectile_Authority_GetCumulativeLifetime");
static_assert(sizeof(BaseGasCloudProjectile_Authority_GetCumulativeLifetime) == 0x000004, "Wrong size on BaseGasCloudProjectile_Authority_GetCumulativeLifetime");
static_assert(offsetof(BaseGasCloudProjectile_Authority_GetCumulativeLifetime, ReturnValue) == 0x000000, "Member 'BaseGasCloudProjectile_Authority_GetCumulativeLifetime::ReturnValue' has a wrong offset!");

// Function TheClown.BoilOverPerk.Authority_OnPlayerPickedUpEnd
// 0x0008 (0x0008 - 0x0000)
struct BoilOverPerk_Authority_OnPlayerPickedUpEnd final
{
public:
	class ADBDPlayer*                             picker;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BoilOverPerk_Authority_OnPlayerPickedUpEnd) == 0x000008, "Wrong alignment on BoilOverPerk_Authority_OnPlayerPickedUpEnd");
static_assert(sizeof(BoilOverPerk_Authority_OnPlayerPickedUpEnd) == 0x000008, "Wrong size on BoilOverPerk_Authority_OnPlayerPickedUpEnd");
static_assert(offsetof(BoilOverPerk_Authority_OnPlayerPickedUpEnd, picker) == 0x000000, "Member 'BoilOverPerk_Authority_OnPlayerPickedUpEnd::picker' has a wrong offset!");

// Function TheClown.BoilOverPerk.GetAdditionnalWigglingProgressAtLevel
// 0x0004 (0x0004 - 0x0000)
struct BoilOverPerk_GetAdditionnalWigglingProgressAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BoilOverPerk_GetAdditionnalWigglingProgressAtLevel) == 0x000004, "Wrong alignment on BoilOverPerk_GetAdditionnalWigglingProgressAtLevel");
static_assert(sizeof(BoilOverPerk_GetAdditionnalWigglingProgressAtLevel) == 0x000004, "Wrong size on BoilOverPerk_GetAdditionnalWigglingProgressAtLevel");
static_assert(offsetof(BoilOverPerk_GetAdditionnalWigglingProgressAtLevel, ReturnValue) == 0x000000, "Member 'BoilOverPerk_GetAdditionnalWigglingProgressAtLevel::ReturnValue' has a wrong offset!");

// Function TheClown.BoilOverPerk.GetGreatHeightsValue
// 0x0004 (0x0004 - 0x0000)
struct BoilOverPerk_GetGreatHeightsValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BoilOverPerk_GetGreatHeightsValue) == 0x000004, "Wrong alignment on BoilOverPerk_GetGreatHeightsValue");
static_assert(sizeof(BoilOverPerk_GetGreatHeightsValue) == 0x000004, "Wrong size on BoilOverPerk_GetGreatHeightsValue");
static_assert(offsetof(BoilOverPerk_GetGreatHeightsValue, ReturnValue) == 0x000000, "Member 'BoilOverPerk_GetGreatHeightsValue::ReturnValue' has a wrong offset!");

// Function TheClown.BombLauncher.LocalLaunch
// 0x0004 (0x0004 - 0x0000)
struct BombLauncher_LocalLaunch final
{
public:
	float                                         percentThrowStrength;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BombLauncher_LocalLaunch) == 0x000004, "Wrong alignment on BombLauncher_LocalLaunch");
static_assert(sizeof(BombLauncher_LocalLaunch) == 0x000004, "Wrong size on BombLauncher_LocalLaunch");
static_assert(offsetof(BombLauncher_LocalLaunch, percentThrowStrength) == 0x000000, "Member 'BombLauncher_LocalLaunch::percentThrowStrength' has a wrong offset!");

// Function TheClown.BombLauncher.SetPercentThrowStrength
// 0x0004 (0x0004 - 0x0000)
struct BombLauncher_SetPercentThrowStrength final
{
public:
	float                                         throwStrength;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BombLauncher_SetPercentThrowStrength) == 0x000004, "Wrong alignment on BombLauncher_SetPercentThrowStrength");
static_assert(sizeof(BombLauncher_SetPercentThrowStrength) == 0x000004, "Wrong size on BombLauncher_SetPercentThrowStrength");
static_assert(offsetof(BombLauncher_SetPercentThrowStrength, throwStrength) == 0x000000, "Member 'BombLauncher_SetPercentThrowStrength::throwStrength' has a wrong offset!");

// Function TheClown.BombLauncher.SetProjectilePitchCurve
// 0x0008 (0x0008 - 0x0000)
struct BombLauncher_SetProjectilePitchCurve final
{
public:
	class UCurveFloat*                            newProjectilePitchCurve;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BombLauncher_SetProjectilePitchCurve) == 0x000008, "Wrong alignment on BombLauncher_SetProjectilePitchCurve");
static_assert(sizeof(BombLauncher_SetProjectilePitchCurve) == 0x000008, "Wrong size on BombLauncher_SetProjectilePitchCurve");
static_assert(offsetof(BombLauncher_SetProjectilePitchCurve, newProjectilePitchCurve) == 0x000000, "Member 'BombLauncher_SetProjectilePitchCurve::newProjectilePitchCurve' has a wrong offset!");

// Function TheClown.BombLauncher.SetProjectileSpeedCurve
// 0x0008 (0x0008 - 0x0000)
struct BombLauncher_SetProjectileSpeedCurve final
{
public:
	class UCurveFloat*                            newProjectileSpeedCurve;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BombLauncher_SetProjectileSpeedCurve) == 0x000008, "Wrong alignment on BombLauncher_SetProjectileSpeedCurve");
static_assert(sizeof(BombLauncher_SetProjectileSpeedCurve) == 0x000008, "Wrong size on BombLauncher_SetProjectileSpeedCurve");
static_assert(offsetof(BombLauncher_SetProjectileSpeedCurve, newProjectileSpeedCurve) == 0x000000, "Member 'BombLauncher_SetProjectileSpeedCurve::newProjectileSpeedCurve' has a wrong offset!");

// Function TheClown.BombLauncher.GetCurrentBombType
// 0x0001 (0x0001 - 0x0000)
struct BombLauncher_GetCurrentBombType final
{
public:
	EBombType                                     ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BombLauncher_GetCurrentBombType) == 0x000001, "Wrong alignment on BombLauncher_GetCurrentBombType");
static_assert(sizeof(BombLauncher_GetCurrentBombType) == 0x000001, "Wrong size on BombLauncher_GetCurrentBombType");
static_assert(offsetof(BombLauncher_GetCurrentBombType, ReturnValue) == 0x000000, "Member 'BombLauncher_GetCurrentBombType::ReturnValue' has a wrong offset!");

// Function TheClown.BombLauncher.GetPercentThrowStrenght
// 0x0004 (0x0004 - 0x0000)
struct BombLauncher_GetPercentThrowStrenght final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BombLauncher_GetPercentThrowStrenght) == 0x000004, "Wrong alignment on BombLauncher_GetPercentThrowStrenght");
static_assert(sizeof(BombLauncher_GetPercentThrowStrenght) == 0x000004, "Wrong size on BombLauncher_GetPercentThrowStrenght");
static_assert(offsetof(BombLauncher_GetPercentThrowStrenght, ReturnValue) == 0x000000, "Member 'BombLauncher_GetPercentThrowStrenght::ReturnValue' has a wrong offset!");

// Function TheClown.BombLauncher.IsBombFullyCharged
// 0x0001 (0x0001 - 0x0000)
struct BombLauncher_IsBombFullyCharged final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BombLauncher_IsBombFullyCharged) == 0x000001, "Wrong alignment on BombLauncher_IsBombFullyCharged");
static_assert(sizeof(BombLauncher_IsBombFullyCharged) == 0x000001, "Wrong size on BombLauncher_IsBombFullyCharged");
static_assert(offsetof(BombLauncher_IsBombFullyCharged, ReturnValue) == 0x000000, "Member 'BombLauncher_IsBombFullyCharged::ReturnValue' has a wrong offset!");

// Function TheClown.DanceWithMePerk.Authority_OnPerkActivate
// 0x0038 (0x0038 - 0x0000)
struct DanceWithMePerk_Authority_OnPerkActivate final
{
public:
	struct FGameplayTag                           gameplayTag;                                       // 0x0000(0x000C)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         gameEventData;                                     // 0x0010(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(DanceWithMePerk_Authority_OnPerkActivate) == 0x000008, "Wrong alignment on DanceWithMePerk_Authority_OnPerkActivate");
static_assert(sizeof(DanceWithMePerk_Authority_OnPerkActivate) == 0x000038, "Wrong size on DanceWithMePerk_Authority_OnPerkActivate");
static_assert(offsetof(DanceWithMePerk_Authority_OnPerkActivate, gameplayTag) == 0x000000, "Member 'DanceWithMePerk_Authority_OnPerkActivate::gameplayTag' has a wrong offset!");
static_assert(offsetof(DanceWithMePerk_Authority_OnPerkActivate, gameEventData) == 0x000010, "Member 'DanceWithMePerk_Authority_OnPerkActivate::gameEventData' has a wrong offset!");

// Function TheClown.GasDizzyCosmeticEffect.Cosmetic_SetDizzyEffectActive
// 0x0001 (0x0001 - 0x0000)
struct GasDizzyCosmeticEffect_Cosmetic_SetDizzyEffectActive final
{
public:
	bool                                          isActive;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GasDizzyCosmeticEffect_Cosmetic_SetDizzyEffectActive) == 0x000001, "Wrong alignment on GasDizzyCosmeticEffect_Cosmetic_SetDizzyEffectActive");
static_assert(sizeof(GasDizzyCosmeticEffect_Cosmetic_SetDizzyEffectActive) == 0x000001, "Wrong size on GasDizzyCosmeticEffect_Cosmetic_SetDizzyEffectActive");
static_assert(offsetof(GasDizzyCosmeticEffect_Cosmetic_SetDizzyEffectActive, isActive) == 0x000000, "Member 'GasDizzyCosmeticEffect_Cosmetic_SetDizzyEffectActive::isActive' has a wrong offset!");

// Function TheClown.GasDizzyCosmeticEffect.SetWantsDizzyEffectActive
// 0x0001 (0x0001 - 0x0000)
struct GasDizzyCosmeticEffect_SetWantsDizzyEffectActive final
{
public:
	bool                                          isActive;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GasDizzyCosmeticEffect_SetWantsDizzyEffectActive) == 0x000001, "Wrong alignment on GasDizzyCosmeticEffect_SetWantsDizzyEffectActive");
static_assert(sizeof(GasDizzyCosmeticEffect_SetWantsDizzyEffectActive) == 0x000001, "Wrong size on GasDizzyCosmeticEffect_SetWantsDizzyEffectActive");
static_assert(offsetof(GasDizzyCosmeticEffect_SetWantsDizzyEffectActive, isActive) == 0x000000, "Member 'GasDizzyCosmeticEffect_SetWantsDizzyEffectActive::isActive' has a wrong offset!");

// Function TheClown.GassedStatusEffect.Authority_AddOverlappingCloud
// 0x0008 (0x0008 - 0x0000)
struct GassedStatusEffect_Authority_AddOverlappingCloud final
{
public:
	class ABaseGasCloudProjectile*                cloud;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GassedStatusEffect_Authority_AddOverlappingCloud) == 0x000008, "Wrong alignment on GassedStatusEffect_Authority_AddOverlappingCloud");
static_assert(sizeof(GassedStatusEffect_Authority_AddOverlappingCloud) == 0x000008, "Wrong size on GassedStatusEffect_Authority_AddOverlappingCloud");
static_assert(offsetof(GassedStatusEffect_Authority_AddOverlappingCloud, cloud) == 0x000000, "Member 'GassedStatusEffect_Authority_AddOverlappingCloud::cloud' has a wrong offset!");

// Function TheClown.GassedStatusEffect.Authority_RemoveOverlappingCloud
// 0x0008 (0x0008 - 0x0000)
struct GassedStatusEffect_Authority_RemoveOverlappingCloud final
{
public:
	class ABaseGasCloudProjectile*                cloud;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GassedStatusEffect_Authority_RemoveOverlappingCloud) == 0x000008, "Wrong alignment on GassedStatusEffect_Authority_RemoveOverlappingCloud");
static_assert(sizeof(GassedStatusEffect_Authority_RemoveOverlappingCloud) == 0x000008, "Wrong size on GassedStatusEffect_Authority_RemoveOverlappingCloud");
static_assert(offsetof(GassedStatusEffect_Authority_RemoveOverlappingCloud, cloud) == 0x000000, "Member 'GassedStatusEffect_Authority_RemoveOverlappingCloud::cloud' has a wrong offset!");

// Function TheClown.GassedStatusEffect.Authority_SetIsInAntidoteCloud
// 0x0001 (0x0001 - 0x0000)
struct GassedStatusEffect_Authority_SetIsInAntidoteCloud final
{
public:
	bool                                          value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GassedStatusEffect_Authority_SetIsInAntidoteCloud) == 0x000001, "Wrong alignment on GassedStatusEffect_Authority_SetIsInAntidoteCloud");
static_assert(sizeof(GassedStatusEffect_Authority_SetIsInAntidoteCloud) == 0x000001, "Wrong size on GassedStatusEffect_Authority_SetIsInAntidoteCloud");
static_assert(offsetof(GassedStatusEffect_Authority_SetIsInAntidoteCloud, value) == 0x000000, "Member 'GassedStatusEffect_Authority_SetIsInAntidoteCloud::value' has a wrong offset!");

// Function TheClown.GassedStatusEffect.Authority_SetIsInCloud
// 0x0001 (0x0001 - 0x0000)
struct GassedStatusEffect_Authority_SetIsInCloud final
{
public:
	bool                                          value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GassedStatusEffect_Authority_SetIsInCloud) == 0x000001, "Wrong alignment on GassedStatusEffect_Authority_SetIsInCloud");
static_assert(sizeof(GassedStatusEffect_Authority_SetIsInCloud) == 0x000001, "Wrong size on GassedStatusEffect_Authority_SetIsInCloud");
static_assert(offsetof(GassedStatusEffect_Authority_SetIsInCloud, value) == 0x000000, "Member 'GassedStatusEffect_Authority_SetIsInCloud::value' has a wrong offset!");

// Function TheClown.GassedStatusEffect.OnAntidoteEffectBegin
// 0x0004 (0x0004 - 0x0000)
struct GassedStatusEffect_OnAntidoteEffectBegin final
{
public:
	float                                         effectDuration;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GassedStatusEffect_OnAntidoteEffectBegin) == 0x000004, "Wrong alignment on GassedStatusEffect_OnAntidoteEffectBegin");
static_assert(sizeof(GassedStatusEffect_OnAntidoteEffectBegin) == 0x000004, "Wrong size on GassedStatusEffect_OnAntidoteEffectBegin");
static_assert(offsetof(GassedStatusEffect_OnAntidoteEffectBegin, effectDuration) == 0x000000, "Member 'GassedStatusEffect_OnAntidoteEffectBegin::effectDuration' has a wrong offset!");

// Function TheClown.GassedStatusEffect.OnAntidoteEffectEnd
// 0x0004 (0x0004 - 0x0000)
struct GassedStatusEffect_OnAntidoteEffectEnd final
{
public:
	float                                         durationSkipped;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GassedStatusEffect_OnAntidoteEffectEnd) == 0x000004, "Wrong alignment on GassedStatusEffect_OnAntidoteEffectEnd");
static_assert(sizeof(GassedStatusEffect_OnAntidoteEffectEnd) == 0x000004, "Wrong size on GassedStatusEffect_OnAntidoteEffectEnd");
static_assert(offsetof(GassedStatusEffect_OnAntidoteEffectEnd, durationSkipped) == 0x000000, "Member 'GassedStatusEffect_OnAntidoteEffectEnd::durationSkipped' has a wrong offset!");

// Function TheClown.GassedStatusEffect.OnDirectBottleHit
// 0x0001 (0x0001 - 0x0000)
struct GassedStatusEffect_OnDirectBottleHit final
{
public:
	EBombType                                     bottleType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GassedStatusEffect_OnDirectBottleHit) == 0x000001, "Wrong alignment on GassedStatusEffect_OnDirectBottleHit");
static_assert(sizeof(GassedStatusEffect_OnDirectBottleHit) == 0x000001, "Wrong size on GassedStatusEffect_OnDirectBottleHit");
static_assert(offsetof(GassedStatusEffect_OnDirectBottleHit, bottleType) == 0x000000, "Member 'GassedStatusEffect_OnDirectBottleHit::bottleType' has a wrong offset!");

// Function TheClown.GassedStatusEffect.OnToxinEffectBegin
// 0x0004 (0x0004 - 0x0000)
struct GassedStatusEffect_OnToxinEffectBegin final
{
public:
	float                                         effectDuration;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GassedStatusEffect_OnToxinEffectBegin) == 0x000004, "Wrong alignment on GassedStatusEffect_OnToxinEffectBegin");
static_assert(sizeof(GassedStatusEffect_OnToxinEffectBegin) == 0x000004, "Wrong size on GassedStatusEffect_OnToxinEffectBegin");
static_assert(offsetof(GassedStatusEffect_OnToxinEffectBegin, effectDuration) == 0x000000, "Member 'GassedStatusEffect_OnToxinEffectBegin::effectDuration' has a wrong offset!");

// Function TheClown.GassedStatusEffect.OnToxinEffectEnd
// 0x0004 (0x0004 - 0x0000)
struct GassedStatusEffect_OnToxinEffectEnd final
{
public:
	float                                         durationSkipped;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GassedStatusEffect_OnToxinEffectEnd) == 0x000004, "Wrong alignment on GassedStatusEffect_OnToxinEffectEnd");
static_assert(sizeof(GassedStatusEffect_OnToxinEffectEnd) == 0x000004, "Wrong size on GassedStatusEffect_OnToxinEffectEnd");
static_assert(offsetof(GassedStatusEffect_OnToxinEffectEnd, durationSkipped) == 0x000000, "Member 'GassedStatusEffect_OnToxinEffectEnd::durationSkipped' has a wrong offset!");

// Function TheClown.GassedStatusEffect.SetRemainingAntidoteDuration
// 0x0004 (0x0004 - 0x0000)
struct GassedStatusEffect_SetRemainingAntidoteDuration final
{
public:
	float                                         value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GassedStatusEffect_SetRemainingAntidoteDuration) == 0x000004, "Wrong alignment on GassedStatusEffect_SetRemainingAntidoteDuration");
static_assert(sizeof(GassedStatusEffect_SetRemainingAntidoteDuration) == 0x000004, "Wrong size on GassedStatusEffect_SetRemainingAntidoteDuration");
static_assert(offsetof(GassedStatusEffect_SetRemainingAntidoteDuration, value) == 0x000000, "Member 'GassedStatusEffect_SetRemainingAntidoteDuration::value' has a wrong offset!");

// Function TheClown.GassedStatusEffect.SetRemainingDuration
// 0x0004 (0x0004 - 0x0000)
struct GassedStatusEffect_SetRemainingDuration final
{
public:
	float                                         value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GassedStatusEffect_SetRemainingDuration) == 0x000004, "Wrong alignment on GassedStatusEffect_SetRemainingDuration");
static_assert(sizeof(GassedStatusEffect_SetRemainingDuration) == 0x000004, "Wrong size on GassedStatusEffect_SetRemainingDuration");
static_assert(offsetof(GassedStatusEffect_SetRemainingDuration, value) == 0x000000, "Member 'GassedStatusEffect_SetRemainingDuration::value' has a wrong offset!");

// Function TheClown.GassedStatusEffect.UpdateAntidoteEffectVFX
// 0x0004 (0x0004 - 0x0000)
struct GassedStatusEffect_UpdateAntidoteEffectVFX final
{
public:
	float                                         durationRemaining;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GassedStatusEffect_UpdateAntidoteEffectVFX) == 0x000004, "Wrong alignment on GassedStatusEffect_UpdateAntidoteEffectVFX");
static_assert(sizeof(GassedStatusEffect_UpdateAntidoteEffectVFX) == 0x000004, "Wrong size on GassedStatusEffect_UpdateAntidoteEffectVFX");
static_assert(offsetof(GassedStatusEffect_UpdateAntidoteEffectVFX, durationRemaining) == 0x000000, "Member 'GassedStatusEffect_UpdateAntidoteEffectVFX::durationRemaining' has a wrong offset!");

// Function TheClown.GassedStatusEffect.GetAntidoteCloudEffectDuration
// 0x0004 (0x0004 - 0x0000)
struct GassedStatusEffect_GetAntidoteCloudEffectDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GassedStatusEffect_GetAntidoteCloudEffectDuration) == 0x000004, "Wrong alignment on GassedStatusEffect_GetAntidoteCloudEffectDuration");
static_assert(sizeof(GassedStatusEffect_GetAntidoteCloudEffectDuration) == 0x000004, "Wrong size on GassedStatusEffect_GetAntidoteCloudEffectDuration");
static_assert(offsetof(GassedStatusEffect_GetAntidoteCloudEffectDuration, ReturnValue) == 0x000000, "Member 'GassedStatusEffect_GetAntidoteCloudEffectDuration::ReturnValue' has a wrong offset!");

// Function TheClown.GassedStatusEffect.GetCloudEffectDuration
// 0x0004 (0x0004 - 0x0000)
struct GassedStatusEffect_GetCloudEffectDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GassedStatusEffect_GetCloudEffectDuration) == 0x000004, "Wrong alignment on GassedStatusEffect_GetCloudEffectDuration");
static_assert(sizeof(GassedStatusEffect_GetCloudEffectDuration) == 0x000004, "Wrong size on GassedStatusEffect_GetCloudEffectDuration");
static_assert(offsetof(GassedStatusEffect_GetCloudEffectDuration, ReturnValue) == 0x000000, "Member 'GassedStatusEffect_GetCloudEffectDuration::ReturnValue' has a wrong offset!");

// Function TheClown.GassedStatusEffect.GetRemainingAntidoteDuration
// 0x0004 (0x0004 - 0x0000)
struct GassedStatusEffect_GetRemainingAntidoteDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GassedStatusEffect_GetRemainingAntidoteDuration) == 0x000004, "Wrong alignment on GassedStatusEffect_GetRemainingAntidoteDuration");
static_assert(sizeof(GassedStatusEffect_GetRemainingAntidoteDuration) == 0x000004, "Wrong size on GassedStatusEffect_GetRemainingAntidoteDuration");
static_assert(offsetof(GassedStatusEffect_GetRemainingAntidoteDuration, ReturnValue) == 0x000000, "Member 'GassedStatusEffect_GetRemainingAntidoteDuration::ReturnValue' has a wrong offset!");

// Function TheClown.GassedStatusEffect.GetRemainingDuration
// 0x0004 (0x0004 - 0x0000)
struct GassedStatusEffect_GetRemainingDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GassedStatusEffect_GetRemainingDuration) == 0x000004, "Wrong alignment on GassedStatusEffect_GetRemainingDuration");
static_assert(sizeof(GassedStatusEffect_GetRemainingDuration) == 0x000004, "Wrong size on GassedStatusEffect_GetRemainingDuration");
static_assert(offsetof(GassedStatusEffect_GetRemainingDuration, ReturnValue) == 0x000000, "Member 'GassedStatusEffect_GetRemainingDuration::ReturnValue' has a wrong offset!");

// Function TheClown.GassedStatusEffect.IsInAntidoteCloud
// 0x0001 (0x0001 - 0x0000)
struct GassedStatusEffect_IsInAntidoteCloud final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GassedStatusEffect_IsInAntidoteCloud) == 0x000001, "Wrong alignment on GassedStatusEffect_IsInAntidoteCloud");
static_assert(sizeof(GassedStatusEffect_IsInAntidoteCloud) == 0x000001, "Wrong size on GassedStatusEffect_IsInAntidoteCloud");
static_assert(offsetof(GassedStatusEffect_IsInAntidoteCloud, ReturnValue) == 0x000000, "Member 'GassedStatusEffect_IsInAntidoteCloud::ReturnValue' has a wrong offset!");

// Function TheClown.GassedStatusEffect.IsInCloud
// 0x0001 (0x0001 - 0x0000)
struct GassedStatusEffect_IsInCloud final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GassedStatusEffect_IsInCloud) == 0x000001, "Wrong alignment on GassedStatusEffect_IsInCloud");
static_assert(sizeof(GassedStatusEffect_IsInCloud) == 0x000001, "Wrong size on GassedStatusEffect_IsInCloud");
static_assert(offsetof(GassedStatusEffect_IsInCloud, ReturnValue) == 0x000000, "Member 'GassedStatusEffect_IsInCloud::ReturnValue' has a wrong offset!");

// Function TheClown.TheClownUtilities.CanBeGassed
// 0x0010 (0x0010 - 0x0000)
struct TheClownUtilities_CanBeGassed final
{
public:
	const class ADBDPlayer*                       player;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TheClownUtilities_CanBeGassed) == 0x000008, "Wrong alignment on TheClownUtilities_CanBeGassed");
static_assert(sizeof(TheClownUtilities_CanBeGassed) == 0x000010, "Wrong size on TheClownUtilities_CanBeGassed");
static_assert(offsetof(TheClownUtilities_CanBeGassed, player) == 0x000000, "Member 'TheClownUtilities_CanBeGassed::player' has a wrong offset!");
static_assert(offsetof(TheClownUtilities_CanBeGassed, ReturnValue) == 0x000008, "Member 'TheClownUtilities_CanBeGassed::ReturnValue' has a wrong offset!");

// Function TheClown.TheClownUtilities.GetActiveGasCloudTrackerComponent
// 0x0010 (0x0010 - 0x0000)
struct TheClownUtilities_GetActiveGasCloudTrackerComponent final
{
public:
	const class UObject*                          worldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActiveGasCloudTrackerComponent*        ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TheClownUtilities_GetActiveGasCloudTrackerComponent) == 0x000008, "Wrong alignment on TheClownUtilities_GetActiveGasCloudTrackerComponent");
static_assert(sizeof(TheClownUtilities_GetActiveGasCloudTrackerComponent) == 0x000010, "Wrong size on TheClownUtilities_GetActiveGasCloudTrackerComponent");
static_assert(offsetof(TheClownUtilities_GetActiveGasCloudTrackerComponent, worldContextObject) == 0x000000, "Member 'TheClownUtilities_GetActiveGasCloudTrackerComponent::worldContextObject' has a wrong offset!");
static_assert(offsetof(TheClownUtilities_GetActiveGasCloudTrackerComponent, ReturnValue) == 0x000008, "Member 'TheClownUtilities_GetActiveGasCloudTrackerComponent::ReturnValue' has a wrong offset!");

// Function TheClown.TheClownUtilities.GetGassedStatusEffect
// 0x0010 (0x0010 - 0x0000)
struct TheClownUtilities_GetGassedStatusEffect final
{
public:
	const class ADBDPlayer*                       player;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGassedStatusEffect*                    ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TheClownUtilities_GetGassedStatusEffect) == 0x000008, "Wrong alignment on TheClownUtilities_GetGassedStatusEffect");
static_assert(sizeof(TheClownUtilities_GetGassedStatusEffect) == 0x000010, "Wrong size on TheClownUtilities_GetGassedStatusEffect");
static_assert(offsetof(TheClownUtilities_GetGassedStatusEffect, player) == 0x000000, "Member 'TheClownUtilities_GetGassedStatusEffect::player' has a wrong offset!");
static_assert(offsetof(TheClownUtilities_GetGassedStatusEffect, ReturnValue) == 0x000008, "Member 'TheClownUtilities_GetGassedStatusEffect::ReturnValue' has a wrong offset!");

// Function TheClown.TheClownUtilities.IsAffectedByAntidote
// 0x0010 (0x0010 - 0x0000)
struct TheClownUtilities_IsAffectedByAntidote final
{
public:
	const class ADBDPlayer*                       player;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TheClownUtilities_IsAffectedByAntidote) == 0x000008, "Wrong alignment on TheClownUtilities_IsAffectedByAntidote");
static_assert(sizeof(TheClownUtilities_IsAffectedByAntidote) == 0x000010, "Wrong size on TheClownUtilities_IsAffectedByAntidote");
static_assert(offsetof(TheClownUtilities_IsAffectedByAntidote, player) == 0x000000, "Member 'TheClownUtilities_IsAffectedByAntidote::player' has a wrong offset!");
static_assert(offsetof(TheClownUtilities_IsAffectedByAntidote, ReturnValue) == 0x000008, "Member 'TheClownUtilities_IsAffectedByAntidote::ReturnValue' has a wrong offset!");

// Function TheClown.TheClownUtilities.IsGassed
// 0x0010 (0x0010 - 0x0000)
struct TheClownUtilities_IsGassed final
{
public:
	const class ADBDPlayer*                       player;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TheClownUtilities_IsGassed) == 0x000008, "Wrong alignment on TheClownUtilities_IsGassed");
static_assert(sizeof(TheClownUtilities_IsGassed) == 0x000010, "Wrong size on TheClownUtilities_IsGassed");
static_assert(offsetof(TheClownUtilities_IsGassed, player) == 0x000000, "Member 'TheClownUtilities_IsGassed::player' has a wrong offset!");
static_assert(offsetof(TheClownUtilities_IsGassed, ReturnValue) == 0x000008, "Member 'TheClownUtilities_IsGassed::ReturnValue' has a wrong offset!");

}

