#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheExecutioner

#include "Basic.hpp"

#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "DBDCompetence_classes.hpp"
#include "Engine_classes.hpp"
#include "GameplayTagUtilities_structs.hpp"
#include "DataTableUtilities_structs.hpp"
#include "TheExecutioner_structs.hpp"
#include "DBDAnimation_classes.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "StatSystem_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DBDAttack_classes.hpp"


namespace SDK
{

// Class TheExecutioner.ActivateTormentModeInteraction
// 0x0020 (0x0760 - 0x0740)
class UActivateTormentModeInteraction final : public UChargeableInteractionDefinition
{
public:
	uint8                                         Pad_740[0x20];                                     // 0x0740(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetTormentMode(class ATormentMode* tormentModeComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActivateTormentModeInteraction">();
	}
	static class UActivateTormentModeInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivateTormentModeInteraction>();
	}
};
static_assert(alignof(UActivateTormentModeInteraction) == 0x000010, "Wrong alignment on UActivateTormentModeInteraction");
static_assert(sizeof(UActivateTormentModeInteraction) == 0x000760, "Wrong size on UActivateTormentModeInteraction");

// Class TheExecutioner.Addon_TormentMode_16
// 0x0008 (0x02D0 - 0x02C8)
class UAddon_TormentMode_16 final : public USpawnEffectsOnAllSurvivorsBaseAddon
{
public:
	float                                         _blindnessDuration;                                // 0x02C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_TormentMode_16">();
	}
	static class UAddon_TormentMode_16* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_TormentMode_16>();
	}
};
static_assert(alignof(UAddon_TormentMode_16) == 0x000008, "Wrong alignment on UAddon_TormentMode_16");
static_assert(sizeof(UAddon_TormentMode_16) == 0x0002D0, "Wrong size on UAddon_TormentMode_16");
static_assert(offsetof(UAddon_TormentMode_16, _blindnessDuration) == 0x0002C8, "Member 'UAddon_TormentMode_16::_blindnessDuration' has a wrong offset!");

// Class TheExecutioner.Addon_TormentMode_17
// 0x0008 (0x02D0 - 0x02C8)
class UAddon_TormentMode_17 final : public USpawnEffectsOnAllSurvivorsBaseAddon
{
public:
	float                                         _obliviousDuration;                                // 0x02C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_TormentMode_17">();
	}
	static class UAddon_TormentMode_17* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_TormentMode_17>();
	}
};
static_assert(alignof(UAddon_TormentMode_17) == 0x000008, "Wrong alignment on UAddon_TormentMode_17");
static_assert(sizeof(UAddon_TormentMode_17) == 0x0002D0, "Wrong size on UAddon_TormentMode_17");
static_assert(offsetof(UAddon_TormentMode_17, _obliviousDuration) == 0x0002C8, "Member 'UAddon_TormentMode_17::_obliviousDuration' has a wrong offset!");

// Class TheExecutioner.Addon_TormentMode_18
// 0x0008 (0x02C0 - 0x02B8)
class UAddon_TormentMode_18 final : public UItemAddon
{
public:
	TSubclassOf<class UHemorrhageStatusEffect>    _hemorrhageEffect;                                 // 0x02B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_TormentMode_18">();
	}
	static class UAddon_TormentMode_18* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_TormentMode_18>();
	}
};
static_assert(alignof(UAddon_TormentMode_18) == 0x000008, "Wrong alignment on UAddon_TormentMode_18");
static_assert(sizeof(UAddon_TormentMode_18) == 0x0002C0, "Wrong size on UAddon_TormentMode_18");
static_assert(offsetof(UAddon_TormentMode_18, _hemorrhageEffect) == 0x0002B8, "Member 'UAddon_TormentMode_18::_hemorrhageEffect' has a wrong offset!");

// Class TheExecutioner.Addon_TormentMode_19
// 0x0008 (0x02C0 - 0x02B8)
class UAddon_TormentMode_19 final : public UItemAddon
{
public:
	float                                         _lingerDuration;                                   // 0x02B8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_TormentMode_19">();
	}
	static class UAddon_TormentMode_19* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_TormentMode_19>();
	}
};
static_assert(alignof(UAddon_TormentMode_19) == 0x000008, "Wrong alignment on UAddon_TormentMode_19");
static_assert(sizeof(UAddon_TormentMode_19) == 0x0002C0, "Wrong size on UAddon_TormentMode_19");
static_assert(offsetof(UAddon_TormentMode_19, _lingerDuration) == 0x0002B8, "Member 'UAddon_TormentMode_19::_lingerDuration' has a wrong offset!");

// Class TheExecutioner.Addon_TormentMode_20
// 0x0010 (0x02D8 - 0x02C8)
class UAddon_TormentMode_20 final : public USpawnEffectsOnAllSurvivorsBaseAddon
{
public:
	bool                                          _revealSurvivorsInAgony;                           // 0x02C8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _revealSurvivorsNotInAgony;                        // 0x02C9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2CA[0x2];                                      // 0x02CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _range;                                            // 0x02CC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _revealDuration;                                   // 0x02D0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_TormentMode_20">();
	}
	static class UAddon_TormentMode_20* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_TormentMode_20>();
	}
};
static_assert(alignof(UAddon_TormentMode_20) == 0x000008, "Wrong alignment on UAddon_TormentMode_20");
static_assert(sizeof(UAddon_TormentMode_20) == 0x0002D8, "Wrong size on UAddon_TormentMode_20");
static_assert(offsetof(UAddon_TormentMode_20, _revealSurvivorsInAgony) == 0x0002C8, "Member 'UAddon_TormentMode_20::_revealSurvivorsInAgony' has a wrong offset!");
static_assert(offsetof(UAddon_TormentMode_20, _revealSurvivorsNotInAgony) == 0x0002C9, "Member 'UAddon_TormentMode_20::_revealSurvivorsNotInAgony' has a wrong offset!");
static_assert(offsetof(UAddon_TormentMode_20, _range) == 0x0002CC, "Member 'UAddon_TormentMode_20::_range' has a wrong offset!");
static_assert(offsetof(UAddon_TormentMode_20, _revealDuration) == 0x0002D0, "Member 'UAddon_TormentMode_20::_revealDuration' has a wrong offset!");

// Class TheExecutioner.AgonyComponent
// 0x0140 (0x01F8 - 0x00B8)
class UAgonyComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x10];                                      // 0x00B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTagStateBool                          _isInAgony;                                        // 0x00C8(0x0030)(Net, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTagStateBool                          _isAgonyMoriable;                                  // 0x00F8(0x0030)(Net, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _agonyNumberOfHookForMiniMori;                     // 0x0128(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_150[0x38];                                     // 0x0150(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _inAttackTrailDamageCooldown;                      // 0x0188(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _attackTrailDamageCooldownTime;                    // 0x0190(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1B8[0x18];                                     // 0x01B8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAgonyDisplayFxEvent>           _showAgonyFXEvents;                                // 0x01D0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FAgonyDisplayFxEvent>           _hideAgonyFXEvents;                                // 0x01E0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1F0[0x8];                                      // 0x01F0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnAttackTrailDamageCooldownTimerDone();
	void Authority_OnDrainStageChanged(const int32 drainStage, class ADBDPlayer* target);
	void HideAgonyBarbWireFX_Cosmetic();
	void OnAgonyChanged_Cosmetic(const bool isInAgony);
	void OnHideBarbWireFXOnGameEvent(const struct FGameplayTag& gameEventType, const struct FGameEventData& gameEventData);
	void OnHitByTormentAttackTrail_Cosmetic();
	void OnHitInAgony_Cosmetic();
	void OnLocallyObservedChanged(bool isLocallyObserved);
	void OnRep_IsInAgony();
	void OnShowBarbWireFXOnGameEvent(const struct FGameplayTag& gameEventType, const struct FGameEventData& gameEventData);
	void OnTrailEffectStart_Cosmetic();
	void OnTrailEffectStop_Cosmetic();
	void ShowAgonyBarbWireFX_Cosmetic();

	bool IsAgonyMoriable() const;
	bool IsInAgony() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AgonyComponent">();
	}
	static class UAgonyComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAgonyComponent>();
	}
};
static_assert(alignof(UAgonyComponent) == 0x000008, "Wrong alignment on UAgonyComponent");
static_assert(sizeof(UAgonyComponent) == 0x0001F8, "Wrong size on UAgonyComponent");
static_assert(offsetof(UAgonyComponent, _isInAgony) == 0x0000C8, "Member 'UAgonyComponent::_isInAgony' has a wrong offset!");
static_assert(offsetof(UAgonyComponent, _isAgonyMoriable) == 0x0000F8, "Member 'UAgonyComponent::_isAgonyMoriable' has a wrong offset!");
static_assert(offsetof(UAgonyComponent, _agonyNumberOfHookForMiniMori) == 0x000128, "Member 'UAgonyComponent::_agonyNumberOfHookForMiniMori' has a wrong offset!");
static_assert(offsetof(UAgonyComponent, _inAttackTrailDamageCooldown) == 0x000188, "Member 'UAgonyComponent::_inAttackTrailDamageCooldown' has a wrong offset!");
static_assert(offsetof(UAgonyComponent, _attackTrailDamageCooldownTime) == 0x000190, "Member 'UAgonyComponent::_attackTrailDamageCooldownTime' has a wrong offset!");
static_assert(offsetof(UAgonyComponent, _showAgonyFXEvents) == 0x0001D0, "Member 'UAgonyComponent::_showAgonyFXEvents' has a wrong offset!");
static_assert(offsetof(UAgonyComponent, _hideAgonyFXEvents) == 0x0001E0, "Member 'UAgonyComponent::_hideAgonyFXEvents' has a wrong offset!");

// Class TheExecutioner.AgonyMoriInteraction
// 0x0000 (0x07D0 - 0x07D0)
class UAgonyMoriInteraction final : public UKillInteractionDefinition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AgonyMoriInteraction">();
	}
	static class UAgonyMoriInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAgonyMoriInteraction>();
	}
};
static_assert(alignof(UAgonyMoriInteraction) == 0x000010, "Wrong alignment on UAgonyMoriInteraction");
static_assert(sizeof(UAgonyMoriInteraction) == 0x0007D0, "Wrong size on UAgonyMoriInteraction");

// Class TheExecutioner.AgonySubAnimInstance
// 0x0020 (0x0570 - 0x0550)
class UAgonySubAnimInstance final : public UBaseSurvivorAnimInstance
{
public:
	uint8                                         Pad_548[0x8];                                      // 0x0548(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _isInAgony;                                        // 0x0550(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInTormentTrail;                                 // 0x0551(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInTormentTrailEffect;                           // 0x0552(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInDeathBed;                                     // 0x0553(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isDeadInDeathBed;                                 // 0x0554(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInStruggleInDeathBed;                           // 0x0555(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isIdle;                                           // 0x0556(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isCrouched;                                       // 0x0557(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isCrawling;                                       // 0x0558(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_559[0x3];                                      // 0x0559(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _walkAnimSpeed;                                    // 0x055C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EInteractionAnimation                         _interactionType;                                  // 0x0560(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInjured;                                        // 0x0561(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isBeingCarried;                                   // 0x0562(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_563[0xD];                                      // 0x0563(0x000D)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AgonySubAnimInstance">();
	}
	static class UAgonySubAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAgonySubAnimInstance>();
	}
};
static_assert(alignof(UAgonySubAnimInstance) == 0x000010, "Wrong alignment on UAgonySubAnimInstance");
static_assert(sizeof(UAgonySubAnimInstance) == 0x000570, "Wrong size on UAgonySubAnimInstance");
static_assert(offsetof(UAgonySubAnimInstance, _isInAgony) == 0x000550, "Member 'UAgonySubAnimInstance::_isInAgony' has a wrong offset!");
static_assert(offsetof(UAgonySubAnimInstance, _isInTormentTrail) == 0x000551, "Member 'UAgonySubAnimInstance::_isInTormentTrail' has a wrong offset!");
static_assert(offsetof(UAgonySubAnimInstance, _isInTormentTrailEffect) == 0x000552, "Member 'UAgonySubAnimInstance::_isInTormentTrailEffect' has a wrong offset!");
static_assert(offsetof(UAgonySubAnimInstance, _isInDeathBed) == 0x000553, "Member 'UAgonySubAnimInstance::_isInDeathBed' has a wrong offset!");
static_assert(offsetof(UAgonySubAnimInstance, _isDeadInDeathBed) == 0x000554, "Member 'UAgonySubAnimInstance::_isDeadInDeathBed' has a wrong offset!");
static_assert(offsetof(UAgonySubAnimInstance, _isInStruggleInDeathBed) == 0x000555, "Member 'UAgonySubAnimInstance::_isInStruggleInDeathBed' has a wrong offset!");
static_assert(offsetof(UAgonySubAnimInstance, _isIdle) == 0x000556, "Member 'UAgonySubAnimInstance::_isIdle' has a wrong offset!");
static_assert(offsetof(UAgonySubAnimInstance, _isCrouched) == 0x000557, "Member 'UAgonySubAnimInstance::_isCrouched' has a wrong offset!");
static_assert(offsetof(UAgonySubAnimInstance, _isCrawling) == 0x000558, "Member 'UAgonySubAnimInstance::_isCrawling' has a wrong offset!");
static_assert(offsetof(UAgonySubAnimInstance, _walkAnimSpeed) == 0x00055C, "Member 'UAgonySubAnimInstance::_walkAnimSpeed' has a wrong offset!");
static_assert(offsetof(UAgonySubAnimInstance, _interactionType) == 0x000560, "Member 'UAgonySubAnimInstance::_interactionType' has a wrong offset!");
static_assert(offsetof(UAgonySubAnimInstance, _isInjured) == 0x000561, "Member 'UAgonySubAnimInstance::_isInjured' has a wrong offset!");
static_assert(offsetof(UAgonySubAnimInstance, _isBeingCarried) == 0x000562, "Member 'UAgonySubAnimInstance::_isBeingCarried' has a wrong offset!");

// Class TheExecutioner.BaseTormentTrailPoint
// 0x0100 (0x0330 - 0x0230)
class ABaseTormentTrailPoint : public AActor
{
public:
	uint8                                         Pad_230[0x18];                                     // 0x0230(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class USphereComponent*                       _collisionComponent;                               // 0x0248(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _collisionRadius;                                  // 0x0250(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTunableStat                           _tormentTrailAliveTime;                            // 0x0258(0x0080)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D8[0x30];                                     // 0x02D8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   _splineMeshComponent;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UStaticMesh*>                    _trailMeshList;                                    // 0x0310(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         _indexInTrail;                                     // 0x0320(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_321[0xF];                                      // 0x0321(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DisappearCosmetic();
	void EndOfDisapearCosmetic();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseTormentTrailPoint">();
	}
	static class ABaseTormentTrailPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABaseTormentTrailPoint>();
	}
};
static_assert(alignof(ABaseTormentTrailPoint) == 0x000008, "Wrong alignment on ABaseTormentTrailPoint");
static_assert(sizeof(ABaseTormentTrailPoint) == 0x000330, "Wrong size on ABaseTormentTrailPoint");
static_assert(offsetof(ABaseTormentTrailPoint, _collisionComponent) == 0x000248, "Member 'ABaseTormentTrailPoint::_collisionComponent' has a wrong offset!");
static_assert(offsetof(ABaseTormentTrailPoint, _collisionRadius) == 0x000250, "Member 'ABaseTormentTrailPoint::_collisionRadius' has a wrong offset!");
static_assert(offsetof(ABaseTormentTrailPoint, _tormentTrailAliveTime) == 0x000258, "Member 'ABaseTormentTrailPoint::_tormentTrailAliveTime' has a wrong offset!");
static_assert(offsetof(ABaseTormentTrailPoint, _splineMeshComponent) == 0x000308, "Member 'ABaseTormentTrailPoint::_splineMeshComponent' has a wrong offset!");
static_assert(offsetof(ABaseTormentTrailPoint, _trailMeshList) == 0x000310, "Member 'ABaseTormentTrailPoint::_trailMeshList' has a wrong offset!");
static_assert(offsetof(ABaseTormentTrailPoint, _indexInTrail) == 0x000320, "Member 'ABaseTormentTrailPoint::_indexInTrail' has a wrong offset!");

// Class TheExecutioner.BloodPact
// 0x0090 (0x0458 - 0x03C8)
class UBloodPact final : public UPerk
{
public:
	uint8                                         Pad_3C8[0x18];                                     // 0x03C8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _fullHealthStateOnly;                              // 0x03E0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _hasteEffectRange;                                 // 0x03E4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _hasteEffectMovementSpeedIncrease[0x3];            // 0x03E8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _bloodPactRevealEffect;                            // 0x03F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _bloodPactHasteEffect;                             // 0x0400(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _decreaseObsessionChanceEffect;                    // 0x0408(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStatusEffect*                          _ownerStatusEffect;                                // 0x0410(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStatusEffect*                          _obsessionStatusEffect;                            // 0x0418(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStatusEffect*                          _ownerHasteStatusEffect;                           // 0x0420(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStatusEffect*                          _otherPlayerHasteStatusEffect;                     // 0x0428(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ADBDPlayer*                             _otherPlayer;                                      // 0x0430(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_438[0x20];                                     // 0x0438(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnInRangeChanged(const bool inRange);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BloodPact">();
	}
	static class UBloodPact* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBloodPact>();
	}
};
static_assert(alignof(UBloodPact) == 0x000008, "Wrong alignment on UBloodPact");
static_assert(sizeof(UBloodPact) == 0x000458, "Wrong size on UBloodPact");
static_assert(offsetof(UBloodPact, _fullHealthStateOnly) == 0x0003E0, "Member 'UBloodPact::_fullHealthStateOnly' has a wrong offset!");
static_assert(offsetof(UBloodPact, _hasteEffectRange) == 0x0003E4, "Member 'UBloodPact::_hasteEffectRange' has a wrong offset!");
static_assert(offsetof(UBloodPact, _hasteEffectMovementSpeedIncrease) == 0x0003E8, "Member 'UBloodPact::_hasteEffectMovementSpeedIncrease' has a wrong offset!");
static_assert(offsetof(UBloodPact, _bloodPactRevealEffect) == 0x0003F8, "Member 'UBloodPact::_bloodPactRevealEffect' has a wrong offset!");
static_assert(offsetof(UBloodPact, _bloodPactHasteEffect) == 0x000400, "Member 'UBloodPact::_bloodPactHasteEffect' has a wrong offset!");
static_assert(offsetof(UBloodPact, _decreaseObsessionChanceEffect) == 0x000408, "Member 'UBloodPact::_decreaseObsessionChanceEffect' has a wrong offset!");
static_assert(offsetof(UBloodPact, _ownerStatusEffect) == 0x000410, "Member 'UBloodPact::_ownerStatusEffect' has a wrong offset!");
static_assert(offsetof(UBloodPact, _obsessionStatusEffect) == 0x000418, "Member 'UBloodPact::_obsessionStatusEffect' has a wrong offset!");
static_assert(offsetof(UBloodPact, _ownerHasteStatusEffect) == 0x000420, "Member 'UBloodPact::_ownerHasteStatusEffect' has a wrong offset!");
static_assert(offsetof(UBloodPact, _otherPlayerHasteStatusEffect) == 0x000428, "Member 'UBloodPact::_otherPlayerHasteStatusEffect' has a wrong offset!");
static_assert(offsetof(UBloodPact, _otherPlayer) == 0x000430, "Member 'UBloodPact::_otherPlayer' has a wrong offset!");

// Class TheExecutioner.DeathBedAntiCampComponent
// 0x00D8 (0x0190 - 0x00B8)
class UDeathBedAntiCampComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x48];                                      // 0x00B8(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _anticampZoneDistance;                             // 0x0100(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _anticampZoneTimeToTrigger;                        // 0x0128(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_150[0x40];                                     // 0x0150(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnInRangeChanged(const bool inRange);
	void Multicast_TriggerDeathBedRelocate();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DeathBedAntiCampComponent">();
	}
	static class UDeathBedAntiCampComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeathBedAntiCampComponent>();
	}
};
static_assert(alignof(UDeathBedAntiCampComponent) == 0x000008, "Wrong alignment on UDeathBedAntiCampComponent");
static_assert(sizeof(UDeathBedAntiCampComponent) == 0x000190, "Wrong size on UDeathBedAntiCampComponent");
static_assert(offsetof(UDeathBedAntiCampComponent, _anticampZoneDistance) == 0x000100, "Member 'UDeathBedAntiCampComponent::_anticampZoneDistance' has a wrong offset!");
static_assert(offsetof(UDeathBedAntiCampComponent, _anticampZoneTimeToTrigger) == 0x000128, "Member 'UDeathBedAntiCampComponent::_anticampZoneTimeToTrigger' has a wrong offset!");

// Class TheExecutioner.DeathBedInteractable
// 0x0138 (0x0460 - 0x0328)
class ADeathBedInteractable final : public AInteractable
{
public:
	uint8                                         Pad_328[0x10];                                     // 0x0328(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        _root;                                             // 0x0338(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ACamperPlayer*                          _inDeathBedCamper;                                 // 0x0340(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChargeableComponent*                   _rescueChargeableComponent;                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDBDSkeletalMeshComponentBudgeted*      _deathBedSkeletalMesh;                             // 0x0350(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBoxComponent*                          _interactionZone;                                  // 0x0358(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBoxComponent*                          _playerOverlapZone;                                // 0x0360(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMontagePlayer*                         _montagePlayer;                                    // 0x0368(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_370[0x10];                                     // 0x0370(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UBoxComponent*                          _deathBedCollision;                                // 0x0380(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_388[0x28];                                     // 0x0388(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimationMontageSlave*                 _animationMontageSlave;                            // 0x03B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimMontage*                           _montageToPlay;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C0[0x4];                                      // 0x03C0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                _rescuerSnapPosition;                              // 0x03C4(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDeathBedAntiCampComponent*             _deathBedAnticampComponent;                        // 0x03D0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3D8[0x40];                                     // 0x03D8(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _anticampDrainCooldownTime;                        // 0x0418(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_440[0x18];                                     // 0x0440(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIPerceptionStimuliSourceComponent*    _perceptionStimuliComponent;                       // 0x0458(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ActivateDeathBed(const bool value);
	void DeathBedDisappear();
	void FX_DeathBedAppear();
	void FX_SurvivorSavedFromDeathBed();
	void Multicast_RelocateToOtherDeathBed(class ADeathBedInteractable* deathBed, class ACamperPlayer* camperPlayer);
	void OnDeathBedDeathEnd();
	void OnRelocateStart_Cosmetic();
	void OnRescueCancelled();
	void OnSkillCheckFailed();
	void OnSkillCheckFailed_Cosmetic();
	void PlayerOverlapZoneBeginOverlap(class UPrimitiveComponent* overlappedComponent, class AActor* otherActor, class UPrimitiveComponent* otherComp, int32 otherBodyIndex, bool bFromSweep, const struct FHitResult& sweepResult);
	void PlayerOverlapZoneEndOverlap(class UPrimitiveComponent* overlappedComponent, class AActor* otherActor, class UPrimitiveComponent* otherComp, int32 otherBodyIndex);
	void SetInDeathBedCamper(class ACamperPlayer* camperPlayer);
	void StartPlayerAbsorbedByGround();
	void TeleportCamperToDeathBed();

	bool CanRescueSurvivor() const;
	class ACamperPlayer* GetInDeathBedCamper() const;
	class UMontagePlayer* GetMontagePlayer() const;
	struct FVector GetRescuerSnapPosition() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DeathBedInteractable">();
	}
	static class ADeathBedInteractable* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADeathBedInteractable>();
	}
};
static_assert(alignof(ADeathBedInteractable) == 0x000008, "Wrong alignment on ADeathBedInteractable");
static_assert(sizeof(ADeathBedInteractable) == 0x000460, "Wrong size on ADeathBedInteractable");
static_assert(offsetof(ADeathBedInteractable, _root) == 0x000338, "Member 'ADeathBedInteractable::_root' has a wrong offset!");
static_assert(offsetof(ADeathBedInteractable, _inDeathBedCamper) == 0x000340, "Member 'ADeathBedInteractable::_inDeathBedCamper' has a wrong offset!");
static_assert(offsetof(ADeathBedInteractable, _rescueChargeableComponent) == 0x000348, "Member 'ADeathBedInteractable::_rescueChargeableComponent' has a wrong offset!");
static_assert(offsetof(ADeathBedInteractable, _deathBedSkeletalMesh) == 0x000350, "Member 'ADeathBedInteractable::_deathBedSkeletalMesh' has a wrong offset!");
static_assert(offsetof(ADeathBedInteractable, _interactionZone) == 0x000358, "Member 'ADeathBedInteractable::_interactionZone' has a wrong offset!");
static_assert(offsetof(ADeathBedInteractable, _playerOverlapZone) == 0x000360, "Member 'ADeathBedInteractable::_playerOverlapZone' has a wrong offset!");
static_assert(offsetof(ADeathBedInteractable, _montagePlayer) == 0x000368, "Member 'ADeathBedInteractable::_montagePlayer' has a wrong offset!");
static_assert(offsetof(ADeathBedInteractable, _deathBedCollision) == 0x000380, "Member 'ADeathBedInteractable::_deathBedCollision' has a wrong offset!");
static_assert(offsetof(ADeathBedInteractable, _animationMontageSlave) == 0x0003B0, "Member 'ADeathBedInteractable::_animationMontageSlave' has a wrong offset!");
static_assert(offsetof(ADeathBedInteractable, _montageToPlay) == 0x0003B8, "Member 'ADeathBedInteractable::_montageToPlay' has a wrong offset!");
static_assert(offsetof(ADeathBedInteractable, _rescuerSnapPosition) == 0x0003C4, "Member 'ADeathBedInteractable::_rescuerSnapPosition' has a wrong offset!");
static_assert(offsetof(ADeathBedInteractable, _deathBedAnticampComponent) == 0x0003D0, "Member 'ADeathBedInteractable::_deathBedAnticampComponent' has a wrong offset!");
static_assert(offsetof(ADeathBedInteractable, _anticampDrainCooldownTime) == 0x000418, "Member 'ADeathBedInteractable::_anticampDrainCooldownTime' has a wrong offset!");
static_assert(offsetof(ADeathBedInteractable, _perceptionStimuliComponent) == 0x000458, "Member 'ADeathBedInteractable::_perceptionStimuliComponent' has a wrong offset!");

// Class TheExecutioner.DeathBedOutlineUpdateStrategy
// 0x0000 (0x0138 - 0x0138)
class UDeathBedOutlineUpdateStrategy final : public USourceBasedOutlineUpdateStrategy
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DeathBedOutlineUpdateStrategy">();
	}
	static class UDeathBedOutlineUpdateStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeathBedOutlineUpdateStrategy>();
	}
};
static_assert(alignof(UDeathBedOutlineUpdateStrategy) == 0x000008, "Wrong alignment on UDeathBedOutlineUpdateStrategy");
static_assert(sizeof(UDeathBedOutlineUpdateStrategy) == 0x000138, "Wrong size on UDeathBedOutlineUpdateStrategy");

// Class TheExecutioner.DeathBedRescueInteraction
// 0x0030 (0x0770 - 0x0740)
class UDeathBedRescueInteraction final : public UChargeableInteractionDefinition
{
public:
	uint8                                         Pad_740[0x8];                                      // 0x0740(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _loudNoiseRange;                                   // 0x0748(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	struct FVector GetRescuerSnapPosition() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DeathBedRescueInteraction">();
	}
	static class UDeathBedRescueInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeathBedRescueInteraction>();
	}
};
static_assert(alignof(UDeathBedRescueInteraction) == 0x000010, "Wrong alignment on UDeathBedRescueInteraction");
static_assert(sizeof(UDeathBedRescueInteraction) == 0x000770, "Wrong size on UDeathBedRescueInteraction");
static_assert(offsetof(UDeathBedRescueInteraction, _loudNoiseRange) == 0x000748, "Member 'UDeathBedRescueInteraction::_loudNoiseRange' has a wrong offset!");

// Class TheExecutioner.Deathbound
// 0x0060 (0x0428 - 0x03C8)
class UDeathbound final : public UPerk
{
public:
	float                                         _distanceFromRescuedSurvivorForOblivious[0x3];     // 0x03C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _activationDuration;                               // 0x03D4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _rescueDistanceFromKillerToActivate;               // 0x03D8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _revealLocationDuration;                           // 0x03E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _unhook;                                           // 0x03E4(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _fromDyingState;                                   // 0x03E5(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3E6[0x2];                                      // 0x03E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStatusEffect*>                  _obliviousStatusEffects;                           // 0x03E8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3F8[0x10];                                     // 0x03F8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ADBDPlayer*>                     _survivorsToReveal;                                // 0x0408(0x0010)(Net, ZeroConstructor, Transient, RepNotify, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _obliviousEffectClass;                             // 0x0418(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_420[0x8];                                      // 0x0420(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void MakeSurvivorScream(const class ACamperPlayer* survivor);
	void OnRep_SurvivorsToReveal();

	float GetRevealLocationDuration() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Deathbound">();
	}
	static class UDeathbound* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeathbound>();
	}
};
static_assert(alignof(UDeathbound) == 0x000008, "Wrong alignment on UDeathbound");
static_assert(sizeof(UDeathbound) == 0x000428, "Wrong size on UDeathbound");
static_assert(offsetof(UDeathbound, _distanceFromRescuedSurvivorForOblivious) == 0x0003C8, "Member 'UDeathbound::_distanceFromRescuedSurvivorForOblivious' has a wrong offset!");
static_assert(offsetof(UDeathbound, _activationDuration) == 0x0003D4, "Member 'UDeathbound::_activationDuration' has a wrong offset!");
static_assert(offsetof(UDeathbound, _rescueDistanceFromKillerToActivate) == 0x0003D8, "Member 'UDeathbound::_rescueDistanceFromKillerToActivate' has a wrong offset!");
static_assert(offsetof(UDeathbound, _revealLocationDuration) == 0x0003E0, "Member 'UDeathbound::_revealLocationDuration' has a wrong offset!");
static_assert(offsetof(UDeathbound, _unhook) == 0x0003E4, "Member 'UDeathbound::_unhook' has a wrong offset!");
static_assert(offsetof(UDeathbound, _fromDyingState) == 0x0003E5, "Member 'UDeathbound::_fromDyingState' has a wrong offset!");
static_assert(offsetof(UDeathbound, _obliviousStatusEffects) == 0x0003E8, "Member 'UDeathbound::_obliviousStatusEffects' has a wrong offset!");
static_assert(offsetof(UDeathbound, _survivorsToReveal) == 0x000408, "Member 'UDeathbound::_survivorsToReveal' has a wrong offset!");
static_assert(offsetof(UDeathbound, _obliviousEffectClass) == 0x000418, "Member 'UDeathbound::_obliviousEffectClass' has a wrong offset!");

// Class TheExecutioner.DeathboundStatusEffect
// 0x0008 (0x0368 - 0x0360)
class UDeathboundStatusEffect final : public UObliviousEffect
{
public:
	uint8                                         Pad_360[0x8];                                      // 0x0360(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DeathboundStatusEffect">();
	}
	static class UDeathboundStatusEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeathboundStatusEffect>();
	}
};
static_assert(alignof(UDeathboundStatusEffect) == 0x000008, "Wrong alignment on UDeathboundStatusEffect");
static_assert(sizeof(UDeathboundStatusEffect) == 0x000368, "Wrong size on UDeathboundStatusEffect");

// Class TheExecutioner.ExecutionerTormentAttack
// 0x0000 (0x0380 - 0x0380)
class UExecutionerTormentAttack final : public UPounceAttack
{
public:
	void Multicast_TormentHitTarget(class ADBDPlayer* target, bool hitCosmeticOnly);
	void Server_TormentTryHitTargetNotInCoolDown(class ADBDPlayer* target);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ExecutionerTormentAttack">();
	}
	static class UExecutionerTormentAttack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExecutionerTormentAttack>();
	}
};
static_assert(alignof(UExecutionerTormentAttack) == 0x000010, "Wrong alignment on UExecutionerTormentAttack");
static_assert(sizeof(UExecutionerTormentAttack) == 0x000380, "Wrong size on UExecutionerTormentAttack");

// Class TheExecutioner.ExecutionerTormentAttackSuccessSubstate
// 0x0000 (0x0118 - 0x0118)
class UExecutionerTormentAttackSuccessSubstate final : public UPounceAttackSuccessSubstate
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ExecutionerTormentAttackSuccessSubstate">();
	}
	static class UExecutionerTormentAttackSuccessSubstate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExecutionerTormentAttackSuccessSubstate>();
	}
};
static_assert(alignof(UExecutionerTormentAttackSuccessSubstate) == 0x000008, "Wrong alignment on UExecutionerTormentAttackSuccessSubstate");
static_assert(sizeof(UExecutionerTormentAttackSuccessSubstate) == 0x000118, "Wrong size on UExecutionerTormentAttackSuccessSubstate");

// Class TheExecutioner.ExecutionerTormentAttackMissSubstate
// 0x0000 (0x0120 - 0x0120)
class UExecutionerTormentAttackMissSubstate final : public UPounceAttackMissSubstate
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ExecutionerTormentAttackMissSubstate">();
	}
	static class UExecutionerTormentAttackMissSubstate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExecutionerTormentAttackMissSubstate>();
	}
};
static_assert(alignof(UExecutionerTormentAttackMissSubstate) == 0x000008, "Wrong alignment on UExecutionerTormentAttackMissSubstate");
static_assert(sizeof(UExecutionerTormentAttackMissSubstate) == 0x000120, "Wrong size on UExecutionerTormentAttackMissSubstate");

// Class TheExecutioner.ExecutionerTormentAttackObstructSubstate
// 0x0000 (0x0128 - 0x0128)
class UExecutionerTormentAttackObstructSubstate final : public UPounceAttackObstructSubstate
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ExecutionerTormentAttackObstructSubstate">();
	}
	static class UExecutionerTormentAttackObstructSubstate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExecutionerTormentAttackObstructSubstate>();
	}
};
static_assert(alignof(UExecutionerTormentAttackObstructSubstate) == 0x000008, "Wrong alignment on UExecutionerTormentAttackObstructSubstate");
static_assert(sizeof(UExecutionerTormentAttackObstructSubstate) == 0x000128, "Wrong size on UExecutionerTormentAttackObstructSubstate");

// Class TheExecutioner.ForcedPenance
// 0x0030 (0x03F8 - 0x03C8)
class UForcedPenance final : public UPerk
{
public:
	float                                         _perkActivationDuration[0x3];                      // 0x03C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _applyOblivious;                                   // 0x03D4(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _applyBroken;                                      // 0x03D5(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3D6[0x2];                                      // 0x03D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStatusEffect*>                  _camperObliviousEffects;                           // 0x03D8(0x0010)(ExportObject, Net, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UStatusEffect*>                  _camperBrokenEffects;                              // 0x03E8(0x0010)(ExportObject, Net, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ForcedPenance">();
	}
	static class UForcedPenance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UForcedPenance>();
	}
};
static_assert(alignof(UForcedPenance) == 0x000008, "Wrong alignment on UForcedPenance");
static_assert(sizeof(UForcedPenance) == 0x0003F8, "Wrong size on UForcedPenance");
static_assert(offsetof(UForcedPenance, _perkActivationDuration) == 0x0003C8, "Member 'UForcedPenance::_perkActivationDuration' has a wrong offset!");
static_assert(offsetof(UForcedPenance, _applyOblivious) == 0x0003D4, "Member 'UForcedPenance::_applyOblivious' has a wrong offset!");
static_assert(offsetof(UForcedPenance, _applyBroken) == 0x0003D5, "Member 'UForcedPenance::_applyBroken' has a wrong offset!");
static_assert(offsetof(UForcedPenance, _camperObliviousEffects) == 0x0003D8, "Member 'UForcedPenance::_camperObliviousEffects' has a wrong offset!");
static_assert(offsetof(UForcedPenance, _camperBrokenEffects) == 0x0003E8, "Member 'UForcedPenance::_camperBrokenEffects' has a wrong offset!");

// Class TheExecutioner.MobileTormentTrailRenderer
// 0x0080 (0x02B0 - 0x0230)
class AMobileTormentTrailRenderer final : public AActor
{
public:
	class UInstancedStaticMeshComponent*          _pillarIsmComponent;                               // 0x0230(0x0008)(Edit, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInstancedStaticMeshComponent*          _wireIsmComponent;                                 // 0x0238(0x0008)(Edit, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInstancedStaticMeshComponent*          _trailIsmComponent;                                // 0x0240(0x0008)(Edit, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInstancedStaticMeshComponent*          _pillarOutlineIsmComponent;                        // 0x0248(0x0008)(Edit, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInstancedStaticMeshComponent*          _wireOutlineIsmComponent;                          // 0x0250(0x0008)(Edit, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class ABaseTormentTrailPoint*, struct FTormentTrailPointInfo> _instanceMap;                 // 0x0258(0x0050)(Transient, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               _trailMaterialInstanceDynamic;                     // 0x02A8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Multicast_AddInstance(class ABaseTormentTrailPoint* trailPoint, bool isAttackTrailPoint);
	void Multicast_RemoveInstance(class ABaseTormentTrailPoint* trailPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MobileTormentTrailRenderer">();
	}
	static class AMobileTormentTrailRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMobileTormentTrailRenderer>();
	}
};
static_assert(alignof(AMobileTormentTrailRenderer) == 0x000008, "Wrong alignment on AMobileTormentTrailRenderer");
static_assert(sizeof(AMobileTormentTrailRenderer) == 0x0002B0, "Wrong size on AMobileTormentTrailRenderer");
static_assert(offsetof(AMobileTormentTrailRenderer, _pillarIsmComponent) == 0x000230, "Member 'AMobileTormentTrailRenderer::_pillarIsmComponent' has a wrong offset!");
static_assert(offsetof(AMobileTormentTrailRenderer, _wireIsmComponent) == 0x000238, "Member 'AMobileTormentTrailRenderer::_wireIsmComponent' has a wrong offset!");
static_assert(offsetof(AMobileTormentTrailRenderer, _trailIsmComponent) == 0x000240, "Member 'AMobileTormentTrailRenderer::_trailIsmComponent' has a wrong offset!");
static_assert(offsetof(AMobileTormentTrailRenderer, _pillarOutlineIsmComponent) == 0x000248, "Member 'AMobileTormentTrailRenderer::_pillarOutlineIsmComponent' has a wrong offset!");
static_assert(offsetof(AMobileTormentTrailRenderer, _wireOutlineIsmComponent) == 0x000250, "Member 'AMobileTormentTrailRenderer::_wireOutlineIsmComponent' has a wrong offset!");
static_assert(offsetof(AMobileTormentTrailRenderer, _instanceMap) == 0x000258, "Member 'AMobileTormentTrailRenderer::_instanceMap' has a wrong offset!");
static_assert(offsetof(AMobileTormentTrailRenderer, _trailMaterialInstanceDynamic) == 0x0002A8, "Member 'AMobileTormentTrailRenderer::_trailMaterialInstanceDynamic' has a wrong offset!");

// Class TheExecutioner.RepressedAlliance
// 0x0078 (0x0440 - 0x03C8)
class URepressedAlliance final : public UPerk
{
public:
	float                                         _repairTimesNeededToActivate[0x3];                 // 0x03C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _generatorBlockDuration;                           // 0x03D4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSecondaryInteractionProperties        _secondaryActionProperties;                        // 0x03D8(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UInteractionDefinition*                 _currentRepairInteractionWithAbility;              // 0x0410(0x0008)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_418[0x18];                                     // 0x0418(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class AGenerator*                             _blockedGenerator;                                 // 0x0430(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_438[0x8];                                      // 0x0438(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_BlockedGenerator(class AGenerator* oldGenerator);
	void OnRep_CurrentRepairInteractionWithAbility(class UInteractionDefinition* oldRepairInteraction);
	void Server_OnActionInputPressed(class AGenerator* generator);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RepressedAlliance">();
	}
	static class URepressedAlliance* GetDefaultObj()
	{
		return GetDefaultObjImpl<URepressedAlliance>();
	}
};
static_assert(alignof(URepressedAlliance) == 0x000008, "Wrong alignment on URepressedAlliance");
static_assert(sizeof(URepressedAlliance) == 0x000440, "Wrong size on URepressedAlliance");
static_assert(offsetof(URepressedAlliance, _repairTimesNeededToActivate) == 0x0003C8, "Member 'URepressedAlliance::_repairTimesNeededToActivate' has a wrong offset!");
static_assert(offsetof(URepressedAlliance, _generatorBlockDuration) == 0x0003D4, "Member 'URepressedAlliance::_generatorBlockDuration' has a wrong offset!");
static_assert(offsetof(URepressedAlliance, _secondaryActionProperties) == 0x0003D8, "Member 'URepressedAlliance::_secondaryActionProperties' has a wrong offset!");
static_assert(offsetof(URepressedAlliance, _currentRepairInteractionWithAbility) == 0x000410, "Member 'URepressedAlliance::_currentRepairInteractionWithAbility' has a wrong offset!");
static_assert(offsetof(URepressedAlliance, _blockedGenerator) == 0x000430, "Member 'URepressedAlliance::_blockedGenerator' has a wrong offset!");

// Class TheExecutioner.SendToDeathBedInteraction
// 0x0010 (0x0750 - 0x0740)
class USendToDeathBedInteraction final : public UChargeableInteractionDefinition
{
public:
	uint8                                         Pad_740[0x8];                                      // 0x0740(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class ADeathBedInteractable*                  _deathBed;                                         // 0x0748(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void FX_InteractionCancel();
	void FX_InteractionStart();
	void Multicast_SendCamperToDeathBed(class ADeathBedInteractable* deathBed);

	const class ACamperPlayer* GetOwningSurvivor() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SendToDeathBedInteraction">();
	}
	static class USendToDeathBedInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USendToDeathBedInteraction>();
	}
};
