#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheGunslinger

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "DataTableUtilities_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "GameplayTagUtilities_structs.hpp"
#include "Projectile_classes.hpp"
#include "DBDCompetence_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "TheGunslinger_structs.hpp"
#include "StatSystem_structs.hpp"
#include "DBDAnimation_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayUtilities_classes.hpp"
#include "DBDAudio_structs.hpp"


namespace SDK
{

// Class TheGunslinger.ChainPlayerMovementStatusEffect
// 0x0058 (0x03A8 - 0x0350)
class UChainPlayerMovementStatusEffect : public UStatusEffect
{
public:
	struct FDBDTunableRowHandle                   _baseMovementSpeedMultiplier;                      // 0x0350(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _collisionMovementSpeedMultiplier;                 // 0x0378(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ARifleChain*                            _chain;                                            // 0x03A0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnIsChainCollidingChanged(bool isColliding);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChainPlayerMovementStatusEffect">();
	}
	static class UChainPlayerMovementStatusEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChainPlayerMovementStatusEffect>();
	}
};
static_assert(alignof(UChainPlayerMovementStatusEffect) == 0x000008, "Wrong alignment on UChainPlayerMovementStatusEffect");
static_assert(sizeof(UChainPlayerMovementStatusEffect) == 0x0003A8, "Wrong size on UChainPlayerMovementStatusEffect");
static_assert(offsetof(UChainPlayerMovementStatusEffect, _baseMovementSpeedMultiplier) == 0x000350, "Member 'UChainPlayerMovementStatusEffect::_baseMovementSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(UChainPlayerMovementStatusEffect, _collisionMovementSpeedMultiplier) == 0x000378, "Member 'UChainPlayerMovementStatusEffect::_collisionMovementSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(UChainPlayerMovementStatusEffect, _chain) == 0x0003A0, "Member 'UChainPlayerMovementStatusEffect::_chain' has a wrong offset!");

// Class TheGunslinger.ChainKillerMovementStatusEffect
// 0x0068 (0x0410 - 0x03A8)
class UChainKillerMovementStatusEffect final : public UChainPlayerMovementStatusEffect
{
public:
	struct FDBDTunableRowHandle                   _backwardMovementSpeedMultiplier;                  // 0x03A8(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _backwardMovementAngle;                            // 0x03D0(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3F8[0x18];                                     // 0x03F8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChainKillerMovementStatusEffect">();
	}
	static class UChainKillerMovementStatusEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChainKillerMovementStatusEffect>();
	}
};
static_assert(alignof(UChainKillerMovementStatusEffect) == 0x000008, "Wrong alignment on UChainKillerMovementStatusEffect");
static_assert(sizeof(UChainKillerMovementStatusEffect) == 0x000410, "Wrong size on UChainKillerMovementStatusEffect");
static_assert(offsetof(UChainKillerMovementStatusEffect, _backwardMovementSpeedMultiplier) == 0x0003A8, "Member 'UChainKillerMovementStatusEffect::_backwardMovementSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(UChainKillerMovementStatusEffect, _backwardMovementAngle) == 0x0003D0, "Member 'UChainKillerMovementStatusEffect::_backwardMovementAngle' has a wrong offset!");

// Class TheGunslinger.ChainLinkableComponent
// 0x00D0 (0x0188 - 0x00B8)
class UChainLinkableComponent : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x18];                                      // 0x00B8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UBaseCameraTargetingStrategy> _cameraTargetingStrategyClass;                   // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _movementStatusEffectName;                         // 0x00D8(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _linkedStatusEffectName;                           // 0x00E4(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPlayerReelInputAccelerationConstraintStrategy* _inputAccelerationStrategy;                // 0x00F0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URiflePlayerLinker*                     _chainLink;                                        // 0x00F8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_100[0x30];                                     // 0x0100(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTagStateBool                          _isLinkedLingering;                                // 0x0130(0x0030)(Net, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChainPlayerMovementStatusEffect*       _movementStatusEffect;                             // 0x0160(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_168[0x8];                                      // 0x0168(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UBaseCameraTargetingStrategy*           _cameraStrategy;                                   // 0x0170(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_178[0x10];                                     // 0x0178(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChainLinkableComponent">();
	}
	static class UChainLinkableComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChainLinkableComponent>();
	}
};
static_assert(alignof(UChainLinkableComponent) == 0x000008, "Wrong alignment on UChainLinkableComponent");
static_assert(sizeof(UChainLinkableComponent) == 0x000188, "Wrong size on UChainLinkableComponent");
static_assert(offsetof(UChainLinkableComponent, _cameraTargetingStrategyClass) == 0x0000D0, "Member 'UChainLinkableComponent::_cameraTargetingStrategyClass' has a wrong offset!");
static_assert(offsetof(UChainLinkableComponent, _movementStatusEffectName) == 0x0000D8, "Member 'UChainLinkableComponent::_movementStatusEffectName' has a wrong offset!");
static_assert(offsetof(UChainLinkableComponent, _linkedStatusEffectName) == 0x0000E4, "Member 'UChainLinkableComponent::_linkedStatusEffectName' has a wrong offset!");
static_assert(offsetof(UChainLinkableComponent, _inputAccelerationStrategy) == 0x0000F0, "Member 'UChainLinkableComponent::_inputAccelerationStrategy' has a wrong offset!");
static_assert(offsetof(UChainLinkableComponent, _chainLink) == 0x0000F8, "Member 'UChainLinkableComponent::_chainLink' has a wrong offset!");
static_assert(offsetof(UChainLinkableComponent, _isLinkedLingering) == 0x000130, "Member 'UChainLinkableComponent::_isLinkedLingering' has a wrong offset!");
static_assert(offsetof(UChainLinkableComponent, _movementStatusEffect) == 0x000160, "Member 'UChainLinkableComponent::_movementStatusEffect' has a wrong offset!");
static_assert(offsetof(UChainLinkableComponent, _cameraStrategy) == 0x000170, "Member 'UChainLinkableComponent::_cameraStrategy' has a wrong offset!");

// Class TheGunslinger.DeadMansSwitch
// 0x0038 (0x0400 - 0x03C8)
class UDeadMansSwitch final : public UPerk
{
public:
	uint8                                         Pad_3C8[0x8];                                      // 0x03C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _activationDurationByLevels[0x3];                  // 0x03D0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _anySurvivorLetGo;                                 // 0x03DC(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3DD[0x3];                                      // 0x03DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGenerator*>                     _blockedGenerators;                                // 0x03E0(0x0010)(Net, ZeroConstructor, Transient, RepNotify, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3F0[0x10];                                     // 0x03F0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_BlockedGenerators();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DeadMansSwitch">();
	}
	static class UDeadMansSwitch* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeadMansSwitch>();
	}
};
static_assert(alignof(UDeadMansSwitch) == 0x000008, "Wrong alignment on UDeadMansSwitch");
static_assert(sizeof(UDeadMansSwitch) == 0x000400, "Wrong size on UDeadMansSwitch");
static_assert(offsetof(UDeadMansSwitch, _activationDurationByLevels) == 0x0003D0, "Member 'UDeadMansSwitch::_activationDurationByLevels' has a wrong offset!");
static_assert(offsetof(UDeadMansSwitch, _anySurvivorLetGo) == 0x0003DC, "Member 'UDeadMansSwitch::_anySurvivorLetGo' has a wrong offset!");
static_assert(offsetof(UDeadMansSwitch, _blockedGenerators) == 0x0003E0, "Member 'UDeadMansSwitch::_blockedGenerators' has a wrong offset!");

// Class TheGunslinger.FireHarpoonRifleInteraction
// 0x04F0 (0x0B10 - 0x0620)
class UFireHarpoonRifleInteraction final : public UInteractionDefinition
{
public:
	TMulticastInlineDelegate<void()>              OnFireHarpoon;                                     // 0x0618(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnHitPlayer;                                       // 0x0628(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_638[0x1];                                      // 0x0638(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	EFireHarpoonRifleAimingInteractionSubState    _aimingSubState;                                   // 0x0639(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_63A[0x6];                                      // 0x063A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHarpoonProjectile*                     _harpoon;                                          // 0x0640(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ADBDPlayer*                             _collector;                                        // 0x0648(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _aimDownSightDuration;                             // 0x0650(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _aimDownSightZoom;                                 // 0x0678(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _aimDownSightMousePitchScaleMultiplier;            // 0x06A0(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _aimDownSightMouseYawScaleMultiplier;              // 0x06C8(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _aimDownSightGamepadPitchScaleMultiplier;          // 0x06F0(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _aimDownSightGamepadYawScaleMultiplier;            // 0x0718(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _aimDownSightGamepadPitchCurve;                    // 0x0740(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _aimDownSightGamepadYawCurve;                      // 0x0748(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _aimDownSightRotationScaleAdjustmentTime;          // 0x0750(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _aimDownSightMovementSpeedMultiplier;              // 0x0778(0x0080)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _fireDuration;                                     // 0x07F8(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _fireRotationScaleMultiplier;                      // 0x0820(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _fireRotationScaleAdjustmentTime;                  // 0x0848(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _fireMovementSpeedMultiplier;                      // 0x0870(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _longRangeShotMinDistance;                         // 0x0898(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8C0[0x8];                                      // 0x08C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _successMovementSpeedMultiplier;                   // 0x08C8(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _missMovementSpeedMultiplier;                      // 0x08F0(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _missShotCooldownDuration;                         // 0x0918(0x0080)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _nearMissShotMaxDistance;                          // 0x0998(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _successShotDuration;                              // 0x09C0(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9E8[0x128];                                    // 0x09E8(0x0128)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Server_HandleMissShotScores(const TArray<class ADBDPlayer*>& nearMissedPlayers);
	void Server_SetAimingSubstate(EFireHarpoonRifleAimingInteractionSubState newState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FireHarpoonRifleInteraction">();
	}
	static class UFireHarpoonRifleInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFireHarpoonRifleInteraction>();
	}
};
static_assert(alignof(UFireHarpoonRifleInteraction) == 0x000010, "Wrong alignment on UFireHarpoonRifleInteraction");
static_assert(sizeof(UFireHarpoonRifleInteraction) == 0x000B10, "Wrong size on UFireHarpoonRifleInteraction");
static_assert(offsetof(UFireHarpoonRifleInteraction, OnFireHarpoon) == 0x000618, "Member 'UFireHarpoonRifleInteraction::OnFireHarpoon' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, OnHitPlayer) == 0x000628, "Member 'UFireHarpoonRifleInteraction::OnHitPlayer' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _aimingSubState) == 0x000639, "Member 'UFireHarpoonRifleInteraction::_aimingSubState' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _harpoon) == 0x000640, "Member 'UFireHarpoonRifleInteraction::_harpoon' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _collector) == 0x000648, "Member 'UFireHarpoonRifleInteraction::_collector' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _aimDownSightDuration) == 0x000650, "Member 'UFireHarpoonRifleInteraction::_aimDownSightDuration' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _aimDownSightZoom) == 0x000678, "Member 'UFireHarpoonRifleInteraction::_aimDownSightZoom' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _aimDownSightMousePitchScaleMultiplier) == 0x0006A0, "Member 'UFireHarpoonRifleInteraction::_aimDownSightMousePitchScaleMultiplier' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _aimDownSightMouseYawScaleMultiplier) == 0x0006C8, "Member 'UFireHarpoonRifleInteraction::_aimDownSightMouseYawScaleMultiplier' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _aimDownSightGamepadPitchScaleMultiplier) == 0x0006F0, "Member 'UFireHarpoonRifleInteraction::_aimDownSightGamepadPitchScaleMultiplier' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _aimDownSightGamepadYawScaleMultiplier) == 0x000718, "Member 'UFireHarpoonRifleInteraction::_aimDownSightGamepadYawScaleMultiplier' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _aimDownSightGamepadPitchCurve) == 0x000740, "Member 'UFireHarpoonRifleInteraction::_aimDownSightGamepadPitchCurve' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _aimDownSightGamepadYawCurve) == 0x000748, "Member 'UFireHarpoonRifleInteraction::_aimDownSightGamepadYawCurve' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _aimDownSightRotationScaleAdjustmentTime) == 0x000750, "Member 'UFireHarpoonRifleInteraction::_aimDownSightRotationScaleAdjustmentTime' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _aimDownSightMovementSpeedMultiplier) == 0x000778, "Member 'UFireHarpoonRifleInteraction::_aimDownSightMovementSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _fireDuration) == 0x0007F8, "Member 'UFireHarpoonRifleInteraction::_fireDuration' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _fireRotationScaleMultiplier) == 0x000820, "Member 'UFireHarpoonRifleInteraction::_fireRotationScaleMultiplier' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _fireRotationScaleAdjustmentTime) == 0x000848, "Member 'UFireHarpoonRifleInteraction::_fireRotationScaleAdjustmentTime' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _fireMovementSpeedMultiplier) == 0x000870, "Member 'UFireHarpoonRifleInteraction::_fireMovementSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _longRangeShotMinDistance) == 0x000898, "Member 'UFireHarpoonRifleInteraction::_longRangeShotMinDistance' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _successMovementSpeedMultiplier) == 0x0008C8, "Member 'UFireHarpoonRifleInteraction::_successMovementSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _missMovementSpeedMultiplier) == 0x0008F0, "Member 'UFireHarpoonRifleInteraction::_missMovementSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _missShotCooldownDuration) == 0x000918, "Member 'UFireHarpoonRifleInteraction::_missShotCooldownDuration' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _nearMissShotMaxDistance) == 0x000998, "Member 'UFireHarpoonRifleInteraction::_nearMissShotMaxDistance' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _successShotDuration) == 0x0009C0, "Member 'UFireHarpoonRifleInteraction::_successShotDuration' has a wrong offset!");

// Class TheGunslinger.ForThePeople
// 0x00C8 (0x0490 - 0x03C8)
class UForThePeople final : public UPerk
{
public:
	uint8                                         Pad_3C8[0x19];                                     // 0x03C8(0x0019)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _isHealStartedOnServer;                            // 0x03E1(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3E2[0x2];                                      // 0x03E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _brokenEffectDurations[0x3];                       // 0x03E4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _forThePeopleBrokenEffect;                         // 0x03F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _forThePeopleObsessionEffect;                      // 0x03F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSecondaryInteractionProperties        _secondaryActionProperties;                        // 0x0400(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_438[0x58];                                     // 0x0438(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Client_OnActionInputPressedEnded();
	void Multicast_OnHealAbilityUsed(class ACamperPlayer* healer, class ACamperPlayer* healTarget, float amountHealed);
	void OnHealingAbilityUsed(class ACamperPlayer* healingSurvivor, class ACamperPlayer* healedSurvivor);
	void Server_OnActionInputPressed();

	void OnRep_SetIsHealStartedOnServer() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ForThePeople">();
	}
	static class UForThePeople* GetDefaultObj()
	{
		return GetDefaultObjImpl<UForThePeople>();
	}
};
static_assert(alignof(UForThePeople) == 0x000008, "Wrong alignment on UForThePeople");
static_assert(sizeof(UForThePeople) == 0x000490, "Wrong size on UForThePeople");
static_assert(offsetof(UForThePeople, _isHealStartedOnServer) == 0x0003E1, "Member 'UForThePeople::_isHealStartedOnServer' has a wrong offset!");
static_assert(offsetof(UForThePeople, _brokenEffectDurations) == 0x0003E4, "Member 'UForThePeople::_brokenEffectDurations' has a wrong offset!");
static_assert(offsetof(UForThePeople, _forThePeopleBrokenEffect) == 0x0003F0, "Member 'UForThePeople::_forThePeopleBrokenEffect' has a wrong offset!");
static_assert(offsetof(UForThePeople, _forThePeopleObsessionEffect) == 0x0003F8, "Member 'UForThePeople::_forThePeopleObsessionEffect' has a wrong offset!");
static_assert(offsetof(UForThePeople, _secondaryActionProperties) == 0x000400, "Member 'UForThePeople::_secondaryActionProperties' has a wrong offset!");

// Class TheGunslinger.Gearhead
// 0x0020 (0x03E8 - 0x03C8)
class UGearhead final : public UPerk
{
public:
	TSubclassOf<class UStatusEffect>              _timedRevealToKillerEffect;                        // 0x03C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _surviorAuraDurations[0x3];                        // 0x03D0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _perkDuration;                                     // 0x03DC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ESkillCheckType                               _skillCheckType;                                   // 0x03E0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _basicAttack;                                      // 0x03E1(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3E2[0x6];                                      // 0x03E2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Gearhead">();
	}
	static class UGearhead* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGearhead>();
	}
};
static_assert(alignof(UGearhead) == 0x000008, "Wrong alignment on UGearhead");
static_assert(sizeof(UGearhead) == 0x0003E8, "Wrong size on UGearhead");
static_assert(offsetof(UGearhead, _timedRevealToKillerEffect) == 0x0003C8, "Member 'UGearhead::_timedRevealToKillerEffect' has a wrong offset!");
static_assert(offsetof(UGearhead, _surviorAuraDurations) == 0x0003D0, "Member 'UGearhead::_surviorAuraDurations' has a wrong offset!");
static_assert(offsetof(UGearhead, _perkDuration) == 0x0003DC, "Member 'UGearhead::_perkDuration' has a wrong offset!");
static_assert(offsetof(UGearhead, _skillCheckType) == 0x0003E0, "Member 'UGearhead::_skillCheckType' has a wrong offset!");
static_assert(offsetof(UGearhead, _basicAttack) == 0x0003E1, "Member 'UGearhead::_basicAttack' has a wrong offset!");

// Class TheGunslinger.GunslingerAnimInstance
// 0x01E0 (0x07E0 - 0x0600)
class UGunslingerAnimInstance final : public UKillerAnimInstance
{
public:
	bool                                          _isAiming;                                         // 0x0600(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isAimingWarmup;                                   // 0x0601(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isAimingCooldown;                                 // 0x0602(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isAimingReadyToShoot;                             // 0x0603(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isFiring;                                         // 0x0604(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInMissShotCooldown;                             // 0x0605(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInSuccessShot;                                  // 0x0606(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isLinked;                                         // 0x0607(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isReeling;                                        // 0x0608(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInGunState;                                     // 0x0609(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_60A[0x2];                                      // 0x060A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _idleToAimAnimPlayrate;                            // 0x060C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _aimToIdleAnimPlayrate;                            // 0x0610(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _fireAnimPlayRate;                                 // 0x0614(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _missShotCooldownAnimPlayRate;                     // 0x0618(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _successShotAnimPlayRate;                          // 0x061C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimSequence*                          _idleToAimAnim;                                    // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimSequence*                          _aimToIdleAnim;                                    // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimSequence*                          _fireAnim;                                         // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimSequence*                          _missShotCooldownAnim;                             // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimSequence*                          _successShotAnim;                                  // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _idleToAimAnimDuration;                            // 0x0648(0x0028)(Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _aimToIdleAnimDuration;                            // 0x0670(0x0028)(Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _fireAnimDuration;                                 // 0x0698(0x0028)(Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTunableStat                           _missShotCooldownAnimDuration;                     // 0x06C0(0x0080)(Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _successShotAnimDuration;                          // 0x0740(0x0028)(Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_768[0x78];                                     // 0x0768(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GunslingerAnimInstance">();
	}
	static class UGunslingerAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGunslingerAnimInstance>();
	}
};
static_assert(alignof(UGunslingerAnimInstance) == 0x000010, "Wrong alignment on UGunslingerAnimInstance");
static_assert(sizeof(UGunslingerAnimInstance) == 0x0007E0, "Wrong size on UGunslingerAnimInstance");
static_assert(offsetof(UGunslingerAnimInstance, _isAiming) == 0x000600, "Member 'UGunslingerAnimInstance::_isAiming' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _isAimingWarmup) == 0x000601, "Member 'UGunslingerAnimInstance::_isAimingWarmup' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _isAimingCooldown) == 0x000602, "Member 'UGunslingerAnimInstance::_isAimingCooldown' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _isAimingReadyToShoot) == 0x000603, "Member 'UGunslingerAnimInstance::_isAimingReadyToShoot' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _isFiring) == 0x000604, "Member 'UGunslingerAnimInstance::_isFiring' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _isInMissShotCooldown) == 0x000605, "Member 'UGunslingerAnimInstance::_isInMissShotCooldown' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _isInSuccessShot) == 0x000606, "Member 'UGunslingerAnimInstance::_isInSuccessShot' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _isLinked) == 0x000607, "Member 'UGunslingerAnimInstance::_isLinked' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _isReeling) == 0x000608, "Member 'UGunslingerAnimInstance::_isReeling' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _isInGunState) == 0x000609, "Member 'UGunslingerAnimInstance::_isInGunState' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _idleToAimAnimPlayrate) == 0x00060C, "Member 'UGunslingerAnimInstance::_idleToAimAnimPlayrate' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _aimToIdleAnimPlayrate) == 0x000610, "Member 'UGunslingerAnimInstance::_aimToIdleAnimPlayrate' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _fireAnimPlayRate) == 0x000614, "Member 'UGunslingerAnimInstance::_fireAnimPlayRate' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _missShotCooldownAnimPlayRate) == 0x000618, "Member 'UGunslingerAnimInstance::_missShotCooldownAnimPlayRate' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _successShotAnimPlayRate) == 0x00061C, "Member 'UGunslingerAnimInstance::_successShotAnimPlayRate' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _idleToAimAnim) == 0x000620, "Member 'UGunslingerAnimInstance::_idleToAimAnim' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _aimToIdleAnim) == 0x000628, "Member 'UGunslingerAnimInstance::_aimToIdleAnim' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _fireAnim) == 0x000630, "Member 'UGunslingerAnimInstance::_fireAnim' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _missShotCooldownAnim) == 0x000638, "Member 'UGunslingerAnimInstance::_missShotCooldownAnim' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _successShotAnim) == 0x000640, "Member 'UGunslingerAnimInstance::_successShotAnim' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _idleToAimAnimDuration) == 0x000648, "Member 'UGunslingerAnimInstance::_idleToAimAnimDuration' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _aimToIdleAnimDuration) == 0x000670, "Member 'UGunslingerAnimInstance::_aimToIdleAnimDuration' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _fireAnimDuration) == 0x000698, "Member 'UGunslingerAnimInstance::_fireAnimDuration' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _missShotCooldownAnimDuration) == 0x0006C0, "Member 'UGunslingerAnimInstance::_missShotCooldownAnimDuration' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _successShotAnimDuration) == 0x000740, "Member 'UGunslingerAnimInstance::_successShotAnimDuration' has a wrong offset!");

// Class TheGunslinger.GunslingerCameraTargetingStrategy
// 0x0018 (0x0068 - 0x0050)
class UGunslingerCameraTargetingStrategy final : public UBaseCameraTargetingStrategy
{
public:
	class FName                                   _cameraSocketName;                                 // 0x0050(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _survivorHarpoonSocketName;                        // 0x005C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GunslingerCameraTargetingStrategy">();
	}
	static class UGunslingerCameraTargetingStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGunslingerCameraTargetingStrategy>();
	}
};
static_assert(alignof(UGunslingerCameraTargetingStrategy) == 0x000008, "Wrong alignment on UGunslingerCameraTargetingStrategy");
static_assert(sizeof(UGunslingerCameraTargetingStrategy) == 0x000068, "Wrong size on UGunslingerCameraTargetingStrategy");
static_assert(offsetof(UGunslingerCameraTargetingStrategy, _cameraSocketName) == 0x000050, "Member 'UGunslingerCameraTargetingStrategy::_cameraSocketName' has a wrong offset!");
static_assert(offsetof(UGunslingerCameraTargetingStrategy, _survivorHarpoonSocketName) == 0x00005C, "Member 'UGunslingerCameraTargetingStrategy::_survivorHarpoonSocketName' has a wrong offset!");

// Class TheGunslinger.GunslingerEffectsComponent
// 0x0098 (0x0150 - 0x00B8)
class UGunslingerEffectsComponent final : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(bool isAiming)> OnIsAimingChanged;                                 // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              PlayOutOfAmmoSound;                                // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                         _minimumTimeBetweenBroadcast;                      // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHarpoonRifle*                          _rifle;                                            // 0x00E0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E8[0x68];                                      // 0x00E8(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Multicast_PlayOutOfAmmoSound();
	void OnItemUsedStateChanged(bool isPressed);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GunslingerEffectsComponent">();
	}
	static class UGunslingerEffectsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGunslingerEffectsComponent>();
	}
};
static_assert(alignof(UGunslingerEffectsComponent) == 0x000008, "Wrong alignment on UGunslingerEffectsComponent");
static_assert(sizeof(UGunslingerEffectsComponent) == 0x000150, "Wrong size on UGunslingerEffectsComponent");
static_assert(offsetof(UGunslingerEffectsComponent, OnIsAimingChanged) == 0x0000B8, "Member 'UGunslingerEffectsComponent::OnIsAimingChanged' has a wrong offset!");
static_assert(offsetof(UGunslingerEffectsComponent, PlayOutOfAmmoSound) == 0x0000C8, "Member 'UGunslingerEffectsComponent::PlayOutOfAmmoSound' has a wrong offset!");
static_assert(offsetof(UGunslingerEffectsComponent, _minimumTimeBetweenBroadcast) == 0x0000D8, "Member 'UGunslingerEffectsComponent::_minimumTimeBetweenBroadcast' has a wrong offset!");
static_assert(offsetof(UGunslingerEffectsComponent, _rifle) == 0x0000E0, "Member 'UGunslingerEffectsComponent::_rifle' has a wrong offset!");

// Class TheGunslinger.GunslingerUtilities
// 0x0000 (0x0030 - 0x0030)
class UGunslingerUtilities final : public UBlueprintFunctionLibrary
{
public:
	static class AHarpoonRifle* GetHarpoonRifle(class ADBDPlayer* player);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GunslingerUtilities">();
	}
	static class UGunslingerUtilities* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGunslingerUtilities>();
	}
};
static_assert(alignof(UGunslingerUtilities) == 0x000008, "Wrong alignment on UGunslingerUtilities");
static_assert(sizeof(UGunslingerUtilities) == 0x000030, "Wrong size on UGunslingerUtilities");

// Class TheGunslinger.HarpoonChainPositioner
// 0x0088 (0x0140 - 0x00B8)
class UHarpoonChainPositioner final : public UActorComponent
{
public:
	TSubclassOf<class AHarpoonProp>               _harpoonPropClass;                                 // 0x00B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   _survivorAttachSocket;                             // 0x00C0(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   _animationSocket;                                  // 0x00CC(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _reelBackToRifleSpeed;                             // 0x00D8(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _harpoonMinimumSnapBackDistance;                   // 0x0100(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHarpoonProp*                           _harpoonProp;                                      // 0x0108(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AHarpoonProjectile*                     _harpoonProjectile;                                // 0x0110(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ADBDPlayer*                             _collector;                                        // 0x0118(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_120[0x8];                                      // 0x0120(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class ARifleChain*                            _chain;                                            // 0x0128(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_130[0x10];                                     // 0x0130(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AttachToAnimSocket();
	void AttachToRifle();
	void OnCurrentHarpoonChanged(class AActor* currentHarpoon);
	void OnHarpoonLoadedOnRifle();
	void OnHarpoonTravelingChanged(bool isTravelling);
	void OnOwnerCollected(class ADBDPlayer* collector);

	class AActor* GetCurrentHarpoon() const;
	class AHarpoonProp* GetHarpoonProp() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HarpoonChainPositioner">();
	}
	static class UHarpoonChainPositioner* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHarpoonChainPositioner>();
	}
};
static_assert(alignof(UHarpoonChainPositioner) == 0x000008, "Wrong alignment on UHarpoonChainPositioner");
static_assert(sizeof(UHarpoonChainPositioner) == 0x000140, "Wrong size on UHarpoonChainPositioner");
static_assert(offsetof(UHarpoonChainPositioner, _harpoonPropClass) == 0x0000B8, "Member 'UHarpoonChainPositioner::_harpoonPropClass' has a wrong offset!");
static_assert(offsetof(UHarpoonChainPositioner, _survivorAttachSocket) == 0x0000C0, "Member 'UHarpoonChainPositioner::_survivorAttachSocket' has a wrong offset!");
static_assert(offsetof(UHarpoonChainPositioner, _animationSocket) == 0x0000CC, "Member 'UHarpoonChainPositioner::_animationSocket' has a wrong offset!");
static_assert(offsetof(UHarpoonChainPositioner, _reelBackToRifleSpeed) == 0x0000D8, "Member 'UHarpoonChainPositioner::_reelBackToRifleSpeed' has a wrong offset!");
static_assert(offsetof(UHarpoonChainPositioner, _harpoonMinimumSnapBackDistance) == 0x000100, "Member 'UHarpoonChainPositioner::_harpoonMinimumSnapBackDistance' has a wrong offset!");
static_assert(offsetof(UHarpoonChainPositioner, _harpoonProp) == 0x000108, "Member 'UHarpoonChainPositioner::_harpoonProp' has a wrong offset!");
static_assert(offsetof(UHarpoonChainPositioner, _harpoonProjectile) == 0x000110, "Member 'UHarpoonChainPositioner::_harpoonProjectile' has a wrong offset!");
static_assert(offsetof(UHarpoonChainPositioner, _collector) == 0x000118, "Member 'UHarpoonChainPositioner::_collector' has a wrong offset!");
static_assert(offsetof(UHarpoonChainPositioner, _chain) == 0x000128, "Member 'UHarpoonChainPositioner::_chain' has a wrong offset!");

// Class TheGunslinger.HarpoonedSurvivorSubAnimInstance
// 0x00B0 (0x0600 - 0x0550)
class UHarpoonedSurvivorSubAnimInstance final : public UBaseSurvivorAnimInstance
{
public:
	uint8                                         Pad_548[0x8];                                      // 0x0548(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _linkedMaxSpeed;                                   // 0x0550(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _timeBeforeHarpoonHitReset;                        // 0x0554(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _hitHarpoonedEnterEvent;                           // 0x0558(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _chainBreakEnterEvent;                             // 0x0564(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isChainLinked;                                    // 0x0570(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isBeingReeled;                                    // 0x0571(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _hasLinkInput;                                     // 0x0572(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_573[0x1];                                      // 0x0573(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _linkInputX;                                       // 0x0574(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _linkInputY;                                       // 0x0578(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _chainBreakTrigger;                                // 0x057C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _triggerHarpoonHit;                                // 0x057D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_57E[0x2];                                      // 0x057E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _harpoonHitTurnAnimNormalizedStartTime;            // 0x0580(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _harpoonHitAnimTurnRight;                          // 0x0584(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isCrawling;                                       // 0x0585(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isIdle;                                           // 0x0586(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_587[0x1];                                      // 0x0587(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _walkAnimSpeed;                                    // 0x0588(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _yaw;                                              // 0x058C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _pitch;                                            // 0x0590(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_594[0x6C];                                     // 0x0594(0x006C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HarpoonedSurvivorSubAnimInstance">();
	}
	static class UHarpoonedSurvivorSubAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHarpoonedSurvivorSubAnimInstance>();
	}
};
static_assert(alignof(UHarpoonedSurvivorSubAnimInstance) == 0x000010, "Wrong alignment on UHarpoonedSurvivorSubAnimInstance");
static_assert(sizeof(UHarpoonedSurvivorSubAnimInstance) == 0x000600, "Wrong size on UHarpoonedSurvivorSubAnimInstance");
static_assert(offsetof(UHarpoonedSurvivorSubAnimInstance, _linkedMaxSpeed) == 0x000550, "Member 'UHarpoonedSurvivorSubAnimInstance::_linkedMaxSpeed' has a wrong offset!");
static_assert(offsetof(UHarpoonedSurvivorSubAnimInstance, _timeBeforeHarpoonHitReset) == 0x000554, "Member 'UHarpoonedSurvivorSubAnimInstance::_timeBeforeHarpoonHitReset' has a wrong offset!");
static_assert(offsetof(UHarpoonedSurvivorSubAnimInstance, _hitHarpoonedEnterEvent) == 0x000558, "Member 'UHarpoonedSurvivorSubAnimInstance::_hitHarpoonedEnterEvent' has a wrong offset!");
static_assert(offsetof(UHarpoonedSurvivorSubAnimInstance, _chainBreakEnterEvent) == 0x000564, "Member 'UHarpoonedSurvivorSubAnimInstance::_chainBreakEnterEvent' has a wrong offset!");
static_assert(offsetof(UHarpoonedSurvivorSubAnimInstance, _isChainLinked) == 0x000570, "Member 'UHarpoonedSurvivorSubAnimInstance::_isChainLinked' has a wrong offset!");
static_assert(offsetof(UHarpoonedSurvivorSubAnimInstance, _isBeingReeled) == 0x000571, "Member 'UHarpoonedSurvivorSubAnimInstance::_isBeingReeled' has a wrong offset!");
static_assert(offsetof(UHarpoonedSurvivorSubAnimInstance, _hasLinkInput) == 0x000572, "Member 'UHarpoonedSurvivorSubAnimInstance::_hasLinkInput' has a wrong offset!");
static_assert(offsetof(UHarpoonedSurvivorSubAnimInstance, _linkInputX) == 0x000574, "Member 'UHarpoonedSurvivorSubAnimInstance::_linkInputX' has a wrong offset!");
static_assert(offsetof(UHarpoonedSurvivorSubAnimInstance, _linkInputY) == 0x000578, "Member 'UHarpoonedSurvivorSubAnimInstance::_linkInputY' has a wrong offset!");
static_assert(offsetof(UHarpoonedSurvivorSubAnimInstance, _chainBreakTrigger) == 0x00057C, "Member 'UHarpoonedSurvivorSubAnimInstance::_chainBreakTrigger' has a wrong offset!");
static_assert(offsetof(UHarpoonedSurvivorSubAnimInstance, _triggerHarpoonHit) == 0x00057D, "Member 'UHarpoonedSurvivorSubAnimInstance::_triggerHarpoonHit' has a wrong offset!");
static_assert(offsetof(UHarpoonedSurvivorSubAnimInstance, _harpoonHitTurnAnimNormalizedStartTime) == 0x000580, "Member 'UHarpoonedSurvivorSubAnimInstance::_harpoonHitTurnAnimNormalizedStartTime' has a wrong offset!");
static_assert(offsetof(UHarpoonedSurvivorSubAnimInstance, _harpoonHitAnimTurnRight) == 0x000584, "Member 'UHarpoonedSurvivorSubAnimInstance::_harpoonHitAnimTurnRight' has a wrong offset!");
static_assert(offsetof(UHarpoonedSurvivorSubAnimInstance, _isCrawling) == 0x000585, "Member 'UHarpoonedSurvivorSubAnimInstance::_isCrawling' has a wrong offset!");
static_assert(offsetof(UHarpoonedSurvivorSubAnimInstance, _isIdle) == 0x000586, "Member 'UHarpoonedSurvivorSubAnimInstance::_isIdle' has a wrong offset!");
static_assert(offsetof(UHarpoonedSurvivorSubAnimInstance, _walkAnimSpeed) == 0x000588, "Member 'UHarpoonedSurvivorSubAnimInstance::_walkAnimSpeed' has a wrong offset!");
static_assert(offsetof(UHarpoonedSurvivorSubAnimInstance, _yaw) == 0x00058C, "Member 'UHarpoonedSurvivorSubAnimInstance::_yaw' has a wrong offset!");
static_assert(offsetof(UHarpoonedSurvivorSubAnimInstance, _pitch) == 0x000590, "Member 'UHarpoonedSurvivorSubAnimInstance::_pitch' has a wrong offset!");

// Class TheGunslinger.HarpoonLauncher
// 0x0058 (0x01D8 - 0x0180)
class UHarpoonLauncher final : public UKillerProjectileLauncher
{
public:
	struct FDBDTunableRowHandle                   _launchSpeed;                                      // 0x0180(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _launchDistanceFromCamera;                         // 0x01A8(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _launchZOffset;                                    // 0x01D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HarpoonLauncher">();
	}
	static class UHarpoonLauncher* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHarpoonLauncher>();
	}
};
static_assert(alignof(UHarpoonLauncher) == 0x000008, "Wrong alignment on UHarpoonLauncher");
static_assert(sizeof(UHarpoonLauncher) == 0x0001D8, "Wrong size on UHarpoonLauncher");
static_assert(offsetof(UHarpoonLauncher, _launchSpeed) == 0x000180, "Member 'UHarpoonLauncher::_launchSpeed' has a wrong offset!");
static_assert(offsetof(UHarpoonLauncher, _launchDistanceFromCamera) == 0x0001A8, "Member 'UHarpoonLauncher::_launchDistanceFromCamera' has a wrong offset!");
static_assert(offsetof(UHarpoonLauncher, _launchZOffset) == 0x0001D0, "Member 'UHarpoonLauncher::_launchZOffset' has a wrong offset!");

// Class TheGunslinger.HarpoonProjectile
// 0x00D0 (0x0408 - 0x0338)
class AHarpoonProjectile final : public AKillerProjectile
{
public:
	uint8                                         Pad_338[0x78];                                     // 0x0338(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _launchDistanceFromCamera;                         // 0x03B0(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHarpoonProjectileMovementComponent*    _movement;                                         // 0x03D8(0x0008)(Edit, ExportObject, ZeroConstructor, Transient, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPrimitiveComponent*                    _environmentCollider;                              // 0x03E0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
