#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheHillbilly

#include "Basic.hpp"


namespace SDK::Params
{

// Function TheHillbilly.HillbillyChainsawOverheatComponent.OnHeatChargeUpdate
// 0x0008 (0x0008 - 0x0000)
struct HillbillyChainsawOverheatComponent_OnHeatChargeUpdate final
{
public:
	float                                         currentCharge;                                     // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         previosCharge;                                     // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HillbillyChainsawOverheatComponent_OnHeatChargeUpdate) == 0x000004, "Wrong alignment on HillbillyChainsawOverheatComponent_OnHeatChargeUpdate");
static_assert(sizeof(HillbillyChainsawOverheatComponent_OnHeatChargeUpdate) == 0x000008, "Wrong size on HillbillyChainsawOverheatComponent_OnHeatChargeUpdate");
static_assert(offsetof(HillbillyChainsawOverheatComponent_OnHeatChargeUpdate, currentCharge) == 0x000000, "Member 'HillbillyChainsawOverheatComponent_OnHeatChargeUpdate::currentCharge' has a wrong offset!");
static_assert(offsetof(HillbillyChainsawOverheatComponent_OnHeatChargeUpdate, previosCharge) == 0x000004, "Member 'HillbillyChainsawOverheatComponent_OnHeatChargeUpdate::previosCharge' has a wrong offset!");

// Function TheHillbilly.HillbillyChainsawOverheatComponent.IsChainsawOverheating
// 0x0001 (0x0001 - 0x0000)
struct HillbillyChainsawOverheatComponent_IsChainsawOverheating final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HillbillyChainsawOverheatComponent_IsChainsawOverheating) == 0x000001, "Wrong alignment on HillbillyChainsawOverheatComponent_IsChainsawOverheating");
static_assert(sizeof(HillbillyChainsawOverheatComponent_IsChainsawOverheating) == 0x000001, "Wrong size on HillbillyChainsawOverheatComponent_IsChainsawOverheating");
static_assert(offsetof(HillbillyChainsawOverheatComponent_IsChainsawOverheating, ReturnValue) == 0x000000, "Member 'HillbillyChainsawOverheatComponent_IsChainsawOverheating::ReturnValue' has a wrong offset!");

// Function TheHillbilly.HillbillyOverheatPresentationItemProgressComponent.SetHillbillyChainsawOverheatComponent
// 0x0008 (0x0008 - 0x0000)
struct HillbillyOverheatPresentationItemProgressComponent_SetHillbillyChainsawOverheatComponent final
{
public:
	class UHillbillyChainsawOverheatComponent*    hillbillyChainsawOverheatComponent;                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HillbillyOverheatPresentationItemProgressComponent_SetHillbillyChainsawOverheatComponent) == 0x000008, "Wrong alignment on HillbillyOverheatPresentationItemProgressComponent_SetHillbillyChainsawOverheatComponent");
static_assert(sizeof(HillbillyOverheatPresentationItemProgressComponent_SetHillbillyChainsawOverheatComponent) == 0x000008, "Wrong size on HillbillyOverheatPresentationItemProgressComponent_SetHillbillyChainsawOverheatComponent");
static_assert(offsetof(HillbillyOverheatPresentationItemProgressComponent_SetHillbillyChainsawOverheatComponent, hillbillyChainsawOverheatComponent) == 0x000000, "Member 'HillbillyOverheatPresentationItemProgressComponent_SetHillbillyChainsawOverheatComponent::hillbillyChainsawOverheatComponent' has a wrong offset!");

}

