#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheHillbilly

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "DBDCompetence_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "DBDAnimation_classes.hpp"
#include "DBDAttack_classes.hpp"
#include "DeadByDaylight_classes.hpp"
#include "GameplayTagUtilities_structs.hpp"
#include "StatSystem_structs.hpp"
#include "Competence_classes.hpp"
#include "AnimationUtilities_structs.hpp"


namespace SDK
{

// Class TheHillbilly.ChainsawRevInteraction
// 0x0060 (0x07A0 - 0x0740)
class UChainsawRevInteraction : public UChargeableInteractionDefinition
{
public:
	uint8                                         Pad_740[0x30];                                     // 0x0740(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   _soundCueDistanceDataID;                           // 0x0770(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_77C[0x4];                                      // 0x077C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          _chainsawRevStartAkAudioEvent;                     // 0x0780(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAkAudioEvent*                          _chainsawRevEndAkAudioEvent;                       // 0x0788(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ASlasherPlayer*                         _owningSlasher;                                    // 0x0790(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_798[0x8];                                      // 0x0798(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnLevelReadyToPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChainsawRevInteraction">();
	}
	static class UChainsawRevInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChainsawRevInteraction>();
	}
};
static_assert(alignof(UChainsawRevInteraction) == 0x000010, "Wrong alignment on UChainsawRevInteraction");
static_assert(sizeof(UChainsawRevInteraction) == 0x0007A0, "Wrong size on UChainsawRevInteraction");
static_assert(offsetof(UChainsawRevInteraction, _soundCueDistanceDataID) == 0x000770, "Member 'UChainsawRevInteraction::_soundCueDistanceDataID' has a wrong offset!");
static_assert(offsetof(UChainsawRevInteraction, _chainsawRevStartAkAudioEvent) == 0x000780, "Member 'UChainsawRevInteraction::_chainsawRevStartAkAudioEvent' has a wrong offset!");
static_assert(offsetof(UChainsawRevInteraction, _chainsawRevEndAkAudioEvent) == 0x000788, "Member 'UChainsawRevInteraction::_chainsawRevEndAkAudioEvent' has a wrong offset!");
static_assert(offsetof(UChainsawRevInteraction, _owningSlasher) == 0x000790, "Member 'UChainsawRevInteraction::_owningSlasher' has a wrong offset!");

// Class TheHillbilly.HillbillyChainsawAttackSuccessSubstate
// 0x0000 (0x0118 - 0x0118)
class UHillbillyChainsawAttackSuccessSubstate : public UPounceAttackSuccessSubstate
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HillbillyChainsawAttackSuccessSubstate">();
	}
	static class UHillbillyChainsawAttackSuccessSubstate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHillbillyChainsawAttackSuccessSubstate>();
	}
};
static_assert(alignof(UHillbillyChainsawAttackSuccessSubstate) == 0x000008, "Wrong alignment on UHillbillyChainsawAttackSuccessSubstate");
static_assert(sizeof(UHillbillyChainsawAttackSuccessSubstate) == 0x000118, "Wrong size on UHillbillyChainsawAttackSuccessSubstate");

// Class TheHillbilly.ChainsawAnalyticsBaseComponent
// 0x0048 (0x0100 - 0x00B8)
class UChainsawAnalyticsBaseComponent : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x18];                                      // 0x00B8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _maxDistanceFromHookToBeConsideredCamping;         // 0x00D0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D4[0x2C];                                      // 0x00D4(0x002C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChainsawAnalyticsBaseComponent">();
	}
	static class UChainsawAnalyticsBaseComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChainsawAnalyticsBaseComponent>();
	}
};
static_assert(alignof(UChainsawAnalyticsBaseComponent) == 0x000008, "Wrong alignment on UChainsawAnalyticsBaseComponent");
static_assert(sizeof(UChainsawAnalyticsBaseComponent) == 0x000100, "Wrong size on UChainsawAnalyticsBaseComponent");
static_assert(offsetof(UChainsawAnalyticsBaseComponent, _maxDistanceFromHookToBeConsideredCamping) == 0x0000D0, "Member 'UChainsawAnalyticsBaseComponent::_maxDistanceFromHookToBeConsideredCamping' has a wrong offset!");

// Class TheHillbilly.HillbillyChainsawAttackMissSubstate
// 0x0000 (0x0120 - 0x0120)
class UHillbillyChainsawAttackMissSubstate : public UPounceAttackMissSubstate
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HillbillyChainsawAttackMissSubstate">();
	}
	static class UHillbillyChainsawAttackMissSubstate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHillbillyChainsawAttackMissSubstate>();
	}
};
static_assert(alignof(UHillbillyChainsawAttackMissSubstate) == 0x000008, "Wrong alignment on UHillbillyChainsawAttackMissSubstate");
static_assert(sizeof(UHillbillyChainsawAttackMissSubstate) == 0x000120, "Wrong size on UHillbillyChainsawAttackMissSubstate");

// Class TheHillbilly.HillbillyChainsawAttack
// 0x0070 (0x03F0 - 0x0380)
class UHillbillyChainsawAttack : public UPounceAttack
{
public:
	uint8                                         Pad_380[0x58];                                     // 0x0380(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           _chainsawHitGameEventTag;                          // 0x03D8(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           _chainsawAttemptGameEventTag;                      // 0x03E4(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HillbillyChainsawAttack">();
	}
	static class UHillbillyChainsawAttack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHillbillyChainsawAttack>();
	}
};
static_assert(alignof(UHillbillyChainsawAttack) == 0x000010, "Wrong alignment on UHillbillyChainsawAttack");
static_assert(sizeof(UHillbillyChainsawAttack) == 0x0003F0, "Wrong size on UHillbillyChainsawAttack");
static_assert(offsetof(UHillbillyChainsawAttack, _chainsawHitGameEventTag) == 0x0003D8, "Member 'UHillbillyChainsawAttack::_chainsawHitGameEventTag' has a wrong offset!");
static_assert(offsetof(UHillbillyChainsawAttack, _chainsawAttemptGameEventTag) == 0x0003E4, "Member 'UHillbillyChainsawAttack::_chainsawAttemptGameEventTag' has a wrong offset!");

// Class TheHillbilly.HillbillyChainsawAttackObstructSubstate
// 0x0000 (0x0128 - 0x0128)
class UHillbillyChainsawAttackObstructSubstate : public UPounceAttackObstructSubstate
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HillbillyChainsawAttackObstructSubstate">();
	}
	static class UHillbillyChainsawAttackObstructSubstate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHillbillyChainsawAttackObstructSubstate>();
	}
};
static_assert(alignof(UHillbillyChainsawAttackObstructSubstate) == 0x000008, "Wrong alignment on UHillbillyChainsawAttackObstructSubstate");
static_assert(sizeof(UHillbillyChainsawAttackObstructSubstate) == 0x000128, "Wrong size on UHillbillyChainsawAttackObstructSubstate");

// Class TheHillbilly.HillbillyChainsawAttackOpenSubstate
// 0x0048 (0x0178 - 0x0130)
class UHillbillyChainsawAttackOpenSubstate : public UPounceAttackOpenSubstate
{
public:
	uint8                                         Pad_130[0x48];                                     // 0x0130(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HillbillyChainsawAttackOpenSubstate">();
	}
	static class UHillbillyChainsawAttackOpenSubstate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHillbillyChainsawAttackOpenSubstate>();
	}
};
static_assert(alignof(UHillbillyChainsawAttackOpenSubstate) == 0x000008, "Wrong alignment on UHillbillyChainsawAttackOpenSubstate");
static_assert(sizeof(UHillbillyChainsawAttackOpenSubstate) == 0x000178, "Wrong size on UHillbillyChainsawAttackOpenSubstate");

// Class TheHillbilly.HillbillyChainsawAttackHittingSubstate
// 0x0000 (0x01A0 - 0x01A0)
class UHillbillyChainsawAttackHittingSubstate : public UPounceAttackHittingSubstate
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HillbillyChainsawAttackHittingSubstate">();
	}
	static class UHillbillyChainsawAttackHittingSubstate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHillbillyChainsawAttackHittingSubstate>();
	}
};
static_assert(alignof(UHillbillyChainsawAttackHittingSubstate) == 0x000008, "Wrong alignment on UHillbillyChainsawAttackHittingSubstate");
static_assert(sizeof(UHillbillyChainsawAttackHittingSubstate) == 0x0001A0, "Wrong size on UHillbillyChainsawAttackHittingSubstate");

// Class TheHillbilly.ApexMufflerAddon
// 0x0000 (0x02C8 - 0x02C8)
class UApexMufflerAddon final : public USpawnEffectsOnAllSurvivorsBaseAddon
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ApexMufflerAddon">();
	}
	static class UApexMufflerAddon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UApexMufflerAddon>();
	}
};
static_assert(alignof(UApexMufflerAddon) == 0x000008, "Wrong alignment on UApexMufflerAddon");
static_assert(sizeof(UApexMufflerAddon) == 0x0002C8, "Wrong size on UApexMufflerAddon");

// Class TheHillbilly.HillbillyAnalyticsComponent
// 0x0080 (0x0180 - 0x0100)
class UHillbillyAnalyticsComponent final : public UChainsawAnalyticsBaseComponent
{
public:
	uint8                                         Pad_100[0x80];                                     // 0x0100(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HillbillyAnalyticsComponent">();
	}
	static class UHillbillyAnalyticsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHillbillyAnalyticsComponent>();
	}
};
static_assert(alignof(UHillbillyAnalyticsComponent) == 0x000008, "Wrong alignment on UHillbillyAnalyticsComponent");
static_assert(sizeof(UHillbillyAnalyticsComponent) == 0x000180, "Wrong size on UHillbillyAnalyticsComponent");

// Class TheHillbilly.HillbillyAnimInstance
// 0x0000 (0x0600 - 0x0600)
class UHillbillyAnimInstance final : public UKillerAnimInstance
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HillbillyAnimInstance">();
	}
	static class UHillbillyAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHillbillyAnimInstance>();
	}
};
static_assert(alignof(UHillbillyAnimInstance) == 0x000010, "Wrong alignment on UHillbillyAnimInstance");
static_assert(sizeof(UHillbillyAnimInstance) == 0x000600, "Wrong size on UHillbillyAnimInstance");

// Class TheHillbilly.HillbillyChainsawHitEventAddon
// 0x0000 (0x02C8 - 0x02C8)
class UHillbillyChainsawHitEventAddon final : public UOnEventBaseAddon
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HillbillyChainsawHitEventAddon">();
	}
	static class UHillbillyChainsawHitEventAddon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHillbillyChainsawHitEventAddon>();
	}
};
static_assert(alignof(UHillbillyChainsawHitEventAddon) == 0x000008, "Wrong alignment on UHillbillyChainsawHitEventAddon");
static_assert(sizeof(UHillbillyChainsawHitEventAddon) == 0x0002C8, "Wrong size on UHillbillyChainsawHitEventAddon");

// Class TheHillbilly.HillbillyChainsawOverheatComponent
// 0x0460 (0x0518 - 0x00B8)
class UHillbillyChainsawOverheatComponent final : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(const float currentChargePercent, const bool isChainsawOverheating)> OnHeatChargeUpdateDelegate; // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_C8[0x118];                                     // 0x00C8(0x0118)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTagStateBool                          _isChainsawOverheating;                            // 0x01E0(0x0030)(Net, Transient, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPowerChargeComponent*                  _chainsawHeatCharge;                               // 0x0210(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _heatMaxCharge;                                    // 0x0218(0x0080)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _heatRevStartAmount;                               // 0x0298(0x0080)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _heatRevChargeRate;                                // 0x0318(0x0080)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _heatDashChargeRate;                               // 0x0398(0x0080)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _heatDischargeRate;                                // 0x0418(0x0080)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _overheatDischargeRate;                            // 0x0498(0x0080)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Authority_OnHeatChargeEmpty();
	void Authority_OnHeatChargeFull();
	void OnHeatChargeUpdate(const float currentCharge, const float previosCharge);
	void OnLevelReadyToPlay();
	void OnRep_IsChainsawOverheating();

	bool IsChainsawOverheating() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HillbillyChainsawOverheatComponent">();
	}
	static class UHillbillyChainsawOverheatComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHillbillyChainsawOverheatComponent>();
	}
};
static_assert(alignof(UHillbillyChainsawOverheatComponent) == 0x000008, "Wrong alignment on UHillbillyChainsawOverheatComponent");
static_assert(sizeof(UHillbillyChainsawOverheatComponent) == 0x000518, "Wrong size on UHillbillyChainsawOverheatComponent");
static_assert(offsetof(UHillbillyChainsawOverheatComponent, OnHeatChargeUpdateDelegate) == 0x0000B8, "Member 'UHillbillyChainsawOverheatComponent::OnHeatChargeUpdateDelegate' has a wrong offset!");
static_assert(offsetof(UHillbillyChainsawOverheatComponent, _isChainsawOverheating) == 0x0001E0, "Member 'UHillbillyChainsawOverheatComponent::_isChainsawOverheating' has a wrong offset!");
static_assert(offsetof(UHillbillyChainsawOverheatComponent, _chainsawHeatCharge) == 0x000210, "Member 'UHillbillyChainsawOverheatComponent::_chainsawHeatCharge' has a wrong offset!");
static_assert(offsetof(UHillbillyChainsawOverheatComponent, _heatMaxCharge) == 0x000218, "Member 'UHillbillyChainsawOverheatComponent::_heatMaxCharge' has a wrong offset!");
static_assert(offsetof(UHillbillyChainsawOverheatComponent, _heatRevStartAmount) == 0x000298, "Member 'UHillbillyChainsawOverheatComponent::_heatRevStartAmount' has a wrong offset!");
static_assert(offsetof(UHillbillyChainsawOverheatComponent, _heatRevChargeRate) == 0x000318, "Member 'UHillbillyChainsawOverheatComponent::_heatRevChargeRate' has a wrong offset!");
static_assert(offsetof(UHillbillyChainsawOverheatComponent, _heatDashChargeRate) == 0x000398, "Member 'UHillbillyChainsawOverheatComponent::_heatDashChargeRate' has a wrong offset!");
static_assert(offsetof(UHillbillyChainsawOverheatComponent, _heatDischargeRate) == 0x000418, "Member 'UHillbillyChainsawOverheatComponent::_heatDischargeRate' has a wrong offset!");
static_assert(offsetof(UHillbillyChainsawOverheatComponent, _overheatDischargeRate) == 0x000498, "Member 'UHillbillyChainsawOverheatComponent::_overheatDischargeRate' has a wrong offset!");

// Class TheHillbilly.HillbillyChainsawRevInteraction
// 0x0060 (0x0800 - 0x07A0)
class UHillbillyChainsawRevInteraction final : public UChainsawRevInteraction
{
public:
	uint8                                         Pad_7A0[0x60];                                     // 0x07A0(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HillbillyChainsawRevInteraction">();
	}
	static class UHillbillyChainsawRevInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHillbillyChainsawRevInteraction>();
	}
};
static_assert(alignof(UHillbillyChainsawRevInteraction) == 0x000010, "Wrong alignment on UHillbillyChainsawRevInteraction");
static_assert(sizeof(UHillbillyChainsawRevInteraction) == 0x000800, "Wrong size on UHillbillyChainsawRevInteraction");

// Class TheHillbilly.HillbillyChainsawSubAnimInstance
// 0x0030 (0x0640 - 0x0610)
class UHillbillyChainsawSubAnimInstance final : public UBaseKillerAttackSubAnimInstance
{
public:
	bool                                          _isRevvingChainsaw;                                // 0x0610(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isRevvingChainsawCancelled;                       // 0x0611(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isChainsawSprinting;                              // 0x0612(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isWaitingForChainsaw;                             // 0x0613(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_614[0x2C];                                     // 0x0614(0x002C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HillbillyChainsawSubAnimInstance">();
	}
	static class UHillbillyChainsawSubAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHillbillyChainsawSubAnimInstance>();
	}
};
static_assert(alignof(UHillbillyChainsawSubAnimInstance) == 0x000010, "Wrong alignment on UHillbillyChainsawSubAnimInstance");
static_assert(sizeof(UHillbillyChainsawSubAnimInstance) == 0x000640, "Wrong size on UHillbillyChainsawSubAnimInstance");
static_assert(offsetof(UHillbillyChainsawSubAnimInstance, _isRevvingChainsaw) == 0x000610, "Member 'UHillbillyChainsawSubAnimInstance::_isRevvingChainsaw' has a wrong offset!");
static_assert(offsetof(UHillbillyChainsawSubAnimInstance, _isRevvingChainsawCancelled) == 0x000611, "Member 'UHillbillyChainsawSubAnimInstance::_isRevvingChainsawCancelled' has a wrong offset!");
static_assert(offsetof(UHillbillyChainsawSubAnimInstance, _isChainsawSprinting) == 0x000612, "Member 'UHillbillyChainsawSubAnimInstance::_isChainsawSprinting' has a wrong offset!");
static_assert(offsetof(UHillbillyChainsawSubAnimInstance, _isWaitingForChainsaw) == 0x000613, "Member 'UHillbillyChainsawSubAnimInstance::_isWaitingForChainsaw' has a wrong offset!");

// Class TheHillbilly.HillbillyOverheatPresentationItemProgressComponent
// 0x0008 (0x00C0 - 0x00B8)
class UHillbillyOverheatPresentationItemProgressComponent final : public UPresentationItemProgressComponent
{
public:
	class UHillbillyChainsawOverheatComponent*    _hillbillyChainsawOverheatComponent;               // 0x00B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetHillbillyChainsawOverheatComponent(class UHillbillyChainsawOverheatComponent* hillbillyChainsawOverheatComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HillbillyOverheatPresentationItemProgressComponent">();
	}
	static class UHillbillyOverheatPresentationItemProgressComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHillbillyOverheatPresentationItemProgressComponent>();
	}
};
static_assert(alignof(UHillbillyOverheatPresentationItemProgressComponent) == 0x000008, "Wrong alignment on UHillbillyOverheatPresentationItemProgressComponent");
static_assert(sizeof(UHillbillyOverheatPresentationItemProgressComponent) == 0x0000C0, "Wrong size on UHillbillyOverheatPresentationItemProgressComponent");
static_assert(offsetof(UHillbillyOverheatPresentationItemProgressComponent, _hillbillyChainsawOverheatComponent) == 0x0000B8, "Member 'UHillbillyOverheatPresentationItemProgressComponent::_hillbillyChainsawOverheatComponent' has a wrong offset!");

// Class TheHillbilly.IridescentBrickAddon
// 0x0038 (0x0300 - 0x02C8)
class UIridescentBrickAddon final : public UOnEventBaseAddon
{
public:
	uint8                                         Pad_2C8[0x28];                                     // 0x02C8(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _undetectableStatusEffectClass;                    // 0x02F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStatusEffect*                          _undetectableStatusEffect;                         // 0x02F8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IridescentBrickAddon">();
	}
	static class UIridescentBrickAddon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIridescentBrickAddon>();
	}
};
static_assert(alignof(UIridescentBrickAddon) == 0x000008, "Wrong alignment on UIridescentBrickAddon");
static_assert(sizeof(UIridescentBrickAddon) == 0x000300, "Wrong size on UIridescentBrickAddon");
static_assert(offsetof(UIridescentBrickAddon, _undetectableStatusEffectClass) == 0x0002F0, "Member 'UIridescentBrickAddon::_undetectableStatusEffectClass' has a wrong offset!");
static_assert(offsetof(UIridescentBrickAddon, _undetectableStatusEffect) == 0x0002F8, "Member 'UIridescentBrickAddon::_undetectableStatusEffect' has a wrong offset!");

// Class TheHillbilly.LightbornAuraRevealEffect
// 0x0000 (0x0358 - 0x0358)
class ULightbornAuraRevealEffect final : public UBaseLingeringStatusEffect
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LightbornAuraRevealEffect">();
	}
	static class ULightbornAuraRevealEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULightbornAuraRevealEffect>();
	}
};
static_assert(alignof(ULightbornAuraRevealEffect) == 0x000008, "Wrong alignment on ULightbornAuraRevealEffect");
static_assert(sizeof(ULightbornAuraRevealEffect) == 0x000358, "Wrong size on ULightbornAuraRevealEffect");

// Class TheHillbilly.LightbornBlindFailedIndicatorCondition
// 0x0060 (0x0148 - 0x00E8)
class ULightbornBlindFailedIndicatorCondition final : public UEventDrivenModifierCondition
{
public:
	float                                         _conditionReevaluationTimerDurationAfterFailedBlind; // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EC[0x5C];                                      // 0x00EC(0x005C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LightbornBlindFailedIndicatorCondition">();
	}
	static class ULightbornBlindFailedIndicatorCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULightbornBlindFailedIndicatorCondition>();
	}
};
static_assert(alignof(ULightbornBlindFailedIndicatorCondition) == 0x000008, "Wrong alignment on ULightbornBlindFailedIndicatorCondition");
static_assert(sizeof(ULightbornBlindFailedIndicatorCondition) == 0x000148, "Wrong size on ULightbornBlindFailedIndicatorCondition");
static_assert(offsetof(ULightbornBlindFailedIndicatorCondition, _conditionReevaluationTimerDurationAfterFailedBlind) == 0x0000E8, "Member 'ULightbornBlindFailedIndicatorCondition::_conditionReevaluationTimerDurationAfterFailedBlind' has a wrong offset!");

// Class TheHillbilly.LoProChainsAddon
// 0x0058 (0x0310 - 0x02B8)
class ULoProChainsAddon final : public UItemAddon
{
public:
	struct FAnimationMontageDescriptor            _breakPalletMontage;                               // 0x02B8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         _halfDamageDurationAfterBreakable;                 // 0x02D8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _doesAddonIncludeBreakableWalls;                   // 0x02DC(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2DD[0x33];                                     // 0x02DD(0x0033)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LoProChainsAddon">();
	}
	static class ULoProChainsAddon* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoProChainsAddon>();
	}
};
static_assert(alignof(ULoProChainsAddon) == 0x000008, "Wrong alignment on ULoProChainsAddon");
static_assert(sizeof(ULoProChainsAddon) == 0x000310, "Wrong size on ULoProChainsAddon");
static_assert(offsetof(ULoProChainsAddon, _breakPalletMontage) == 0x0002B8, "Member 'ULoProChainsAddon::_breakPalletMontage' has a wrong offset!");
static_assert(offsetof(ULoProChainsAddon, _halfDamageDurationAfterBreakable) == 0x0002D8, "Member 'ULoProChainsAddon::_halfDamageDurationAfterBreakable' has a wrong offset!");
static_assert(offsetof(ULoProChainsAddon, _doesAddonIncludeBreakableWalls) == 0x0002DC, "Member 'ULoProChainsAddon::_doesAddonIncludeBreakableWalls' has a wrong offset!");

}

