#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheK25

#include "Basic.hpp"

#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "DBDBots_classes.hpp"
#include "DataTableUtilities_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DBDCompetence_classes.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "DBDAnimation_classes.hpp"
#include "Competence_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "SystemUtilities_structs.hpp"
#include "TheK25_structs.hpp"
#include "GameplayUtilities_classes.hpp"
#include "FiniteStateMachine_classes.hpp"
#include "StatSystem_structs.hpp"
#include "DBDInteraction_classes.hpp"
#include "Projectile_structs.hpp"
#include "Projectile_classes.hpp"
#include "DBDAttack_classes.hpp"
#include "DBDGameplay_structs.hpp"
#include "AnimationUtilities_structs.hpp"


namespace SDK
{

// Class TheK25.LamentConfiguration
// 0x02C0 (0x0770 - 0x04B0)
class ALamentConfiguration final : public ACollectable
{
public:
	uint8                                         Pad_4B0[0x38];                                     // 0x04B0(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class USpherePlayerOverlapComponent*          _interactable;                                     // 0x04E8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInteractor*                            _collectableInteractor;                            // 0x04F0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UK25CollectLamentConfigurationInteraction* _survivorCollectItemInteraction;                // 0x04F8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UK25CollectLamentConfigurationInteraction* _killerCollectItemInteraction;                  // 0x0500(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDOutlineComponent*                   _outlineComponent;                                 // 0x0508(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialHelper*                        _materialHelper;                                   // 0x0510(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULamentConfigurationOutlineStrategy*    _outlineStrategy;                                  // 0x0518(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULamentConfigurationSpawnStrategy*      _spawnStrategy;                                    // 0x0520(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULamentConfigurationChainHuntComponent* _chainHuntComponent;                               // 0x0528(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _dotProductMinValue;                               // 0x0530(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAttachToSocketNameEnum                       _survivorAttachmentSocket;                         // 0x0534(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAttachToSocketNameEnum                       _killerAttachmentSocket;                           // 0x0535(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_536[0x2];                                      // 0x0536(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimationMontageSlave*                 _montageFollower;                                  // 0x0538(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMontagePlayer*                         _montagePlayer;                                    // 0x0540(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AAnimationFollowerActor>    _chainAnimationActorClass;                         // 0x0548(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AK25LamentConfigurationTeleportIndicator> _lamentConfigurationTeleportIndicatorClass; // 0x0550(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _chainAnimationFollowerAttachmentSocketName;       // 0x0558(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_564[0x4];                                      // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAkObservedPlayerSoundLoop             _possessionSoundLoop;                              // 0x0568(0x0040)(Edit, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _respawnTimeAfterLamentConfigurationSolved;        // 0x05A8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _respawnTimeAfterKillerPickUp;                     // 0x05D0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _respawnTimeAfterSurvivorFreeBySelf;               // 0x05F8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _respawnTimeAfterSurvivorFreeByAttack;             // 0x0620(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _numberChainsToLaunchUponKillerPickUpLamentConfiguration; // 0x0648(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _hostageInteractionTime;                           // 0x0670(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELamentConfigurationState                     _localLamentConfigurationState;                    // 0x0698(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ELamentConfigurationState                     _lamentconfigurationState;                         // 0x0699(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_69A[0x6];                                      // 0x069A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAnimationFollowerActor*                _chainAnimationActor;                              // 0x06A0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6A8[0x48];                                     // 0x06A8(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          _survivorHeldHostage;                              // 0x06F0(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6F8[0x58];                                     // 0x06F8(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	class UBoxComponent*                          _standingOnLamentConfigurationCollisionChecker;    // 0x0750(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _timeAllowedToStandOnCubeBeforeTeleport;           // 0x0758(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _solvedLamentConfigurationDropDistanceToCollectorCentimeters; // 0x075C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _failedLamentConfigurationSolveDropDistanceToCollectorCentimeters; // 0x0760(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _solved;                                           // 0x0764(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _releasedByAttack;                                 // 0x0765(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_766[0x2];                                      // 0x0766(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AK25LamentConfigurationTeleportIndicator* _lamentConfigurationTeleportIndicator;           // 0x0768(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Authority_OnEndGameOver(const struct FGameplayTag& gameEventType, const struct FGameEventData& gameEventData);
	void Authority_OnGameEnded(const struct FGameplayTag& gameEventType, const struct FGameEventData& gameEventData);
	void Authority_OnIntroCompletedOrLevelReadyToPlay();
	void Authority_OnOverlapBegin(class UPrimitiveComponent* overlappedComponent, class AActor* other, class UPrimitiveComponent* otherComp, int32 otherBodyIndex, bool bFromSweep, const struct FHitResult& sweepResult);
	void Authority_OnOverlapEnd(class UPrimitiveComponent* overlappedComponent, class AActor* otherActor, class UPrimitiveComponent* otherComp, int32 otherBodyIndex);
	void Authority_OnSurvivorHitByControlledProjectile(const struct FGameplayTag& gameEventType, const struct FGameEventData& gameEventData);
	void Authority_RespawnLamentConfiguration(bool triggerChainHuntUponSpawning);
	void Cosmetic_BeginSolvingCubeSFX();
	void Cosmetic_EndSolvingCubeSFX(bool hasBeenSolved);
	void Cosmetic_OnChainHuntChargeEnd();
	void Cosmetic_OnChainHuntChargeStart(float chargeTime);
	void Cosmetic_OnChainHuntEndedEffects();
	void Cosmetic_OnChainHuntStartedEffects();
	void Cosmetic_OnHoldingSurvivorHostageEnd(bool hasEndedThroughKillerAttack);
	void Cosmetic_OnHoldingSurvivorHostageStart(float hostageDuration);
	void Cosmetic_OnKillerDownedSurvivorHoldingLamentConfiguration(class ASlasherPlayer* killer, class ACamperPlayer* survivorDowned);
	void Cosmetic_TriggerDisappearsSFX();
	void Cosmetic_TriggerOnSurvivorEscapedWithLamentConfigurationSFX();
	void Cosmetic_TriggerRespawnDuringChainHuntSFX();
	void Cosmetic_TriggerSolvedSFX();
	void Cosmetic_TriggerSpawnedSFX();
	void Cosmetic_TriggerSurvivorPickUpSFX();
	void Multicast_CorrectLamentConfigurationPosition(const struct FVector& newPosition);
	void Multicast_DownedSurvivorHoldingLamentConfiguration(class ACamperPlayer* survivor);
	void Multicast_TriggerKillerPickUpSFX(const TArray<class ACamperPlayer*>& affectedSurvivors);
	void Multicast_TriggerSolvedSFX();
	void OnCamperEscaped(const struct FGameplayTag& gameEventType, const struct FGameEventData& gameEventData);
	void OnRep_LamentConfigurationState();
	void OnRep_SurvivorHeldHostage(class ACamperPlayer* oldSurvivorHeldHostage);
	void TriggerKillerPickUpSFX(const TArray<class ACamperPlayer*>& affectedSurvivors);

	float GetChainHuntProgressPercentage() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LamentConfiguration">();
	}
	static class ALamentConfiguration* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALamentConfiguration>();
	}
};
static_assert(alignof(ALamentConfiguration) == 0x000008, "Wrong alignment on ALamentConfiguration");
static_assert(sizeof(ALamentConfiguration) == 0x000770, "Wrong size on ALamentConfiguration");
static_assert(offsetof(ALamentConfiguration, _interactable) == 0x0004E8, "Member 'ALamentConfiguration::_interactable' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _collectableInteractor) == 0x0004F0, "Member 'ALamentConfiguration::_collectableInteractor' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _survivorCollectItemInteraction) == 0x0004F8, "Member 'ALamentConfiguration::_survivorCollectItemInteraction' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _killerCollectItemInteraction) == 0x000500, "Member 'ALamentConfiguration::_killerCollectItemInteraction' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _outlineComponent) == 0x000508, "Member 'ALamentConfiguration::_outlineComponent' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _materialHelper) == 0x000510, "Member 'ALamentConfiguration::_materialHelper' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _outlineStrategy) == 0x000518, "Member 'ALamentConfiguration::_outlineStrategy' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _spawnStrategy) == 0x000520, "Member 'ALamentConfiguration::_spawnStrategy' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _chainHuntComponent) == 0x000528, "Member 'ALamentConfiguration::_chainHuntComponent' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _dotProductMinValue) == 0x000530, "Member 'ALamentConfiguration::_dotProductMinValue' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _survivorAttachmentSocket) == 0x000534, "Member 'ALamentConfiguration::_survivorAttachmentSocket' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _killerAttachmentSocket) == 0x000535, "Member 'ALamentConfiguration::_killerAttachmentSocket' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _montageFollower) == 0x000538, "Member 'ALamentConfiguration::_montageFollower' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _montagePlayer) == 0x000540, "Member 'ALamentConfiguration::_montagePlayer' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _chainAnimationActorClass) == 0x000548, "Member 'ALamentConfiguration::_chainAnimationActorClass' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _lamentConfigurationTeleportIndicatorClass) == 0x000550, "Member 'ALamentConfiguration::_lamentConfigurationTeleportIndicatorClass' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _chainAnimationFollowerAttachmentSocketName) == 0x000558, "Member 'ALamentConfiguration::_chainAnimationFollowerAttachmentSocketName' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _possessionSoundLoop) == 0x000568, "Member 'ALamentConfiguration::_possessionSoundLoop' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _respawnTimeAfterLamentConfigurationSolved) == 0x0005A8, "Member 'ALamentConfiguration::_respawnTimeAfterLamentConfigurationSolved' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _respawnTimeAfterKillerPickUp) == 0x0005D0, "Member 'ALamentConfiguration::_respawnTimeAfterKillerPickUp' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _respawnTimeAfterSurvivorFreeBySelf) == 0x0005F8, "Member 'ALamentConfiguration::_respawnTimeAfterSurvivorFreeBySelf' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _respawnTimeAfterSurvivorFreeByAttack) == 0x000620, "Member 'ALamentConfiguration::_respawnTimeAfterSurvivorFreeByAttack' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _numberChainsToLaunchUponKillerPickUpLamentConfiguration) == 0x000648, "Member 'ALamentConfiguration::_numberChainsToLaunchUponKillerPickUpLamentConfiguration' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _hostageInteractionTime) == 0x000670, "Member 'ALamentConfiguration::_hostageInteractionTime' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _localLamentConfigurationState) == 0x000698, "Member 'ALamentConfiguration::_localLamentConfigurationState' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _lamentconfigurationState) == 0x000699, "Member 'ALamentConfiguration::_lamentconfigurationState' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _chainAnimationActor) == 0x0006A0, "Member 'ALamentConfiguration::_chainAnimationActor' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _survivorHeldHostage) == 0x0006F0, "Member 'ALamentConfiguration::_survivorHeldHostage' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _standingOnLamentConfigurationCollisionChecker) == 0x000750, "Member 'ALamentConfiguration::_standingOnLamentConfigurationCollisionChecker' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _timeAllowedToStandOnCubeBeforeTeleport) == 0x000758, "Member 'ALamentConfiguration::_timeAllowedToStandOnCubeBeforeTeleport' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _solvedLamentConfigurationDropDistanceToCollectorCentimeters) == 0x00075C, "Member 'ALamentConfiguration::_solvedLamentConfigurationDropDistanceToCollectorCentimeters' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _failedLamentConfigurationSolveDropDistanceToCollectorCentimeters) == 0x000760, "Member 'ALamentConfiguration::_failedLamentConfigurationSolveDropDistanceToCollectorCentimeters' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _solved) == 0x000764, "Member 'ALamentConfiguration::_solved' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _releasedByAttack) == 0x000765, "Member 'ALamentConfiguration::_releasedByAttack' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _lamentConfigurationTeleportIndicator) == 0x000768, "Member 'ALamentConfiguration::_lamentConfigurationTeleportIndicator' has a wrong offset!");

// Class TheK25.Addon_K25Power_16
// 0x0018 (0x02D0 - 0x02B8)
class UAddon_K25Power_16 final : public UItemAddon
{
public:
	uint8                                         Pad_2B8[0x18];                                     // 0x02B8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K25Power_16">();
	}
	static class UAddon_K25Power_16* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K25Power_16>();
	}
};
static_assert(alignof(UAddon_K25Power_16) == 0x000008, "Wrong alignment on UAddon_K25Power_16");
static_assert(sizeof(UAddon_K25Power_16) == 0x0002D0, "Wrong size on UAddon_K25Power_16");

// Class TheK25.LamentConfigurationAnalyticsComponent
// 0x0038 (0x00F0 - 0x00B8)
class ULamentConfigurationAnalyticsComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x38];                                      // 0x00B8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LamentConfigurationAnalyticsComponent">();
	}
	static class ULamentConfigurationAnalyticsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULamentConfigurationAnalyticsComponent>();
	}
};
static_assert(alignof(ULamentConfigurationAnalyticsComponent) == 0x000008, "Wrong alignment on ULamentConfigurationAnalyticsComponent");
static_assert(sizeof(ULamentConfigurationAnalyticsComponent) == 0x0000F0, "Wrong size on ULamentConfigurationAnalyticsComponent");

// Class TheK25.AISkill_FindCollectable_LamentConfiguration
// 0x0020 (0x0150 - 0x0130)
class UAISkill_FindCollectable_LamentConfiguration final : public UAISkill_FindCollectable
{
public:
	struct FAITunableParameter                    StopChainHuntGoalWeight;                           // 0x0130(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    PreemptiveFindLamentGoalWeight;                    // 0x0140(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_FindCollectable_LamentConfiguration">();
	}
	static class UAISkill_FindCollectable_LamentConfiguration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_FindCollectable_LamentConfiguration>();
	}
};
static_assert(alignof(UAISkill_FindCollectable_LamentConfiguration) == 0x000008, "Wrong alignment on UAISkill_FindCollectable_LamentConfiguration");
static_assert(sizeof(UAISkill_FindCollectable_LamentConfiguration) == 0x000150, "Wrong size on UAISkill_FindCollectable_LamentConfiguration");
static_assert(offsetof(UAISkill_FindCollectable_LamentConfiguration, StopChainHuntGoalWeight) == 0x000130, "Member 'UAISkill_FindCollectable_LamentConfiguration::StopChainHuntGoalWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindCollectable_LamentConfiguration, PreemptiveFindLamentGoalWeight) == 0x000140, "Member 'UAISkill_FindCollectable_LamentConfiguration::PreemptiveFindLamentGoalWeight' has a wrong offset!");

// Class TheK25.AISkill_InteractionBreakFreeFromChains
// 0x0028 (0x01A8 - 0x0180)
class UAISkill_InteractionBreakFreeFromChains final : public UAISkill_Interaction
{
public:
	struct FDBDTunableRowHandle                   _breakFreeFromChainsMaxCharge;                     // 0x0180(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_InteractionBreakFreeFromChains">();
	}
	static class UAISkill_InteractionBreakFreeFromChains* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_InteractionBreakFreeFromChains>();
	}
};
static_assert(alignof(UAISkill_InteractionBreakFreeFromChains) == 0x000008, "Wrong alignment on UAISkill_InteractionBreakFreeFromChains");
static_assert(sizeof(UAISkill_InteractionBreakFreeFromChains) == 0x0001A8, "Wrong size on UAISkill_InteractionBreakFreeFromChains");
static_assert(offsetof(UAISkill_InteractionBreakFreeFromChains, _breakFreeFromChainsMaxCharge) == 0x000180, "Member 'UAISkill_InteractionBreakFreeFromChains::_breakFreeFromChainsMaxCharge' has a wrong offset!");

// Class TheK25.AISkill_InteractionUseItem_LamentConfiguration
// 0x0038 (0x01C0 - 0x0188)
class UAISkill_InteractionUseItem_LamentConfiguration final : public UAISkill_InteractionUseItem
{
public:
	struct FAITunableParameter                    SolveLamentThreshold;                              // 0x0188(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FDBDTunableRowHandle                   _solveLamentMaxCharge;                             // 0x0198(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_InteractionUseItem_LamentConfiguration">();
	}
	static class UAISkill_InteractionUseItem_LamentConfiguration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_InteractionUseItem_LamentConfiguration>();
	}
};
static_assert(alignof(UAISkill_InteractionUseItem_LamentConfiguration) == 0x000008, "Wrong alignment on UAISkill_InteractionUseItem_LamentConfiguration");
static_assert(sizeof(UAISkill_InteractionUseItem_LamentConfiguration) == 0x0001C0, "Wrong size on UAISkill_InteractionUseItem_LamentConfiguration");
static_assert(offsetof(UAISkill_InteractionUseItem_LamentConfiguration, SolveLamentThreshold) == 0x000188, "Member 'UAISkill_InteractionUseItem_LamentConfiguration::SolveLamentThreshold' has a wrong offset!");
static_assert(offsetof(UAISkill_InteractionUseItem_LamentConfiguration, _solveLamentMaxCharge) == 0x000198, "Member 'UAISkill_InteractionUseItem_LamentConfiguration::_solveLamentMaxCharge' has a wrong offset!");

// Class TheK25.ChainAttachedGateBlockerEffect
// 0x0028 (0x03B0 - 0x0388)
class UChainAttachedGateBlockerEffect final : public UGateBlockerEffect
{
public:
	struct FDBDTunableRowHandle                   _blockGateLingeringTimeDyingState;                 // 0x0388(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnSurvivorDamageStateChanged(const ECamperDamageState oldState, const ECamperDamageState newState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChainAttachedGateBlockerEffect">();
	}
	static class UChainAttachedGateBlockerEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChainAttachedGateBlockerEffect>();
	}
};
static_assert(alignof(UChainAttachedGateBlockerEffect) == 0x000008, "Wrong alignment on UChainAttachedGateBlockerEffect");
static_assert(sizeof(UChainAttachedGateBlockerEffect) == 0x0003B0, "Wrong size on UChainAttachedGateBlockerEffect");
static_assert(offsetof(UChainAttachedGateBlockerEffect, _blockGateLingeringTimeDyingState) == 0x000388, "Member 'UChainAttachedGateBlockerEffect::_blockGateLingeringTimeDyingState' has a wrong offset!");

// Class TheK25.IsChainHuntActive
// 0x0028 (0x0110 - 0x00E8)
class UIsChainHuntActive final : public UEventDrivenModifierCondition
{
public:
	uint8                                         Pad_E8[0x28];                                      // 0x00E8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IsChainHuntActive">();
	}
	static class UIsChainHuntActive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIsChainHuntActive>();
	}
};
static_assert(alignof(UIsChainHuntActive) == 0x000008, "Wrong alignment on UIsChainHuntActive");
static_assert(sizeof(UIsChainHuntActive) == 0x000110, "Wrong size on UIsChainHuntActive");

// Class TheK25.K25AnimInstance
// 0x0010 (0x0610 - 0x0600)
class UK25AnimInstance final : public UKillerAnimInstance
{
public:
	bool                                          _isTeleporting;                                    // 0x0600(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isPossessingGateway;                              // 0x0601(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isSelectingGatewayLocation;                       // 0x0602(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_603[0xD];                                      // 0x0603(0x000D)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K25AnimInstance">();
	}
	static class UK25AnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK25AnimInstance>();
	}
};
static_assert(alignof(UK25AnimInstance) == 0x000010, "Wrong alignment on UK25AnimInstance");
static_assert(sizeof(UK25AnimInstance) == 0x000610, "Wrong size on UK25AnimInstance");
static_assert(offsetof(UK25AnimInstance, _isTeleporting) == 0x000600, "Member 'UK25AnimInstance::_isTeleporting' has a wrong offset!");
static_assert(offsetof(UK25AnimInstance, _isPossessingGateway) == 0x000601, "Member 'UK25AnimInstance::_isPossessingGateway' has a wrong offset!");
static_assert(offsetof(UK25AnimInstance, _isSelectingGatewayLocation) == 0x000602, "Member 'UK25AnimInstance::_isSelectingGatewayLocation' has a wrong offset!");

// Class TheK25.K25AttackSubAnimInstance
// 0x0010 (0x0630 - 0x0620)
class UK25AttackSubAnimInstance final : public UKillerAttackSubAnimInstance
{
public:
	bool                                          _hasDownedTargetHoldingLamentConfiguration;        // 0x0618(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_619[0x17];                                     // 0x0619(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAttackStart(const EAttackType attackType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K25AttackSubAnimInstance">();
	}
	static class UK25AttackSubAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK25AttackSubAnimInstance>();
	}
};
static_assert(alignof(UK25AttackSubAnimInstance) == 0x000010, "Wrong alignment on UK25AttackSubAnimInstance");
static_assert(sizeof(UK25AttackSubAnimInstance) == 0x000630, "Wrong size on UK25AttackSubAnimInstance");
static_assert(offsetof(UK25AttackSubAnimInstance, _hasDownedTargetHoldingLamentConfiguration) == 0x000618, "Member 'UK25AttackSubAnimInstance::_hasDownedTargetHoldingLamentConfiguration' has a wrong offset!");

// Class TheK25.K25Chain
// 0x0200 (0x0430 - 0x0230)
class AK25Chain final : public AActor
{
public:
	uint8                                         Pad_230[0x8];                                      // 0x0230(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const bool acquired)> OnAcquiredChanged;                           // 0x0238(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UCurveFloat*                            _attachedToProjectileInfluenceCurve;               // 0x0248(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            _reelbackInfluenceCurve;                           // 0x0250(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            _offsetMultiplierInfluenceCurve;                   // 0x0258(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_260[0x50];                                     // 0x0260(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _reelingBackSpeed;                                 // 0x02B0(0x0028)(Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _chainOffsetMinValue;                              // 0x02D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _chainOffsetMaxValue;                              // 0x02DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _reelbackChainOffsetMinValue;                      // 0x02E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _reelbackChainOffsetMaxValue;                      // 0x02E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _chainInstanceSpacing;                             // 0x02E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _quickChainOffsetTimerLength;                      // 0x02EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _reachingSurvivorAnchorTime;                       // 0x02F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                _chainScale;                                       // 0x02F4(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _chainOffsetTimerLength;                           // 0x0300(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        _currentChainPoints;                               // 0x0308(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	bool                                          _isAcquiredFromPool;                               // 0x0318(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _sphereTraceRadius;                                // 0x031C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                _chainStartPosition;                               // 0x0320(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                _reelBackPosition;                                 // 0x032C(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                _reelbackStartPosition;                            // 0x0338(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AK25Projectile*                         _projectileAttachedTo;                             // 0x0348(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AK25SurvivorChainAttachmentAnchor> _survivorAnchorAttachedTo;               // 0x0350(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AK25SurvivorChainAttachmentAnchor> _targetAnchorToReach;                    // 0x0358(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USplineComponent*                       _chainSplineComponent;                             // 0x0360(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInstancedStaticMeshComponent*          _chainInstancedMesh;                               // 0x0368(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _currentInfluenceCurve;                            // 0x0370(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                _chainCurveOffset;                                 // 0x0378(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EK25ChainState                                _chainState;                                       // 0x0384(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_385[0x3];                                      // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFastTimer                             _curveOffsetStrengthTimer;                         // 0x0388(0x0030)(Transient, NativeAccessSpecifierPrivate)
	struct FFastTimer                             _reelbackTimer;                                    // 0x03B8(0x0030)(Transient, NativeAccessSpecifierPrivate)
	struct FFastTimer                             _reachSurvivorAnchorPositionTimer;                 // 0x03E8(0x0030)(Transient, NativeAccessSpecifierPrivate)
	TArray<struct FVector>                        _forcedPositions;                                  // 0x0418(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	EK25ChainCreationStrategy                     _chainCreationStrategy;                            // 0x0428(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_OnChainAppears();
	void Cosmetic_OnChainAttachedToSurvivor(bool wasReachingSurvivorAnchorPoint);
	void Cosmetic_OnChainDetachedFromSurvivor(EK25ChainDetachmentReason detachmentReason);
	void Cosmetic_OnChainDisappears();
	void Cosmetic_OnChainStartedToReelback();
	void Cosmetic_OnChainUnleashedWithProjectile();
	void Cosmetic_OnInstantChainUnleashedTowardsAttachmentPointFX();
	void Cosmetic_OnSurvivorStartedRemovingChainSFX();
	void Cosmetic_OnSurvivorStoppedRemovingChainSFX(bool hasRemovedChainDueToInteraction);
	void SetInstancedMeshComponent(class UInstancedStaticMeshComponent* instancedMesh);
	void SetSplineComponent(class USplineComponent* component);

	struct FVector GetChainEndLocation() const;
	struct FVector GetChainStartLocation() const;
	class AK25SurvivorChainAttachmentAnchor* GetSurvivorChainAttachmentAnchor() const;
	bool IsAttachedToControlledProjectile() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K25Chain">();
	}
	static class AK25Chain* GetDefaultObj()
	{
		return GetDefaultObjImpl<AK25Chain>();
	}
};
static_assert(alignof(AK25Chain) == 0x000008, "Wrong alignment on AK25Chain");
static_assert(sizeof(AK25Chain) == 0x000430, "Wrong size on AK25Chain");
static_assert(offsetof(AK25Chain, OnAcquiredChanged) == 0x000238, "Member 'AK25Chain::OnAcquiredChanged' has a wrong offset!");
static_assert(offsetof(AK25Chain, _attachedToProjectileInfluenceCurve) == 0x000248, "Member 'AK25Chain::_attachedToProjectileInfluenceCurve' has a wrong offset!");
static_assert(offsetof(AK25Chain, _reelbackInfluenceCurve) == 0x000250, "Member 'AK25Chain::_reelbackInfluenceCurve' has a wrong offset!");
static_assert(offsetof(AK25Chain, _offsetMultiplierInfluenceCurve) == 0x000258, "Member 'AK25Chain::_offsetMultiplierInfluenceCurve' has a wrong offset!");
static_assert(offsetof(AK25Chain, _reelingBackSpeed) == 0x0002B0, "Member 'AK25Chain::_reelingBackSpeed' has a wrong offset!");
static_assert(offsetof(AK25Chain, _chainOffsetMinValue) == 0x0002D8, "Member 'AK25Chain::_chainOffsetMinValue' has a wrong offset!");
static_assert(offsetof(AK25Chain, _chainOffsetMaxValue) == 0x0002DC, "Member 'AK25Chain::_chainOffsetMaxValue' has a wrong offset!");
static_assert(offsetof(AK25Chain, _reelbackChainOffsetMinValue) == 0x0002E0, "Member 'AK25Chain::_reelbackChainOffsetMinValue' has a wrong offset!");
static_assert(offsetof(AK25Chain, _reelbackChainOffsetMaxValue) == 0x0002E4, "Member 'AK25Chain::_reelbackChainOffsetMaxValue' has a wrong offset!");
static_assert(offsetof(AK25Chain, _chainInstanceSpacing) == 0x0002E8, "Member 'AK25Chain::_chainInstanceSpacing' has a wrong offset!");
static_assert(offsetof(AK25Chain, _quickChainOffsetTimerLength) == 0x0002EC, "Member 'AK25Chain::_quickChainOffsetTimerLength' has a wrong offset!");
static_assert(offsetof(AK25Chain, _reachingSurvivorAnchorTime) == 0x0002F0, "Member 'AK25Chain::_reachingSurvivorAnchorTime' has a wrong offset!");
static_assert(offsetof(AK25Chain, _chainScale) == 0x0002F4, "Member 'AK25Chain::_chainScale' has a wrong offset!");
static_assert(offsetof(AK25Chain, _chainOffsetTimerLength) == 0x000300, "Member 'AK25Chain::_chainOffsetTimerLength' has a wrong offset!");
static_assert(offsetof(AK25Chain, _currentChainPoints) == 0x000308, "Member 'AK25Chain::_currentChainPoints' has a wrong offset!");
static_assert(offsetof(AK25Chain, _isAcquiredFromPool) == 0x000318, "Member 'AK25Chain::_isAcquiredFromPool' has a wrong offset!");
static_assert(offsetof(AK25Chain, _sphereTraceRadius) == 0x00031C, "Member 'AK25Chain::_sphereTraceRadius' has a wrong offset!");
static_assert(offsetof(AK25Chain, _chainStartPosition) == 0x000320, "Member 'AK25Chain::_chainStartPosition' has a wrong offset!");
static_assert(offsetof(AK25Chain, _reelBackPosition) == 0x00032C, "Member 'AK25Chain::_reelBackPosition' has a wrong offset!");
static_assert(offsetof(AK25Chain, _reelbackStartPosition) == 0x000338, "Member 'AK25Chain::_reelbackStartPosition' has a wrong offset!");
static_assert(offsetof(AK25Chain, _projectileAttachedTo) == 0x000348, "Member 'AK25Chain::_projectileAttachedTo' has a wrong offset!");
static_assert(offsetof(AK25Chain, _survivorAnchorAttachedTo) == 0x000350, "Member 'AK25Chain::_survivorAnchorAttachedTo' has a wrong offset!");
static_assert(offsetof(AK25Chain, _targetAnchorToReach) == 0x000358, "Member 'AK25Chain::_targetAnchorToReach' has a wrong offset!");
static_assert(offsetof(AK25Chain, _chainSplineComponent) == 0x000360, "Member 'AK25Chain::_chainSplineComponent' has a wrong offset!");
static_assert(offsetof(AK25Chain, _chainInstancedMesh) == 0x000368, "Member 'AK25Chain::_chainInstancedMesh' has a wrong offset!");
static_assert(offsetof(AK25Chain, _currentInfluenceCurve) == 0x000370, "Member 'AK25Chain::_currentInfluenceCurve' has a wrong offset!");
static_assert(offsetof(AK25Chain, _chainCurveOffset) == 0x000378, "Member 'AK25Chain::_chainCurveOffset' has a wrong offset!");
static_assert(offsetof(AK25Chain, _chainState) == 0x000384, "Member 'AK25Chain::_chainState' has a wrong offset!");
static_assert(offsetof(AK25Chain, _curveOffsetStrengthTimer) == 0x000388, "Member 'AK25Chain::_curveOffsetStrengthTimer' has a wrong offset!");
static_assert(offsetof(AK25Chain, _reelbackTimer) == 0x0003B8, "Member 'AK25Chain::_reelbackTimer' has a wrong offset!");
static_assert(offsetof(AK25Chain, _reachSurvivorAnchorPositionTimer) == 0x0003E8, "Member 'AK25Chain::_reachSurvivorAnchorPositionTimer' has a wrong offset!");
static_assert(offsetof(AK25Chain, _forcedPositions) == 0x000418, "Member 'AK25Chain::_forcedPositions' has a wrong offset!");
static_assert(offsetof(AK25Chain, _chainCreationStrategy) == 0x000428, "Member 'AK25Chain::_chainCreationStrategy' has a wrong offset!");

// Class TheK25.K25ChainAttachedStatusEffect
// 0x0018 (0x0368 - 0x0350)
class UK25ChainAttachedStatusEffect final : public UStatusEffect
{
public:
	class UCurveFloat*                            _percentageReductionSpeedPerChainCurve;            // 0x0350(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UK25SurvivorChainAttachmentComponent*   _chainAttachmentComponent;                         // 0x0358(0x0008)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         _cachedNumberOfChainsAttached;                     // 0x0360(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_ChainAttachementComponent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K25ChainAttachedStatusEffect">();
	}
	static class UK25ChainAttachedStatusEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK25ChainAttachedStatusEffect>();
	}
};
static_assert(alignof(UK25ChainAttachedStatusEffect) == 0x000008, "Wrong alignment on UK25ChainAttachedStatusEffect");
static_assert(sizeof(UK25ChainAttachedStatusEffect) == 0x000368, "Wrong size on UK25ChainAttachedStatusEffect");
static_assert(offsetof(UK25ChainAttachedStatusEffect, _percentageReductionSpeedPerChainCurve) == 0x000350, "Member 'UK25ChainAttachedStatusEffect::_percentageReductionSpeedPerChainCurve' has a wrong offset!");
static_assert(offsetof(UK25ChainAttachedStatusEffect, _chainAttachmentComponent) == 0x000358, "Member 'UK25ChainAttachedStatusEffect::_chainAttachmentComponent' has a wrong offset!");
static_assert(offsetof(UK25ChainAttachedStatusEffect, _cachedNumberOfChainsAttached) == 0x000360, "Member 'UK25ChainAttachedStatusEffect::_cachedNumberOfChainsAttached' has a wrong offset!");

// Class TheK25.K25ChainAttachmentReplicationComponent
// 0x0000 (0x00B8 - 0x00B8)
class UK25ChainAttachmentReplicationComponent final : public UActorComponent
{
public:
	void Multicast_AttachChainToAnchor(class UK25SurvivorChainAttachmentComponent* chainAttachementComponent, class AK25Chain* chainToAttach, class AK25SurvivorChainAttachmentAnchor* anchorPoint);
	void Multicast_DetachChains(class UK25SurvivorChainAttachmentComponent* chainAttachementComponent, const TArray<class AK25Chain*>& chainsToDetach, EK25ChainDetachmentReason detachmentReason, const TArray<class AK25Chain*>& chainsAttached);
	void Multicast_LaunchInstantHitChainTowardsSurvivor(class AK25Chain* newChainToAttach, class AK25SurvivorChainAttachmentAnchor* targetAnchor, const struct FVector& startPosition);
	void Multicast_StartChainReelback(class AK25Chain* chainToAttach);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K25ChainAttachmentReplicationComponent">();
	}
	static class UK25ChainAttachmentReplicationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK25ChainAttachmentReplicationComponent>();
	}
};
static_assert(alignof(UK25ChainAttachmentReplicationComponent) == 0x000008, "Wrong alignment on UK25ChainAttachmentReplicationComponent");
static_assert(sizeof(UK25ChainAttachmentReplicationComponent) == 0x0000B8, "Wrong size on UK25ChainAttachmentReplicationComponent");

// Class TheK25.K25ChainHuntEffectsComponent
// 0x0038 (0x00F0 - 0x00B8)
class UK25ChainHuntEffectsComponent : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x38];                                      // 0x00B8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_ActivateChainHuntEffects(const bool hasChainHuntStarted);
	void Cosmetic_DeactivateChainHuntEffects();
	void Cosmetic_TriggerChainHuntActivationSFX();

	class ADBDPlayer* GetOwningPlayer() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K25ChainHuntEffectsComponent">();
	}
	static class UK25ChainHuntEffectsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK25ChainHuntEffectsComponent>();
	}
};
static_assert(alignof(UK25ChainHuntEffectsComponent) == 0x000008, "Wrong alignment on UK25ChainHuntEffectsComponent");
static_assert(sizeof(UK25ChainHuntEffectsComponent) == 0x0000F0, "Wrong size on UK25ChainHuntEffectsComponent");

// Class TheK25.K25ChainLocomotionSurvivorAnimInstance
// 0x0180 (0x06D0 - 0x0550)
class UK25ChainLocomotionSurvivorAnimInstance final : public UBaseSurvivorAnimInstance
{
public:
	uint8                                         Pad_548[0x8];                                      // 0x0548(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _hasChainsAttached;                                // 0x0550(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isPerformingBreakChainInteraction;                // 0x0551(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_552[0x2];                                      // 0x0552(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _forwardDirectionDotProductResult;                 // 0x0554(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _lateralDirectionDotProductResult;                 // 0x0558(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_55C[0x4];                                      // 0x055C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AK25Chain*                              _currentChainBeingDetached;                        // 0x0560(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FK25ChainAnchorAnimationData           _leftHandAttachmentData;                           // 0x0568(0x0018)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FK25ChainAnchorAnimationData           _rightHandAttachmentData;                          // 0x0580(0x0018)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FK25ChainAnchorAnimationData           _leftShoulderAttachmentData;                       // 0x0598(0x0018)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FK25ChainAnchorAnimationData           _rightShoulderAttachmentData;                      // 0x05B0(0x0018)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FK25ChainAnchorAnimationData           _stomachAttachmentData;                            // 0x05C8(0x0018)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FK25ChainAnchorAnimationData           _backAttachmentData;                               // 0x05E0(0x0018)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	EK25ChainAnchorPointDirection                 _chainDirection;                                   // 0x05F8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _hasBrokenFreeFromChain;                           // 0x05F9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5FA[0x2];                                      // 0x05FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _hasBrokenFreeTime;                                // 0x05FC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _hasBeenHitByChain;                                // 0x0600(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isIdle;                                           // 0x0601(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _IsCrouched;                                       // 0x0602(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isMale;                                           // 0x0603(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isBeingCarried;                                   // 0x0604(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_605[0x3];                                      // 0x0605(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _hasBeenHitByChainTime;                            // 0x0608(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _hitChainName;                                     // 0x060C(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _detachedChainAnchorName;                          // 0x0618(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_624[0xAC];                                     // 0x0624(0x00AC)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnChainAttached(class AK25Chain* chain, class AK25SurvivorChainAttachmentAnchor* chainAttachmentAnchor);
	void OnChainDetached(class AK25Chain* chain, class AK25SurvivorChainAttachmentAnchor* chainAttachmentAnchor, EK25ChainDetachmentReason detachmentReason);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K25ChainLocomotionSurvivorAnimInstance">();
	}
	static class UK25ChainLocomotionSurvivorAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK25ChainLocomotionSurvivorAnimInstance>();
	}
};
static_assert(alignof(UK25ChainLocomotionSurvivorAnimInstance) == 0x000010, "Wrong alignment on UK25ChainLocomotionSurvivorAnimInstance");
static_assert(sizeof(UK25ChainLocomotionSurvivorAnimInstance) == 0x0006D0, "Wrong size on UK25ChainLocomotionSurvivorAnimInstance");
static_assert(offsetof(UK25ChainLocomotionSurvivorAnimInstance, _hasChainsAttached) == 0x000550, "Member 'UK25ChainLocomotionSurvivorAnimInstance::_hasChainsAttached' has a wrong offset!");
static_assert(offsetof(UK25ChainLocomotionSurvivorAnimInstance, _isPerformingBreakChainInteraction) == 0x000551, "Member 'UK25ChainLocomotionSurvivorAnimInstance::_isPerformingBreakChainInteraction' has a wrong offset!");
static_assert(offsetof(UK25ChainLocomotionSurvivorAnimInstance, _forwardDirectionDotProductResult) == 0x000554, "Member 'UK25ChainLocomotionSurvivorAnimInstance::_forwardDirectionDotProductResult' has a wrong offset!");
static_assert(offsetof(UK25ChainLocomotionSurvivorAnimInstance, _lateralDirectionDotProductResult) == 0x000558, "Member 'UK25ChainLocomotionSurvivorAnimInstance::_lateralDirectionDotProductResult' has a wrong offset!");
static_assert(offsetof(UK25ChainLocomotionSurvivorAnimInstance, _currentChainBeingDetached) == 0x000560, "Member 'UK25ChainLocomotionSurvivorAnimInstance::_currentChainBeingDetached' has a wrong offset!");
static_assert(offsetof(UK25ChainLocomotionSurvivorAnimInstance, _leftHandAttachmentData) == 0x000568, "Member 'UK25ChainLocomotionSurvivorAnimInstance::_leftHandAttachmentData' has a wrong offset!");
static_assert(offsetof(UK25ChainLocomotionSurvivorAnimInstance, _rightHandAttachmentData) == 0x000580, "Member 'UK25ChainLocomotionSurvivorAnimInstance::_rightHandAttachmentData' has a wrong offset!");
static_assert(offsetof(UK25ChainLocomotionSurvivorAnimInstance, _leftShoulderAttachmentData) == 0x000598, "Member 'UK25ChainLocomotionSurvivorAnimInstance::_leftShoulderAttachmentData' has a wrong offset!");
static_assert(offsetof(UK25ChainLocomotionSurvivorAnimInstance, _rightShoulderAttachmentData) == 0x0005B0, "Member 'UK25ChainLocomotionSurvivorAnimInstance::_rightShoulderAttachmentData' has a wrong offset!");
static_assert(offsetof(UK25ChainLocomotionSurvivorAnimInstance, _stomachAttachmentData) == 0x0005C8, "Member 'UK25ChainLocomotionSurvivorAnimInstance::_stomachAttachmentData' has a wrong offset!");
static_assert(offsetof(UK25ChainLocomotionSurvivorAnimInstance, _backAttachmentData) == 0x0005E0, "Member 'UK25ChainLocomotionSurvivorAnimInstance::_backAttachmentData' has a wrong offset!");
