#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheK26

#include "Basic.hpp"

#include "StatSystem_structs.hpp"
#include "DBDBots_classes.hpp"
#include "DataTableUtilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "DBDCompetence_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DBDAnimation_classes.hpp"
#include "TheK26_structs.hpp"
#include "GameplayTagUtilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Competence_classes.hpp"
#include "SystemUtilities_structs.hpp"


namespace SDK
{

// Class TheK26.AISkill_Interaction_DismissCrow
// 0x0000 (0x0180 - 0x0180)
class UAISkill_Interaction_DismissCrow final : public UAISkill_Interaction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_Interaction_DismissCrow">();
	}
	static class UAISkill_Interaction_DismissCrow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_Interaction_DismissCrow>();
	}
};
static_assert(alignof(UAISkill_Interaction_DismissCrow) == 0x000008, "Wrong alignment on UAISkill_Interaction_DismissCrow");
static_assert(sizeof(UAISkill_Interaction_DismissCrow) == 0x000180, "Wrong size on UAISkill_Interaction_DismissCrow");

// Class TheK26.CorrectiveAction
// 0x0050 (0x0418 - 0x03C8)
class UCorrectiveAction final : public UPerk
{
public:
	float                                         _startingTokens[0x3];                              // 0x03C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   _statusEffectName;                                 // 0x03D4(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  _allowedInteractionSemanticsForToken;              // 0x03E0(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_400[0x18];                                     // 0x0400(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CorrectiveAction">();
	}
	static class UCorrectiveAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCorrectiveAction>();
	}
};
static_assert(alignof(UCorrectiveAction) == 0x000008, "Wrong alignment on UCorrectiveAction");
static_assert(sizeof(UCorrectiveAction) == 0x000418, "Wrong size on UCorrectiveAction");
static_assert(offsetof(UCorrectiveAction, _startingTokens) == 0x0003C8, "Member 'UCorrectiveAction::_startingTokens' has a wrong offset!");
static_assert(offsetof(UCorrectiveAction, _statusEffectName) == 0x0003D4, "Member 'UCorrectiveAction::_statusEffectName' has a wrong offset!");
static_assert(offsetof(UCorrectiveAction, _allowedInteractionSemanticsForToken) == 0x0003E0, "Member 'UCorrectiveAction::_allowedInteractionSemanticsForToken' has a wrong offset!");

// Class TheK26.HexPentimento
// 0x0070 (0x04B8 - 0x0448)
class UHexPentimento final : public UHexPerk
{
public:
	TSet<class FName>                             _statusEffectNames;                                // 0x0448(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TSubclassOf<class URekindleTotemInteraction>  _rekindleInteractionClass;                         // 0x0498(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class ATotem*>                         _blockedTotems;                                    // 0x04A0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4B0[0x8];                                      // 0x04B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HexPentimento">();
	}
	static class UHexPentimento* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHexPentimento>();
	}
};
static_assert(alignof(UHexPentimento) == 0x000008, "Wrong alignment on UHexPentimento");
static_assert(sizeof(UHexPentimento) == 0x0004B8, "Wrong size on UHexPentimento");
static_assert(offsetof(UHexPentimento, _statusEffectNames) == 0x000448, "Member 'UHexPentimento::_statusEffectNames' has a wrong offset!");
static_assert(offsetof(UHexPentimento, _rekindleInteractionClass) == 0x000498, "Member 'UHexPentimento::_rekindleInteractionClass' has a wrong offset!");
static_assert(offsetof(UHexPentimento, _blockedTotems) == 0x0004A0, "Member 'UHexPentimento::_blockedTotems' has a wrong offset!");

// Class TheK26.HinderOnCrowAttachStatusEffect
// 0x00B8 (0x0410 - 0x0358)
class UHinderOnCrowAttachStatusEffect final : public UBaseLingeringStatusEffect
{
public:
	struct FGameplayTag                           _onCrowAttachStateTag;                             // 0x0358(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTunableStat                           _hinderOnIdleLingerTime;                           // 0x0368(0x0080)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E8[0x28];                                     // 0x03E8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnKillerSet(class ASlasherPlayer* killer);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HinderOnCrowAttachStatusEffect">();
	}
	static class UHinderOnCrowAttachStatusEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHinderOnCrowAttachStatusEffect>();
	}
};
static_assert(alignof(UHinderOnCrowAttachStatusEffect) == 0x000008, "Wrong alignment on UHinderOnCrowAttachStatusEffect");
static_assert(sizeof(UHinderOnCrowAttachStatusEffect) == 0x000410, "Wrong size on UHinderOnCrowAttachStatusEffect");
static_assert(offsetof(UHinderOnCrowAttachStatusEffect, _onCrowAttachStateTag) == 0x000358, "Member 'UHinderOnCrowAttachStatusEffect::_onCrowAttachStateTag' has a wrong offset!");
static_assert(offsetof(UHinderOnCrowAttachStatusEffect, _hinderOnIdleLingerTime) == 0x000368, "Member 'UHinderOnCrowAttachStatusEffect::_hinderOnIdleLingerTime' has a wrong offset!");

// Class TheK26.HinderOnIdleAndAttachStatusEffect
// 0x0038 (0x03C8 - 0x0390)
class UHinderOnIdleAndAttachStatusEffect final : public ULingeringStateTagStatusEffect
{
public:
	struct FGameplayTag                           _onCrowAttachStateTag;                             // 0x0390(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_39C[0x2C];                                     // 0x039C(0x002C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HinderOnIdleAndAttachStatusEffect">();
	}
	static class UHinderOnIdleAndAttachStatusEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHinderOnIdleAndAttachStatusEffect>();
	}
};
static_assert(alignof(UHinderOnIdleAndAttachStatusEffect) == 0x000008, "Wrong alignment on UHinderOnIdleAndAttachStatusEffect");
static_assert(sizeof(UHinderOnIdleAndAttachStatusEffect) == 0x0003C8, "Wrong size on UHinderOnIdleAndAttachStatusEffect");
static_assert(offsetof(UHinderOnIdleAndAttachStatusEffect, _onCrowAttachStateTag) == 0x000390, "Member 'UHinderOnIdleAndAttachStatusEffect::_onCrowAttachStateTag' has a wrong offset!");

// Class TheK26.K26AbilitySubAnimInstance
// 0x0090 (0x05E0 - 0x0550)
class UK26AbilitySubAnimInstance final : public UBaseKillerAnimInstance
{
public:
	float                                         _fireInteractionCooldownTime;                      // 0x0550(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_554[0x4];                                      // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTunableStat                           _fireInteractionCooldownTimeTunable;               // 0x0558(0x0080)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _hasChargingStarted;                               // 0x05D8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _hasProjectileBeenSummoned;                        // 0x05D9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _hasChargingEnded;                                 // 0x05DA(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _hasProjectileFired;                               // 0x05DB(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5DC[0x4];                                      // 0x05DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ConsumeHasProjectileBeenSummoned();
	void ConsumeHasProjectileFired();
	void OnHasProjectileBeenSummoned(const int32 remainingAmmo, const int32 maxAmmo);
	void OnHasProjectileFired();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K26AbilitySubAnimInstance">();
	}
	static class UK26AbilitySubAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK26AbilitySubAnimInstance>();
	}
};
static_assert(alignof(UK26AbilitySubAnimInstance) == 0x000010, "Wrong alignment on UK26AbilitySubAnimInstance");
static_assert(sizeof(UK26AbilitySubAnimInstance) == 0x0005E0, "Wrong size on UK26AbilitySubAnimInstance");
static_assert(offsetof(UK26AbilitySubAnimInstance, _fireInteractionCooldownTime) == 0x000550, "Member 'UK26AbilitySubAnimInstance::_fireInteractionCooldownTime' has a wrong offset!");
static_assert(offsetof(UK26AbilitySubAnimInstance, _fireInteractionCooldownTimeTunable) == 0x000558, "Member 'UK26AbilitySubAnimInstance::_fireInteractionCooldownTimeTunable' has a wrong offset!");
static_assert(offsetof(UK26AbilitySubAnimInstance, _hasChargingStarted) == 0x0005D8, "Member 'UK26AbilitySubAnimInstance::_hasChargingStarted' has a wrong offset!");
static_assert(offsetof(UK26AbilitySubAnimInstance, _hasProjectileBeenSummoned) == 0x0005D9, "Member 'UK26AbilitySubAnimInstance::_hasProjectileBeenSummoned' has a wrong offset!");
static_assert(offsetof(UK26AbilitySubAnimInstance, _hasChargingEnded) == 0x0005DA, "Member 'UK26AbilitySubAnimInstance::_hasChargingEnded' has a wrong offset!");
static_assert(offsetof(UK26AbilitySubAnimInstance, _hasProjectileFired) == 0x0005DB, "Member 'UK26AbilitySubAnimInstance::_hasProjectileFired' has a wrong offset!");

// Class TheK26.K26AimingGuide
// 0x0000 (0x0230 - 0x0230)
class AK26AimingGuide final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K26AimingGuide">();
	}
	static class AK26AimingGuide* GetDefaultObj()
	{
		return GetDefaultObjImpl<AK26AimingGuide>();
	}
};
static_assert(alignof(AK26AimingGuide) == 0x000008, "Wrong alignment on AK26AimingGuide");
static_assert(sizeof(AK26AimingGuide) == 0x000230, "Wrong size on AK26AimingGuide");

// Class TheK26.K26AmmoHandlerComponent
// 0x0398 (0x0450 - 0x00B8)
class UK26AmmoHandlerComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x10];                                      // 0x00B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const EK26AmmoState newAmmoState, const int32 currentAmmo, const int32 maxAmmo)> OnCurrentAmmoStateChanged; // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FTagStateBool                          _isAmmoOnCooldown;                                 // 0x00D8(0x0030)(Net, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(const int32 maxAmmo)> _onMaxAmmoSet;                               // 0x0108(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	float                                         _rechargeEndTime;                                  // 0x0118(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _isTunableInit;                                    // 0x011C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     _projectileClass;                                  // 0x0120(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _expirationCooldownTime;                           // 0x0128(0x0080)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FDBDTunableRowHandle>           _firedCooldownTimesPerCrow;                        // 0x01A8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _cooldownReductionPerCrowFired;                    // 0x01B8(0x0080)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _expirationTime;                                   // 0x0238(0x0080)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _expirationWarningBufferTime;                      // 0x02B8(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _maxAmmo;                                          // 0x02E0(0x0080)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         _currentAmmo;                                      // 0x0360(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EK26AmmoCooldownReason                        _lastCooldownReason;                               // 0x0364(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EK26AmmoState                                 _currentAmmoState;                                 // 0x0365(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_366[0x2];                                      // 0x0366(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UK26PathHandlerComponent*               _pathHandler;                                      // 0x0368(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK26PowerStatusHandlerComponent*        _statusHandler;                                    // 0x0370(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAuthoritativeActorPoolComponent*       _authoritativeActorPoolComponent;                  // 0x0378(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTagStateBool                          _isOutOfAmmo;                                      // 0x0380(0x0030)(Net, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _fallbackFireCooldown;                             // 0x03B0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3B4[0x9C];                                     // 0x03B4(0x009C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_InitializePoolComponent(const int32 maxAmmo);
	void Authority_OnAmmoInit(class AActor* initAmmo);
	void CallOnMaxAmmoSet(TDelegate<void(const int32 maxAmmo)> callback);
	void Cosmetic_OnAmmoExpired();
	void Cosmetic_OnAmmoHasBeenFired();
	void Cosmetic_OnExpiringWarning();
	void Multicast_OnAmmoExpired();
	void Multicast_OnAmmoHasBeenFired();
	void Multicast_OnCurrentAmmoStateChanged(const EK26AmmoState newState, const int32 currentAmmo, const int32 maxAmmo);
	void Multicast_StartExpiring();
	void Multicast_StartRecharging(const EK26AmmoCooldownReason lastCooldownReason);
	void OnKillerSet(class ASlasherPlayer* killer);
	void OnLevelReadyToPlay();
	void SendHasExpiredDelegate();
	void SetDependencies(class UK26PathHandlerComponent* pathHandler, class UK26PowerStatusHandlerComponent* statusHandler, class UAuthoritativeActorPoolComponent* authoritativeActorPoolComponent);

	int32 GetCurrentAmmo() const;
	EK26AmmoState GetCurrentAmmoState() const;
	EK26AmmoCooldownReason GetCurrentCooldownReason() const;
	int32 GetMaxAmmo() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K26AmmoHandlerComponent">();
	}
	static class UK26AmmoHandlerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK26AmmoHandlerComponent>();
	}
};
static_assert(alignof(UK26AmmoHandlerComponent) == 0x000008, "Wrong alignment on UK26AmmoHandlerComponent");
static_assert(sizeof(UK26AmmoHandlerComponent) == 0x000450, "Wrong size on UK26AmmoHandlerComponent");
static_assert(offsetof(UK26AmmoHandlerComponent, OnCurrentAmmoStateChanged) == 0x0000C8, "Member 'UK26AmmoHandlerComponent::OnCurrentAmmoStateChanged' has a wrong offset!");
static_assert(offsetof(UK26AmmoHandlerComponent, _isAmmoOnCooldown) == 0x0000D8, "Member 'UK26AmmoHandlerComponent::_isAmmoOnCooldown' has a wrong offset!");
static_assert(offsetof(UK26AmmoHandlerComponent, _onMaxAmmoSet) == 0x000108, "Member 'UK26AmmoHandlerComponent::_onMaxAmmoSet' has a wrong offset!");
static_assert(offsetof(UK26AmmoHandlerComponent, _rechargeEndTime) == 0x000118, "Member 'UK26AmmoHandlerComponent::_rechargeEndTime' has a wrong offset!");
static_assert(offsetof(UK26AmmoHandlerComponent, _isTunableInit) == 0x00011C, "Member 'UK26AmmoHandlerComponent::_isTunableInit' has a wrong offset!");
static_assert(offsetof(UK26AmmoHandlerComponent, _projectileClass) == 0x000120, "Member 'UK26AmmoHandlerComponent::_projectileClass' has a wrong offset!");
static_assert(offsetof(UK26AmmoHandlerComponent, _expirationCooldownTime) == 0x000128, "Member 'UK26AmmoHandlerComponent::_expirationCooldownTime' has a wrong offset!");
static_assert(offsetof(UK26AmmoHandlerComponent, _firedCooldownTimesPerCrow) == 0x0001A8, "Member 'UK26AmmoHandlerComponent::_firedCooldownTimesPerCrow' has a wrong offset!");
static_assert(offsetof(UK26AmmoHandlerComponent, _cooldownReductionPerCrowFired) == 0x0001B8, "Member 'UK26AmmoHandlerComponent::_cooldownReductionPerCrowFired' has a wrong offset!");
static_assert(offsetof(UK26AmmoHandlerComponent, _expirationTime) == 0x000238, "Member 'UK26AmmoHandlerComponent::_expirationTime' has a wrong offset!");
static_assert(offsetof(UK26AmmoHandlerComponent, _expirationWarningBufferTime) == 0x0002B8, "Member 'UK26AmmoHandlerComponent::_expirationWarningBufferTime' has a wrong offset!");
static_assert(offsetof(UK26AmmoHandlerComponent, _maxAmmo) == 0x0002E0, "Member 'UK26AmmoHandlerComponent::_maxAmmo' has a wrong offset!");
static_assert(offsetof(UK26AmmoHandlerComponent, _currentAmmo) == 0x000360, "Member 'UK26AmmoHandlerComponent::_currentAmmo' has a wrong offset!");
static_assert(offsetof(UK26AmmoHandlerComponent, _lastCooldownReason) == 0x000364, "Member 'UK26AmmoHandlerComponent::_lastCooldownReason' has a wrong offset!");
static_assert(offsetof(UK26AmmoHandlerComponent, _currentAmmoState) == 0x000365, "Member 'UK26AmmoHandlerComponent::_currentAmmoState' has a wrong offset!");
static_assert(offsetof(UK26AmmoHandlerComponent, _pathHandler) == 0x000368, "Member 'UK26AmmoHandlerComponent::_pathHandler' has a wrong offset!");
static_assert(offsetof(UK26AmmoHandlerComponent, _statusHandler) == 0x000370, "Member 'UK26AmmoHandlerComponent::_statusHandler' has a wrong offset!");
static_assert(offsetof(UK26AmmoHandlerComponent, _authoritativeActorPoolComponent) == 0x000378, "Member 'UK26AmmoHandlerComponent::_authoritativeActorPoolComponent' has a wrong offset!");
static_assert(offsetof(UK26AmmoHandlerComponent, _isOutOfAmmo) == 0x000380, "Member 'UK26AmmoHandlerComponent::_isOutOfAmmo' has a wrong offset!");
static_assert(offsetof(UK26AmmoHandlerComponent, _fallbackFireCooldown) == 0x0003B0, "Member 'UK26AmmoHandlerComponent::_fallbackFireCooldown' has a wrong offset!");

// Class TheK26.K26AnimInstance
// 0x0010 (0x0610 - 0x0600)
class UK26AnimInstance final : public UKillerAnimInstance
{
public:
	bool                                          _isUsingPower;                                     // 0x0600(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_601[0xF];                                      // 0x0601(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K26AnimInstance">();
	}
	static class UK26AnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK26AnimInstance>();
	}
};
static_assert(alignof(UK26AnimInstance) == 0x000010, "Wrong alignment on UK26AnimInstance");
static_assert(sizeof(UK26AnimInstance) == 0x000610, "Wrong size on UK26AnimInstance");
static_assert(offsetof(UK26AnimInstance, _isUsingPower) == 0x000600, "Member 'UK26AnimInstance::_isUsingPower' has a wrong offset!");

// Class TheK26.K26AttachedCrow
// 0x01C0 (0x03F0 - 0x0230)
class AK26AttachedCrow final : public AActor
{
public:
	uint8                                         Pad_230[0x40];                                     // 0x0230(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTunableStat                           _lingerTime;                                       // 0x0270(0x0080)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _infectionDelay;                                   // 0x02F0(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _infectRadius;                                     // 0x0318(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK26PowerOutlineUpdateStrategy*         _outlineUpdateStrategy;                            // 0x0340(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDBDOutlineComponent*                   _outlineComponent;                                 // 0x0348(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   _visualStaticMeshComponent;                        // 0x0350(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USceneComponent*                        _rootComponent;                                    // 0x0358(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK26PowerStatusHandlerComponent*        _statusHandler;                                    // 0x0360(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _authority_isInfecting;                            // 0x0368(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FK26AttachmentStatus                   _attachmentStatus;                                 // 0x0369(0x0002)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_36B[0x85];                                     // 0x036B(0x0085)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_ActivateInfection();
	void Authority_DeactivateInfection();
	void Authority_OnIsWithinOtherSurvivorRangeChanged(class AActor* survivorActor, const bool isInRange);
	void Authority_OnKillerSet(class ASlasherPlayer* killer);
	void Authority_OnOtherAttachedCrowRemoved();
	void Authority_OnOtherSurvivorDamageStateChanged(ECamperDamageState before, ECamperDamageState after);
	void Authority_OnOtherSurvivorGuidedActionChanged();
	void Authority_OnOtherSurvivorPerkFlagsChanged(const struct FGameplayTag& gameplayTag, bool isAdded);
	void Authority_OnPlayerLeftGame(const struct FGameplayTag& gameEventType, const struct FGameEventData& gameEventData);
	void Authority_OnSurvivorAdded(class ACamperPlayer* survivor);
	void Authority_OnSurvivorDroppedEnd();
	void Authority_OnSurvivorExitLocker(const struct FGameplayTag& gameEventType, const struct FGameEventData& gameEventData);
	void Authority_OnSurvivorStatusIndicatorSet(const class ACamperPlayer* survivor, class AK26AttachedCrow* attachedCrow);
	void Authority_OnSurvivorWasUnhooked(const struct FGameplayTag& gameEventType, const struct FGameEventData& gameEventData);
	void Cosmetic_OnAttachedCrowRemoved(EFK26AttachedCrowRemovalReason removalReason);
	void Cosmetic_OnAuraHidden();
	void Cosmetic_OnAuraShown();
	void Cosmetic_OnCrowAttached();
	void Cosmetic_OnStartDetaching();
	void Cosmetic_OnStopDetaching();
	void HideOutline();
	void Multicast_OnStartDetaching();
	void Multicast_OnStopDetaching();
	void OnRep_AttachmentStatus();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K26AttachedCrow">();
	}
	static class AK26AttachedCrow* GetDefaultObj()
	{
		return GetDefaultObjImpl<AK26AttachedCrow>();
	}
};
static_assert(alignof(AK26AttachedCrow) == 0x000008, "Wrong alignment on AK26AttachedCrow");
static_assert(sizeof(AK26AttachedCrow) == 0x0003F0, "Wrong size on AK26AttachedCrow");
static_assert(offsetof(AK26AttachedCrow, _lingerTime) == 0x000270, "Member 'AK26AttachedCrow::_lingerTime' has a wrong offset!");
static_assert(offsetof(AK26AttachedCrow, _infectionDelay) == 0x0002F0, "Member 'AK26AttachedCrow::_infectionDelay' has a wrong offset!");
static_assert(offsetof(AK26AttachedCrow, _infectRadius) == 0x000318, "Member 'AK26AttachedCrow::_infectRadius' has a wrong offset!");
static_assert(offsetof(AK26AttachedCrow, _outlineUpdateStrategy) == 0x000340, "Member 'AK26AttachedCrow::_outlineUpdateStrategy' has a wrong offset!");
static_assert(offsetof(AK26AttachedCrow, _outlineComponent) == 0x000348, "Member 'AK26AttachedCrow::_outlineComponent' has a wrong offset!");
static_assert(offsetof(AK26AttachedCrow, _visualStaticMeshComponent) == 0x000350, "Member 'AK26AttachedCrow::_visualStaticMeshComponent' has a wrong offset!");
static_assert(offsetof(AK26AttachedCrow, _rootComponent) == 0x000358, "Member 'AK26AttachedCrow::_rootComponent' has a wrong offset!");
static_assert(offsetof(AK26AttachedCrow, _statusHandler) == 0x000360, "Member 'AK26AttachedCrow::_statusHandler' has a wrong offset!");
static_assert(offsetof(AK26AttachedCrow, _authority_isInfecting) == 0x000368, "Member 'AK26AttachedCrow::_authority_isInfecting' has a wrong offset!");
static_assert(offsetof(AK26AttachedCrow, _attachmentStatus) == 0x000369, "Member 'AK26AttachedCrow::_attachmentStatus' has a wrong offset!");

// Class TheK26.K26CooldownInteractionDefinition
// 0x0080 (0x06A0 - 0x0620)
class UK26CooldownInteractionDefinition final : public UInteractionDefinition
{
public:
	struct FTunableStat                           _cooldownTime;                                     // 0x0618(0x0080)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnKillerSet(class ASlasherPlayer* killer);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K26CooldownInteractionDefinition">();
	}
	static class UK26CooldownInteractionDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK26CooldownInteractionDefinition>();
	}
};
static_assert(alignof(UK26CooldownInteractionDefinition) == 0x000010, "Wrong alignment on UK26CooldownInteractionDefinition");
static_assert(sizeof(UK26CooldownInteractionDefinition) == 0x0006A0, "Wrong size on UK26CooldownInteractionDefinition");
static_assert(offsetof(UK26CooldownInteractionDefinition, _cooldownTime) == 0x000618, "Member 'UK26CooldownInteractionDefinition::_cooldownTime' has a wrong offset!");

// Class TheK26.K26CrowAttachmentSubAnimInstance
// 0x0010 (0x0560 - 0x0550)
class UK26CrowAttachmentSubAnimInstance final : public UBaseSurvivorAnimInstance
{
public:
	uint8                                         Pad_548[0x8];                                      // 0x0548(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _hasCrowAttached;                                  // 0x0550(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isRemovingCrow;                                   // 0x0551(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isIdle;                                           // 0x0552(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isCrawling;                                       // 0x0553(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isDead;                                           // 0x0554(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isHooked;                                         // 0x0555(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInsideCloset;                                   // 0x0556(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInteracting;                                    // 0x0557(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isHoldingSmallItem;                               // 0x0558(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isUsingAimItem;                                   // 0x0559(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isCrouched;                                       // 0x055A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_55B[0x5];                                      // 0x055B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K26CrowAttachmentSubAnimInstance">();
	}
	static class UK26CrowAttachmentSubAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK26CrowAttachmentSubAnimInstance>();
	}
};
static_assert(alignof(UK26CrowAttachmentSubAnimInstance) == 0x000010, "Wrong alignment on UK26CrowAttachmentSubAnimInstance");
static_assert(sizeof(UK26CrowAttachmentSubAnimInstance) == 0x000560, "Wrong size on UK26CrowAttachmentSubAnimInstance");
static_assert(offsetof(UK26CrowAttachmentSubAnimInstance, _hasCrowAttached) == 0x000550, "Member 'UK26CrowAttachmentSubAnimInstance::_hasCrowAttached' has a wrong offset!");
static_assert(offsetof(UK26CrowAttachmentSubAnimInstance, _isRemovingCrow) == 0x000551, "Member 'UK26CrowAttachmentSubAnimInstance::_isRemovingCrow' has a wrong offset!");
static_assert(offsetof(UK26CrowAttachmentSubAnimInstance, _isIdle) == 0x000552, "Member 'UK26CrowAttachmentSubAnimInstance::_isIdle' has a wrong offset!");
static_assert(offsetof(UK26CrowAttachmentSubAnimInstance, _isCrawling) == 0x000553, "Member 'UK26CrowAttachmentSubAnimInstance::_isCrawling' has a wrong offset!");
static_assert(offsetof(UK26CrowAttachmentSubAnimInstance, _isDead) == 0x000554, "Member 'UK26CrowAttachmentSubAnimInstance::_isDead' has a wrong offset!");
static_assert(offsetof(UK26CrowAttachmentSubAnimInstance, _isHooked) == 0x000555, "Member 'UK26CrowAttachmentSubAnimInstance::_isHooked' has a wrong offset!");
static_assert(offsetof(UK26CrowAttachmentSubAnimInstance, _isInsideCloset) == 0x000556, "Member 'UK26CrowAttachmentSubAnimInstance::_isInsideCloset' has a wrong offset!");
static_assert(offsetof(UK26CrowAttachmentSubAnimInstance, _isInteracting) == 0x000557, "Member 'UK26CrowAttachmentSubAnimInstance::_isInteracting' has a wrong offset!");
static_assert(offsetof(UK26CrowAttachmentSubAnimInstance, _isHoldingSmallItem) == 0x000558, "Member 'UK26CrowAttachmentSubAnimInstance::_isHoldingSmallItem' has a wrong offset!");
static_assert(offsetof(UK26CrowAttachmentSubAnimInstance, _isUsingAimItem) == 0x000559, "Member 'UK26CrowAttachmentSubAnimInstance::_isUsingAimItem' has a wrong offset!");
static_assert(offsetof(UK26CrowAttachmentSubAnimInstance, _isCrouched) == 0x00055A, "Member 'UK26CrowAttachmentSubAnimInstance::_isCrouched' has a wrong offset!");

// Class TheK26.K26CrowPlacementValidatorComponent
// 0x0008 (0x00C0 - 0x00B8)
class UK26CrowPlacementValidatorComponent final : public UActorComponent
{
public:
	class UObjectPlacementValidationWithRestrictionStrategy* _objectPlacementValidationStrategyWithRestrictions; // 0x00B8(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K26CrowPlacementValidatorComponent">();
	}
	static class UK26CrowPlacementValidatorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK26CrowPlacementValidatorComponent>();
	}
};
static_assert(alignof(UK26CrowPlacementValidatorComponent) == 0x000008, "Wrong alignment on UK26CrowPlacementValidatorComponent");
static_assert(sizeof(UK26CrowPlacementValidatorComponent) == 0x0000C0, "Wrong size on UK26CrowPlacementValidatorComponent");
static_assert(offsetof(UK26CrowPlacementValidatorComponent, _objectPlacementValidationStrategyWithRestrictions) == 0x0000B8, "Member 'UK26CrowPlacementValidatorComponent::_objectPlacementValidationStrategyWithRestrictions' has a wrong offset!");

// Class TheK26.K26CrowProjectile
// 0x04C8 (0x06F8 - 0x0230)
class AK26CrowProjectile final : public AActor
{
public:
	uint8                                         Pad_230[0x10];                                     // 0x0230(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class AK26CrowProjectile* crowProjectile)> OnCrowProjectileStateChanged; // 0x0240(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FVector                                _originalFireLocation;                             // 0x0250(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EK26ProjectileState, struct FK26ProjectileStateDetails> _projectileStateDetails;            // 0x0260(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _summonTime;                                       // 0x02B0(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTunableStat                           _detectionRadiusScaleX;                            // 0x02D8(0x0080)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTunableStat                           _detectionRadiusScaleY;                            // 0x0358(0x0080)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTunableStat                           _detectionRadiusScaleZ;                            // 0x03D8(0x0080)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _crowFireAuraVisibilityForSurvivorsTime;           // 0x0458(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _crowSummonAuraVisibilityForSurvivorsTime;         // 0x0480(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _detectionRadiusFromAbove;                         // 0x04A8(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _baseSpeed;                                        // 0x04D0(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _selfDestructTimeOnDestroyed;                      // 0x04F8(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _rangeToTriggerNearSurvivorSFX;                    // 0x0520(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            _onPathMovementSpeedModifierCurve;                 // 0x0548(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            _offPathMovementSpeedModifierCurve;                // 0x0550(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _projectileOffPathCurveDuration;                   // 0x0558(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_55C[0x4];                                      // 0x055C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        _path;                                             // 0x0560(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, Protected, NativeAccessSpecifierProtected)
	int32                                         _pooledPathIndex;                                  // 0x0570(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EK26ProjectileState                           _currentProjectileState;                           // 0x0574(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_575[0x3];                                      // 0x0575(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UK26PowerOutlineUpdateStrategy*         _outlineUpdateStrategy;                            // 0x0578(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UK26PowerOutlineUpdateStrategy*         _crowFlockOutlineUpdateStrategy;                   // 0x0580(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDOutlineComponent*                   _outlineComponent;                                 // 0x0588(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USplineComponent*                       _pathSplineComponent;                              // 0x0590(0x0008)(Edit, ExportObject, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   _collisionStaticMeshComponent;                     // 0x0598(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   _killerInstinctStaticMeshComponent;                // 0x05A0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDSkeletalMeshComponentBudgeted*      _visualSkeletalMeshComponent;                      // 0x05A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USceneComponent*                        _rootComponent;                                    // 0x05B0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDNavModifierComponent*               _dangerNavModifierComponent;                       // 0x05B8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(EK26ProjectileState newState, const struct FK26ProjectileStateDetails& newDetails)> _k26ProjectileStateChangeDelegate; // 0x05C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(const bool acquired)> OnAcquiredChanged;                           // 0x05D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_5E0[0x10];                                     // 0x05E0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                _forwardDirection;                                 // 0x05F0(0x000C)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _fireTime;                                         // 0x05FC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _currentDistanceAlongSpline;                       // 0x0600(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _offPathTime;                                      // 0x0604(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK26PowerStatusHandlerComponent*        _statusHandlerComponent;                           // 0x0608(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK26AmmoHandlerComponent*               _ammoHandlerComponent;                             // 0x0610(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK26PathHandlerComponent*               _pathHandlerComponent;                             // 0x0618(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_620[0xD8];                                     // 0x0620(0x00D8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnCollisionOverlapBegin(class UPrimitiveComponent* overlappedComp, class AActor* otherActor, class UPrimitiveComponent* otherComp, int32 otherBodyIndex, bool fromSweep, const struct FHitResult& sweepResult);
	void Authority_OnCollisionOverlapEnd(class UPrimitiveComponent* overlappedComp, class AActor* otherActor, class UPrimitiveComponent* otherComp, int32 otherBodyIndex);
	void Authority_OnDestroyAttempt(const TArray<class AActor*>& instigatorsForCompletion);
	void Authority_OnDestroyTimerExpired();
	void Authority_OnScoutingOverlapBegin(class UPrimitiveComponent* overlappedComp, class AActor* otherActor, class UPrimitiveComponent* otherComp, int32 otherBodyIndex, bool fromSweep, const struct FHitResult& sweepResult);
	void Authority_OnSummonComplete();
	void Client_LocalKillerStartSummonTimer(const float killerLocalSummonTime);
	void Cosmetic_OnEnteredNearAudioRangeOfSurvivor(class ACamperPlayer* survivor);
	void Cosmetic_OnExpiration();
	void HideOutlineFromSurvivor();
	void Local_OnCollisionOverlapBegin(class UPrimitiveComponent* overlappedComp, class AActor* otherActor, class UPrimitiveComponent* otherComp, int32 otherBodyIndex, bool fromSweep, const struct FHitResult& sweepResult);
	void Local_OnSummonComplete();
	void Multicast_OnExpiration();
	void Multicast_SetStartingPosition(const struct FVector& position, const struct FRotator& angle);
	void Multicast_SetState(const EK26ProjectileState newState, const int32 pooledPathIndex);
	void OnIntroCompleted();
	void OnIsWithinSurvivorRangeChanged(class AActor* survivorActor, const bool isInRange);
	void OnLevelReadyToPlay();
	void OnRep_Path();
	void OnSurvivorAdded(class ACamperPlayer* survivorAdded);
	void ProjectileWentOutOfBoundsEvent();
	void Server_OnSurvivorHit(const EK26ProjectileState stateOnHit, class ACamperPlayer* hitSurvivor);

	float GetDistanceFromFirePosition() const;
	bool IsHitboxBeingShown() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K26CrowProjectile">();
	}
	static class AK26CrowProjectile* GetDefaultObj()
	{
		return GetDefaultObjImpl<AK26CrowProjectile>();
	}
};
static_assert(alignof(AK26CrowProjectile) == 0x000008, "Wrong alignment on AK26CrowProjectile");
static_assert(sizeof(AK26CrowProjectile) == 0x0006F8, "Wrong size on AK26CrowProjectile");
static_assert(offsetof(AK26CrowProjectile, OnCrowProjectileStateChanged) == 0x000240, "Member 'AK26CrowProjectile::OnCrowProjectileStateChanged' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _originalFireLocation) == 0x000250, "Member 'AK26CrowProjectile::_originalFireLocation' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _projectileStateDetails) == 0x000260, "Member 'AK26CrowProjectile::_projectileStateDetails' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _summonTime) == 0x0002B0, "Member 'AK26CrowProjectile::_summonTime' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _detectionRadiusScaleX) == 0x0002D8, "Member 'AK26CrowProjectile::_detectionRadiusScaleX' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _detectionRadiusScaleY) == 0x000358, "Member 'AK26CrowProjectile::_detectionRadiusScaleY' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _detectionRadiusScaleZ) == 0x0003D8, "Member 'AK26CrowProjectile::_detectionRadiusScaleZ' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _crowFireAuraVisibilityForSurvivorsTime) == 0x000458, "Member 'AK26CrowProjectile::_crowFireAuraVisibilityForSurvivorsTime' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _crowSummonAuraVisibilityForSurvivorsTime) == 0x000480, "Member 'AK26CrowProjectile::_crowSummonAuraVisibilityForSurvivorsTime' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _detectionRadiusFromAbove) == 0x0004A8, "Member 'AK26CrowProjectile::_detectionRadiusFromAbove' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _baseSpeed) == 0x0004D0, "Member 'AK26CrowProjectile::_baseSpeed' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _selfDestructTimeOnDestroyed) == 0x0004F8, "Member 'AK26CrowProjectile::_selfDestructTimeOnDestroyed' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _rangeToTriggerNearSurvivorSFX) == 0x000520, "Member 'AK26CrowProjectile::_rangeToTriggerNearSurvivorSFX' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _onPathMovementSpeedModifierCurve) == 0x000548, "Member 'AK26CrowProjectile::_onPathMovementSpeedModifierCurve' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _offPathMovementSpeedModifierCurve) == 0x000550, "Member 'AK26CrowProjectile::_offPathMovementSpeedModifierCurve' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _projectileOffPathCurveDuration) == 0x000558, "Member 'AK26CrowProjectile::_projectileOffPathCurveDuration' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _path) == 0x000560, "Member 'AK26CrowProjectile::_path' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _pooledPathIndex) == 0x000570, "Member 'AK26CrowProjectile::_pooledPathIndex' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _currentProjectileState) == 0x000574, "Member 'AK26CrowProjectile::_currentProjectileState' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _outlineUpdateStrategy) == 0x000578, "Member 'AK26CrowProjectile::_outlineUpdateStrategy' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _crowFlockOutlineUpdateStrategy) == 0x000580, "Member 'AK26CrowProjectile::_crowFlockOutlineUpdateStrategy' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _outlineComponent) == 0x000588, "Member 'AK26CrowProjectile::_outlineComponent' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _pathSplineComponent) == 0x000590, "Member 'AK26CrowProjectile::_pathSplineComponent' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _collisionStaticMeshComponent) == 0x000598, "Member 'AK26CrowProjectile::_collisionStaticMeshComponent' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _killerInstinctStaticMeshComponent) == 0x0005A0, "Member 'AK26CrowProjectile::_killerInstinctStaticMeshComponent' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _visualSkeletalMeshComponent) == 0x0005A8, "Member 'AK26CrowProjectile::_visualSkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _rootComponent) == 0x0005B0, "Member 'AK26CrowProjectile::_rootComponent' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _dangerNavModifierComponent) == 0x0005B8, "Member 'AK26CrowProjectile::_dangerNavModifierComponent' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _k26ProjectileStateChangeDelegate) == 0x0005C0, "Member 'AK26CrowProjectile::_k26ProjectileStateChangeDelegate' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, OnAcquiredChanged) == 0x0005D0, "Member 'AK26CrowProjectile::OnAcquiredChanged' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _forwardDirection) == 0x0005F0, "Member 'AK26CrowProjectile::_forwardDirection' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _fireTime) == 0x0005FC, "Member 'AK26CrowProjectile::_fireTime' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _currentDistanceAlongSpline) == 0x000600, "Member 'AK26CrowProjectile::_currentDistanceAlongSpline' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _offPathTime) == 0x000604, "Member 'AK26CrowProjectile::_offPathTime' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _statusHandlerComponent) == 0x000608, "Member 'AK26CrowProjectile::_statusHandlerComponent' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _ammoHandlerComponent) == 0x000610, "Member 'AK26CrowProjectile::_ammoHandlerComponent' has a wrong offset!");
static_assert(offsetof(AK26CrowProjectile, _pathHandlerComponent) == 0x000618, "Member 'AK26CrowProjectile::_pathHandlerComponent' has a wrong offset!");

// Class TheK26.K26CrowProjectileAnimInstance
// 0x0040 (0x0300 - 0x02C0)
class UK26CrowProjectileAnimInstance final : public UAnimInstance
{
public:
	bool                                          _isInInvalidState;                                 // 0x02C0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInSummonState;                                  // 0x02C1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInIdleState;                                    // 0x02C2(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInFollowPathState;                              // 0x02C3(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInOffPathState;                                 // 0x02C4(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInDestroyedState;                               // 0x02C5(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isBeingFlashlighted;                              // 0x02C6(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C7[0x1];                                      // 0x02C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _flashlightProgress;                               // 0x02C8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2CC[0x24];                                     // 0x02CC(0x0024)(Fixing Size After Last Property [ Dumper-7 ])
	class AK26CrowProjectile*                     _owningCrowProjectile;                             // 0x02F0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F8[0x8];                                      // 0x02F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K26CrowProjectileAnimInstance">();
	}
	static class UK26CrowProjectileAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK26CrowProjectileAnimInstance>();
	}
};
static_assert(alignof(UK26CrowProjectileAnimInstance) == 0x000010, "Wrong alignment on UK26CrowProjectileAnimInstance");
static_assert(sizeof(UK26CrowProjectileAnimInstance) == 0x000300, "Wrong size on UK26CrowProjectileAnimInstance");
static_assert(offsetof(UK26CrowProjectileAnimInstance, _isInInvalidState) == 0x0002C0, "Member 'UK26CrowProjectileAnimInstance::_isInInvalidState' has a wrong offset!");
static_assert(offsetof(UK26CrowProjectileAnimInstance, _isInSummonState) == 0x0002C1, "Member 'UK26CrowProjectileAnimInstance::_isInSummonState' has a wrong offset!");
static_assert(offsetof(UK26CrowProjectileAnimInstance, _isInIdleState) == 0x0002C2, "Member 'UK26CrowProjectileAnimInstance::_isInIdleState' has a wrong offset!");
static_assert(offsetof(UK26CrowProjectileAnimInstance, _isInFollowPathState) == 0x0002C3, "Member 'UK26CrowProjectileAnimInstance::_isInFollowPathState' has a wrong offset!");
