#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheK30

#include "Basic.hpp"

#include "DBDInteraction_classes.hpp"
#include "StatSystem_structs.hpp"
#include "DBDBots_classes.hpp"
#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "DataTableUtilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "DBDCompetence_classes.hpp"
#include "Engine_classes.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "NetworkUtilities_structs.hpp"
#include "AnimationUtilities_structs.hpp"
#include "TheK30_structs.hpp"
#include "DBDAnimation_classes.hpp"
#include "DBDCosmetic_classes.hpp"
#include "Competence_classes.hpp"
#include "GameplayTagUtilities_structs.hpp"


namespace SDK
{

// Class TheK30.BTService_FindObject_GuardFlag
// 0x0000 (0x00C0 - 0x00C0)
class UBTService_FindObject_GuardFlag final : public UBTService_FindObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTService_FindObject_GuardFlag">();
	}
	static class UBTService_FindObject_GuardFlag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTService_FindObject_GuardFlag>();
	}
};
static_assert(alignof(UBTService_FindObject_GuardFlag) == 0x000008, "Wrong alignment on UBTService_FindObject_GuardFlag");
static_assert(sizeof(UBTService_FindObject_GuardFlag) == 0x0000C0, "Wrong size on UBTService_FindObject_GuardFlag");

// Class TheK30.DrawPatrolPathInteraction
// 0x01A0 (0x0920 - 0x0780)
class UDrawPatrolPathInteraction final : public UBasicChargeableInteraction
{
public:
	TMulticastInlineDelegate<void(bool isCharging, bool isChargeCompleted)> OnChargeStateChanged;    // 0x0778(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_788[0x38];                                     // 0x0788(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSecondaryInteractionProperties        _giveOrderProperties;                              // 0x07C0(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FSecondaryInteractionProperties        _releaseInteractionProperties;                     // 0x07F8(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _maximumInteractionDuration;                       // 0x0830(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _pathLengthWarningPercent;                         // 0x0858(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _pathDrawingDurationWarningPercent;                // 0x0880(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _postPowerHasteClass;                              // 0x08A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _postPowerHasteValue;                              // 0x08B0(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _hasteDurationByPathLength;                        // 0x08D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8E0[0x40];                                     // 0x08E0(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCancellationTimerCompleted();
	void Server_SendOrder(class AInteractable* target);
	void Server_StartPatrol();
	void SetIsCharging(bool isCharging);

	bool IsChargeCompleted() const;
	bool IsCharging() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DrawPatrolPathInteraction">();
	}
	static class UDrawPatrolPathInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDrawPatrolPathInteraction>();
	}
};
static_assert(alignof(UDrawPatrolPathInteraction) == 0x000010, "Wrong alignment on UDrawPatrolPathInteraction");
static_assert(sizeof(UDrawPatrolPathInteraction) == 0x000920, "Wrong size on UDrawPatrolPathInteraction");
static_assert(offsetof(UDrawPatrolPathInteraction, OnChargeStateChanged) == 0x000778, "Member 'UDrawPatrolPathInteraction::OnChargeStateChanged' has a wrong offset!");
static_assert(offsetof(UDrawPatrolPathInteraction, _giveOrderProperties) == 0x0007C0, "Member 'UDrawPatrolPathInteraction::_giveOrderProperties' has a wrong offset!");
static_assert(offsetof(UDrawPatrolPathInteraction, _releaseInteractionProperties) == 0x0007F8, "Member 'UDrawPatrolPathInteraction::_releaseInteractionProperties' has a wrong offset!");
static_assert(offsetof(UDrawPatrolPathInteraction, _maximumInteractionDuration) == 0x000830, "Member 'UDrawPatrolPathInteraction::_maximumInteractionDuration' has a wrong offset!");
static_assert(offsetof(UDrawPatrolPathInteraction, _pathLengthWarningPercent) == 0x000858, "Member 'UDrawPatrolPathInteraction::_pathLengthWarningPercent' has a wrong offset!");
static_assert(offsetof(UDrawPatrolPathInteraction, _pathDrawingDurationWarningPercent) == 0x000880, "Member 'UDrawPatrolPathInteraction::_pathDrawingDurationWarningPercent' has a wrong offset!");
static_assert(offsetof(UDrawPatrolPathInteraction, _postPowerHasteClass) == 0x0008A8, "Member 'UDrawPatrolPathInteraction::_postPowerHasteClass' has a wrong offset!");
static_assert(offsetof(UDrawPatrolPathInteraction, _postPowerHasteValue) == 0x0008B0, "Member 'UDrawPatrolPathInteraction::_postPowerHasteValue' has a wrong offset!");
static_assert(offsetof(UDrawPatrolPathInteraction, _hasteDurationByPathLength) == 0x0008D8, "Member 'UDrawPatrolPathInteraction::_hasteDurationByPathLength' has a wrong offset!");

// Class TheK30.FloatingCameraNavigationComponent
// 0x01B8 (0x0270 - 0x00B8)
class UFloatingCameraNavigationComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x18];                                      // 0x00B8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UObjectPlacerComponent>  _ownerObjectPlacer;                                // 0x00D0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _snappingDistance;                                 // 0x00D8(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _previewSnappingTime;                              // 0x0100(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _drawPathModeYawInputLimit;                        // 0x0128(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _floatingCameraMaxSpeed;                           // 0x0150(0x0080)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _floatingCameraAccelerationMultiplier;             // 0x01D0(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _strafeMovementSpeedMultiplier;                    // 0x01F8(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class ADBDPlayer>              _playerOwner;                                      // 0x0220(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_228[0x48];                                     // 0x0228(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Multicast_EnableWalkOffLegdes(bool isEnabled);
	void Server_EnableWalkOffLegdes(bool isEnabled);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FloatingCameraNavigationComponent">();
	}
	static class UFloatingCameraNavigationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFloatingCameraNavigationComponent>();
	}
};
static_assert(alignof(UFloatingCameraNavigationComponent) == 0x000008, "Wrong alignment on UFloatingCameraNavigationComponent");
static_assert(sizeof(UFloatingCameraNavigationComponent) == 0x000270, "Wrong size on UFloatingCameraNavigationComponent");
static_assert(offsetof(UFloatingCameraNavigationComponent, _ownerObjectPlacer) == 0x0000D0, "Member 'UFloatingCameraNavigationComponent::_ownerObjectPlacer' has a wrong offset!");
static_assert(offsetof(UFloatingCameraNavigationComponent, _snappingDistance) == 0x0000D8, "Member 'UFloatingCameraNavigationComponent::_snappingDistance' has a wrong offset!");
static_assert(offsetof(UFloatingCameraNavigationComponent, _previewSnappingTime) == 0x000100, "Member 'UFloatingCameraNavigationComponent::_previewSnappingTime' has a wrong offset!");
static_assert(offsetof(UFloatingCameraNavigationComponent, _drawPathModeYawInputLimit) == 0x000128, "Member 'UFloatingCameraNavigationComponent::_drawPathModeYawInputLimit' has a wrong offset!");
static_assert(offsetof(UFloatingCameraNavigationComponent, _floatingCameraMaxSpeed) == 0x000150, "Member 'UFloatingCameraNavigationComponent::_floatingCameraMaxSpeed' has a wrong offset!");
static_assert(offsetof(UFloatingCameraNavigationComponent, _floatingCameraAccelerationMultiplier) == 0x0001D0, "Member 'UFloatingCameraNavigationComponent::_floatingCameraAccelerationMultiplier' has a wrong offset!");
static_assert(offsetof(UFloatingCameraNavigationComponent, _strafeMovementSpeedMultiplier) == 0x0001F8, "Member 'UFloatingCameraNavigationComponent::_strafeMovementSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(UFloatingCameraNavigationComponent, _playerOwner) == 0x000220, "Member 'UFloatingCameraNavigationComponent::_playerOwner' has a wrong offset!");

// Class TheK30.GuardAttackableComponent
// 0x0000 (0x00B8 - 0x00B8)
class UGuardAttackableComponent final : public UAttackableComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardAttackableComponent">();
	}
	static class UGuardAttackableComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuardAttackableComponent>();
	}
};
static_assert(alignof(UGuardAttackableComponent) == 0x000008, "Wrong alignment on UGuardAttackableComponent");
static_assert(sizeof(UGuardAttackableComponent) == 0x0000B8, "Wrong size on UGuardAttackableComponent");

// Class TheK30.GuardAttackComponent
// 0x0088 (0x0140 - 0x00B8)
class UGuardAttackComponent final : public UActorComponent
{
public:
	TSubclassOf<class UStatusEffect>              _killerInstinctEffectClass;                        // 0x00B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _killerInstinctEffectDuration;                     // 0x00C0(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EDetectionZone                                _detectionZoneToUse;                               // 0x00E8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<TWeakObjectPtr<class ACamperPlayer>>     _survivorsInZone;                                  // 0x00F0(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardAttackComponent">();
	}
	static class UGuardAttackComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuardAttackComponent>();
	}
};
static_assert(alignof(UGuardAttackComponent) == 0x000008, "Wrong alignment on UGuardAttackComponent");
static_assert(sizeof(UGuardAttackComponent) == 0x000140, "Wrong size on UGuardAttackComponent");
static_assert(offsetof(UGuardAttackComponent, _killerInstinctEffectClass) == 0x0000B8, "Member 'UGuardAttackComponent::_killerInstinctEffectClass' has a wrong offset!");
static_assert(offsetof(UGuardAttackComponent, _killerInstinctEffectDuration) == 0x0000C0, "Member 'UGuardAttackComponent::_killerInstinctEffectDuration' has a wrong offset!");
static_assert(offsetof(UGuardAttackComponent, _detectionZoneToUse) == 0x0000E8, "Member 'UGuardAttackComponent::_detectionZoneToUse' has a wrong offset!");
static_assert(offsetof(UGuardAttackComponent, _survivorsInZone) == 0x0000F0, "Member 'UGuardAttackComponent::_survivorsInZone' has a wrong offset!");

// Class TheK30.GuardOrderBase
// 0x0010 (0x0630 - 0x0620)
class UGuardOrderBase : public UInteractionDefinition
{
public:
	bool                                          _shouldWaitForCurrentInteraction;                  // 0x0618(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_619[0x3];                                      // 0x0619(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   _explodeInteractableAnimNotifyID;                  // 0x061C(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_628[0x8];                                      // 0x0628(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardOrderBase">();
	}
	static class UGuardOrderBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuardOrderBase>();
	}
};
static_assert(alignof(UGuardOrderBase) == 0x000010, "Wrong alignment on UGuardOrderBase");
static_assert(sizeof(UGuardOrderBase) == 0x000630, "Wrong size on UGuardOrderBase");
static_assert(offsetof(UGuardOrderBase, _shouldWaitForCurrentInteraction) == 0x000618, "Member 'UGuardOrderBase::_shouldWaitForCurrentInteraction' has a wrong offset!");
static_assert(offsetof(UGuardOrderBase, _explodeInteractableAnimNotifyID) == 0x00061C, "Member 'UGuardOrderBase::_explodeInteractableAnimNotifyID' has a wrong offset!");

// Class TheK30.GuardBreakPallet
// 0x0000 (0x0630 - 0x0630)
class UGuardBreakPallet final : public UGuardOrderBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardBreakPallet">();
	}
	static class UGuardBreakPallet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuardBreakPallet>();
	}
};
static_assert(alignof(UGuardBreakPallet) == 0x000010, "Wrong alignment on UGuardBreakPallet");
static_assert(sizeof(UGuardBreakPallet) == 0x000630, "Wrong size on UGuardBreakPallet");

// Class TheK30.GuardBreakWall
// 0x0000 (0x0630 - 0x0630)
class UGuardBreakWall final : public UGuardOrderBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardBreakWall">();
	}
	static class UGuardBreakWall* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuardBreakWall>();
	}
};
static_assert(alignof(UGuardBreakWall) == 0x000010, "Wrong alignment on UGuardBreakWall");
static_assert(sizeof(UGuardBreakWall) == 0x000630, "Wrong size on UGuardBreakWall");

// Class TheK30.GuardController
// 0x0078 (0x0798 - 0x0720)
class AGuardController final : public ADBDAIBTController
{
public:
	uint8                                         Pad_720[0x8];                                      // 0x0720(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   _cannotHuntWhileIdleTags;                          // 0x0728(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FName                                   _isPatrollingKey;                                  // 0x0738(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   _patrolDestinationKey;                             // 0x0744(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   _patrolUseDirectPathKey;                           // 0x0750(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   _isHuntingKey;                                     // 0x075C(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   _huntedSurvivorKey;                                // 0x0768(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   _huntDestinationKey;                               // 0x0774(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   _huntUseDirectPathKey;                             // 0x0780(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   _huntShouldSearchLockerKey;                        // 0x078C(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnLoudNoiseTriggered(class AActor* originator, class AActor* instigatingActor, const struct FVector& location, bool shouldTrack, float* audibleRange, bool isQuickAction, bool isDeceivingNoise);
	void OnTargetPerceptionUpdated(class AActor* actor, const struct FAIStimulus& stimulus);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardController">();
	}
	static class AGuardController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGuardController>();
	}
};
static_assert(alignof(AGuardController) == 0x000008, "Wrong alignment on AGuardController");
static_assert(sizeof(AGuardController) == 0x000798, "Wrong size on AGuardController");
static_assert(offsetof(AGuardController, _cannotHuntWhileIdleTags) == 0x000728, "Member 'AGuardController::_cannotHuntWhileIdleTags' has a wrong offset!");
static_assert(offsetof(AGuardController, _isPatrollingKey) == 0x000738, "Member 'AGuardController::_isPatrollingKey' has a wrong offset!");
static_assert(offsetof(AGuardController, _patrolDestinationKey) == 0x000744, "Member 'AGuardController::_patrolDestinationKey' has a wrong offset!");
static_assert(offsetof(AGuardController, _patrolUseDirectPathKey) == 0x000750, "Member 'AGuardController::_patrolUseDirectPathKey' has a wrong offset!");
static_assert(offsetof(AGuardController, _isHuntingKey) == 0x00075C, "Member 'AGuardController::_isHuntingKey' has a wrong offset!");
static_assert(offsetof(AGuardController, _huntedSurvivorKey) == 0x000768, "Member 'AGuardController::_huntedSurvivorKey' has a wrong offset!");
static_assert(offsetof(AGuardController, _huntDestinationKey) == 0x000774, "Member 'AGuardController::_huntDestinationKey' has a wrong offset!");
static_assert(offsetof(AGuardController, _huntUseDirectPathKey) == 0x000780, "Member 'AGuardController::_huntUseDirectPathKey' has a wrong offset!");
static_assert(offsetof(AGuardController, _huntShouldSearchLockerKey) == 0x00078C, "Member 'AGuardController::_huntShouldSearchLockerKey' has a wrong offset!");

// Class TheK30.GuardDamageGenerator
// 0x0000 (0x0630 - 0x0630)
class UGuardDamageGenerator final : public UGuardOrderBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardDamageGenerator">();
	}
	static class UGuardDamageGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuardDamageGenerator>();
	}
};
static_assert(alignof(UGuardDamageGenerator) == 0x000010, "Wrong alignment on UGuardDamageGenerator");
static_assert(sizeof(UGuardDamageGenerator) == 0x000630, "Wrong size on UGuardDamageGenerator");

// Class TheK30.GuardFlag
// 0x00E0 (0x0310 - 0x0230)
class AGuardFlag final : public AActor
{
public:
	class UPrimitiveComponent*                    _flagPickupHitbox;                                 // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AKnightGuard*                           _owningGuard;                                      // 0x0238(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ADBDPlayer*                             _huntedSurvivor;                                   // 0x0240(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _flagPickupEnduranceEffectClass;                   // 0x0248(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _flagPickupEnduranceDuration;                      // 0x0250(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _flagPickupHasteEffectClass;                       // 0x0278(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _flagPickupHasteDuration;                          // 0x0280(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _flagPickupHasteModifier;                          // 0x02A8(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2D0[0x38];                                     // 0x02D0(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             _clientHuntedSurvivor;                             // 0x0308(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Authority_OnBeginOverlap(class UPrimitiveComponent* overlappedComponent, class AActor* other, class UPrimitiveComponent* otherComp, int32 otherBodyIndex, bool bFromSweep, const struct FHitResult& hitResult);
	void Cosmetic_OnFlagActivationTimerCompleted();
	void Cosmetic_OnFlagDisappearDueToHuntEnding(class ADBDPlayer* previouslyHuntedSurvivor);
	void Cosmetic_OnFlagSpawned(float activationTimerDuration);
	void Cosmetic_OnSurvivorCapturedFlag(class ADBDPlayer* previouslyHuntedSurvivor);
	void Multicast_OnCamperCapturedFlag(class ADBDPlayer* huntedSurvivor);
	void OnRep_HuntedSurvivor();

	float GetActivationTimeLeft() const;
	class ADBDPlayer* GetHuntedSurvivor() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardFlag">();
	}
	static class AGuardFlag* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGuardFlag>();
	}
};
static_assert(alignof(AGuardFlag) == 0x000008, "Wrong alignment on AGuardFlag");
static_assert(sizeof(AGuardFlag) == 0x000310, "Wrong size on AGuardFlag");
static_assert(offsetof(AGuardFlag, _flagPickupHitbox) == 0x000230, "Member 'AGuardFlag::_flagPickupHitbox' has a wrong offset!");
static_assert(offsetof(AGuardFlag, _owningGuard) == 0x000238, "Member 'AGuardFlag::_owningGuard' has a wrong offset!");
static_assert(offsetof(AGuardFlag, _huntedSurvivor) == 0x000240, "Member 'AGuardFlag::_huntedSurvivor' has a wrong offset!");
static_assert(offsetof(AGuardFlag, _flagPickupEnduranceEffectClass) == 0x000248, "Member 'AGuardFlag::_flagPickupEnduranceEffectClass' has a wrong offset!");
static_assert(offsetof(AGuardFlag, _flagPickupEnduranceDuration) == 0x000250, "Member 'AGuardFlag::_flagPickupEnduranceDuration' has a wrong offset!");
static_assert(offsetof(AGuardFlag, _flagPickupHasteEffectClass) == 0x000278, "Member 'AGuardFlag::_flagPickupHasteEffectClass' has a wrong offset!");
static_assert(offsetof(AGuardFlag, _flagPickupHasteDuration) == 0x000280, "Member 'AGuardFlag::_flagPickupHasteDuration' has a wrong offset!");
static_assert(offsetof(AGuardFlag, _flagPickupHasteModifier) == 0x0002A8, "Member 'AGuardFlag::_flagPickupHasteModifier' has a wrong offset!");
static_assert(offsetof(AGuardFlag, _clientHuntedSurvivor) == 0x000308, "Member 'AGuardFlag::_clientHuntedSurvivor' has a wrong offset!");

// Class TheK30.GuardFlagOUtlineUpdateStrategy
// 0x0020 (0x00E0 - 0x00C0)
class UGuardFlagOUtlineUpdateStrategy final : public UOutlineUpdateStrategy
{
public:
	struct FLinearColor                           _killerColor;                                      // 0x00C0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           _survivorColor;                                    // 0x00D0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardFlagOUtlineUpdateStrategy">();
	}
	static class UGuardFlagOUtlineUpdateStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuardFlagOUtlineUpdateStrategy>();
	}
};
static_assert(alignof(UGuardFlagOUtlineUpdateStrategy) == 0x000008, "Wrong alignment on UGuardFlagOUtlineUpdateStrategy");
static_assert(sizeof(UGuardFlagOUtlineUpdateStrategy) == 0x0000E0, "Wrong size on UGuardFlagOUtlineUpdateStrategy");
static_assert(offsetof(UGuardFlagOUtlineUpdateStrategy, _killerColor) == 0x0000C0, "Member 'UGuardFlagOUtlineUpdateStrategy::_killerColor' has a wrong offset!");
static_assert(offsetof(UGuardFlagOUtlineUpdateStrategy, _survivorColor) == 0x0000D0, "Member 'UGuardFlagOUtlineUpdateStrategy::_survivorColor' has a wrong offset!");

// Class TheK30.GuardHuntComponent
// 0x00D0 (0x0188 - 0x00B8)
class UGuardHuntComponent final : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(float completionProgress)> OnGuardPhaseProgressUpdate;             // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x24];                                      // 0x00C8(0x0024)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _maxPathingDetourLength;                           // 0x00EC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _distanceBeforeGoingToNextWaypoint;                // 0x00F0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _distanceBeforeGoingToNextWaypointOffNavmesh;      // 0x00F4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _distanceFromLockerToClearWaypoints;               // 0x00F8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _underWaypointZDistance;                           // 0x00FC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSpeedBasedNetSyncedValue              _huntTimeLeft;                                     // 0x0100(0x0038)(Net, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ACamperPlayer*                          _huntedSurvivor;                                   // 0x0138(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_140[0x4];                                      // 0x0140(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                _huntStartingLocation;                             // 0x0144(0x000C)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_150[0x20];                                     // 0x0150(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _speedConsideredStuck;                             // 0x0170(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _timeStuckToResetPathing;                          // 0x0174(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_178[0x10];                                     // 0x0178(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnCamperInjuredOrDowned(const struct FGameplayTag& gameplayTag, const struct FGameEventData& gameEventData);
	void Authority_OnCamperUnhooked(const struct FGameplayTag& gameplayTag, const struct FGameEventData& gameEventData);
	void OnRep_HuntedSurvivor(class ACamperPlayer* previousChasedSurvivor);
	void OnRep_HuntStartingLocation();

	class ACamperPlayer* GetHuntedSurvivor() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardHuntComponent">();
	}
	static class UGuardHuntComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuardHuntComponent>();
	}
};
static_assert(alignof(UGuardHuntComponent) == 0x000008, "Wrong alignment on UGuardHuntComponent");
static_assert(sizeof(UGuardHuntComponent) == 0x000188, "Wrong size on UGuardHuntComponent");
static_assert(offsetof(UGuardHuntComponent, OnGuardPhaseProgressUpdate) == 0x0000B8, "Member 'UGuardHuntComponent::OnGuardPhaseProgressUpdate' has a wrong offset!");
static_assert(offsetof(UGuardHuntComponent, _maxPathingDetourLength) == 0x0000EC, "Member 'UGuardHuntComponent::_maxPathingDetourLength' has a wrong offset!");
static_assert(offsetof(UGuardHuntComponent, _distanceBeforeGoingToNextWaypoint) == 0x0000F0, "Member 'UGuardHuntComponent::_distanceBeforeGoingToNextWaypoint' has a wrong offset!");
static_assert(offsetof(UGuardHuntComponent, _distanceBeforeGoingToNextWaypointOffNavmesh) == 0x0000F4, "Member 'UGuardHuntComponent::_distanceBeforeGoingToNextWaypointOffNavmesh' has a wrong offset!");
static_assert(offsetof(UGuardHuntComponent, _distanceFromLockerToClearWaypoints) == 0x0000F8, "Member 'UGuardHuntComponent::_distanceFromLockerToClearWaypoints' has a wrong offset!");
static_assert(offsetof(UGuardHuntComponent, _underWaypointZDistance) == 0x0000FC, "Member 'UGuardHuntComponent::_underWaypointZDistance' has a wrong offset!");
static_assert(offsetof(UGuardHuntComponent, _huntTimeLeft) == 0x000100, "Member 'UGuardHuntComponent::_huntTimeLeft' has a wrong offset!");
static_assert(offsetof(UGuardHuntComponent, _huntedSurvivor) == 0x000138, "Member 'UGuardHuntComponent::_huntedSurvivor' has a wrong offset!");
static_assert(offsetof(UGuardHuntComponent, _huntStartingLocation) == 0x000144, "Member 'UGuardHuntComponent::_huntStartingLocation' has a wrong offset!");
static_assert(offsetof(UGuardHuntComponent, _speedConsideredStuck) == 0x000170, "Member 'UGuardHuntComponent::_speedConsideredStuck' has a wrong offset!");
static_assert(offsetof(UGuardHuntComponent, _timeStuckToResetPathing) == 0x000174, "Member 'UGuardHuntComponent::_timeStuckToResetPathing' has a wrong offset!");

// Class TheK30.GuardHuntTeleport
// 0x0030 (0x0650 - 0x0620)
class UGuardHuntTeleport final : public UInteractionDefinition
{
public:
	struct FDBDTunableRowHandle                   _huntStartUpDuration;                              // 0x0618(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _huntStartUpDurationPathLengthMultiplier;          // 0x0640(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_648[0x8];                                      // 0x0648(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardHuntTeleport">();
	}
	static class UGuardHuntTeleport* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuardHuntTeleport>();
	}
};
static_assert(alignof(UGuardHuntTeleport) == 0x000010, "Wrong alignment on UGuardHuntTeleport");
static_assert(sizeof(UGuardHuntTeleport) == 0x000650, "Wrong size on UGuardHuntTeleport");
static_assert(offsetof(UGuardHuntTeleport, _huntStartUpDuration) == 0x000618, "Member 'UGuardHuntTeleport::_huntStartUpDuration' has a wrong offset!");
static_assert(offsetof(UGuardHuntTeleport, _huntStartUpDurationPathLengthMultiplier) == 0x000640, "Member 'UGuardHuntTeleport::_huntStartUpDurationPathLengthMultiplier' has a wrong offset!");

// Class TheK30.GuardInteractable
// 0x0008 (0x0350 - 0x0348)
class AGuardInteractable final : public APlayerInteractable
{
public:
	class UInteractionDefinition*                 _startHuntInteraction;                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardInteractable">();
	}
	static class AGuardInteractable* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGuardInteractable>();
	}
};
static_assert(alignof(AGuardInteractable) == 0x000008, "Wrong alignment on AGuardInteractable");
static_assert(sizeof(AGuardInteractable) == 0x000350, "Wrong size on AGuardInteractable");
static_assert(offsetof(AGuardInteractable, _startHuntInteraction) == 0x000348, "Member 'AGuardInteractable::_startHuntInteraction' has a wrong offset!");

// Class TheK30.GuardOutlineUpdateStrategy
// 0x0010 (0x00D0 - 0x00C0)
class UGuardOutlineUpdateStrategy final : public UOutlineUpdateStrategy
{
public:
	struct FLinearColor                           _killerColor;                                      // 0x00C0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardOutlineUpdateStrategy">();
	}
	static class UGuardOutlineUpdateStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuardOutlineUpdateStrategy>();
	}
};
static_assert(alignof(UGuardOutlineUpdateStrategy) == 0x000008, "Wrong alignment on UGuardOutlineUpdateStrategy");
static_assert(sizeof(UGuardOutlineUpdateStrategy) == 0x0000D0, "Wrong size on UGuardOutlineUpdateStrategy");
static_assert(offsetof(UGuardOutlineUpdateStrategy, _killerColor) == 0x0000C0, "Member 'UGuardOutlineUpdateStrategy::_killerColor' has a wrong offset!");

// Class TheK30.GuardPatrolComponent
// 0x0120 (0x01D8 - 0x00B8)
class UGuardPatrolComponent final : public UActorComponent
{
public:
	uint8                                         _currentDirection;                                 // 0x00B8(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B9[0x17];                                      // 0x00B9(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _patrolPathLength;                                 // 0x00D0(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _isInPatrolStartup;                                // 0x00D4(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _isPatrolling;                                     // 0x00D5(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D6[0x2];                                       // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpeedBasedNetSyncedValue              _patrolTimeLeft;                                   // 0x00D8(0x0038)(Net, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_110[0x30];                                     // 0x0110(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _patrolTotalDuration;                              // 0x0140(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _distanceBeforeHeadingToNextNode;                  // 0x0144(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _spawningVisionAngle;                              // 0x0150(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _patrollingVisionAngle;                            // 0x0178(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _timeToInterpolateVisionRadius;                    // 0x01A0(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _detectionRadiusInterpolationDurationPathLengthMultiplier; // 0x01C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _detectionRadiusPathLenghtMultiplier;              // 0x01D0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnRep_IsPatrolling();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardPatrolComponent">();
	}
	static class UGuardPatrolComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuardPatrolComponent>();
	}
};
static_assert(alignof(UGuardPatrolComponent) == 0x000008, "Wrong alignment on UGuardPatrolComponent");
static_assert(sizeof(UGuardPatrolComponent) == 0x0001D8, "Wrong size on UGuardPatrolComponent");
static_assert(offsetof(UGuardPatrolComponent, _currentDirection) == 0x0000B8, "Member 'UGuardPatrolComponent::_currentDirection' has a wrong offset!");
static_assert(offsetof(UGuardPatrolComponent, _patrolPathLength) == 0x0000D0, "Member 'UGuardPatrolComponent::_patrolPathLength' has a wrong offset!");
static_assert(offsetof(UGuardPatrolComponent, _isInPatrolStartup) == 0x0000D4, "Member 'UGuardPatrolComponent::_isInPatrolStartup' has a wrong offset!");
static_assert(offsetof(UGuardPatrolComponent, _isPatrolling) == 0x0000D5, "Member 'UGuardPatrolComponent::_isPatrolling' has a wrong offset!");
static_assert(offsetof(UGuardPatrolComponent, _patrolTimeLeft) == 0x0000D8, "Member 'UGuardPatrolComponent::_patrolTimeLeft' has a wrong offset!");
static_assert(offsetof(UGuardPatrolComponent, _patrolTotalDuration) == 0x000140, "Member 'UGuardPatrolComponent::_patrolTotalDuration' has a wrong offset!");
static_assert(offsetof(UGuardPatrolComponent, _distanceBeforeHeadingToNextNode) == 0x000144, "Member 'UGuardPatrolComponent::_distanceBeforeHeadingToNextNode' has a wrong offset!");
static_assert(offsetof(UGuardPatrolComponent, _spawningVisionAngle) == 0x000150, "Member 'UGuardPatrolComponent::_spawningVisionAngle' has a wrong offset!");
static_assert(offsetof(UGuardPatrolComponent, _patrollingVisionAngle) == 0x000178, "Member 'UGuardPatrolComponent::_patrollingVisionAngle' has a wrong offset!");
static_assert(offsetof(UGuardPatrolComponent, _timeToInterpolateVisionRadius) == 0x0001A0, "Member 'UGuardPatrolComponent::_timeToInterpolateVisionRadius' has a wrong offset!");
static_assert(offsetof(UGuardPatrolComponent, _detectionRadiusInterpolationDurationPathLengthMultiplier) == 0x0001C8, "Member 'UGuardPatrolComponent::_detectionRadiusInterpolationDurationPathLengthMultiplier' has a wrong offset!");
static_assert(offsetof(UGuardPatrolComponent, _detectionRadiusPathLenghtMultiplier) == 0x0001D0, "Member 'UGuardPatrolComponent::_detectionRadiusPathLenghtMultiplier' has a wrong offset!");

// Class TheK30.GuardPullSurvivorOutOfLocker
// 0x0070 (0x06C0 - 0x0650)
class UGuardPullSurvivorOutOfLocker final : public UBaseLockerInteraction
{
public:
	class ACamperPlayer*                          _targetSurvivor;                                   // 0x0648(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAnimationMontageDescriptor            _healthySurvivorUpdateMontage;                     // 0x0650(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FAnimationMontageDescriptor            _injuredSurvivorUpdateMontage;                     // 0x0670(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _pullOutOfLockerDuration;                          // 0x0690(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6B8[0x8];                                      // 0x06B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardPullSurvivorOutOfLocker">();
	}
	static class UGuardPullSurvivorOutOfLocker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuardPullSurvivorOutOfLocker>();
	}
};
static_assert(alignof(UGuardPullSurvivorOutOfLocker) == 0x000010, "Wrong alignment on UGuardPullSurvivorOutOfLocker");
static_assert(sizeof(UGuardPullSurvivorOutOfLocker) == 0x0006C0, "Wrong size on UGuardPullSurvivorOutOfLocker");
static_assert(offsetof(UGuardPullSurvivorOutOfLocker, _targetSurvivor) == 0x000648, "Member 'UGuardPullSurvivorOutOfLocker::_targetSurvivor' has a wrong offset!");
static_assert(offsetof(UGuardPullSurvivorOutOfLocker, _healthySurvivorUpdateMontage) == 0x000650, "Member 'UGuardPullSurvivorOutOfLocker::_healthySurvivorUpdateMontage' has a wrong offset!");
static_assert(offsetof(UGuardPullSurvivorOutOfLocker, _injuredSurvivorUpdateMontage) == 0x000670, "Member 'UGuardPullSurvivorOutOfLocker::_injuredSurvivorUpdateMontage' has a wrong offset!");
static_assert(offsetof(UGuardPullSurvivorOutOfLocker, _pullOutOfLockerDuration) == 0x000690, "Member 'UGuardPullSurvivorOutOfLocker::_pullOutOfLockerDuration' has a wrong offset!");

// Class TheK30.GuardSlowingZone
// 0x0000 (0x0230 - 0x0230)
class AGuardSlowingZone : public AActor
{
public:
	void OnZoneBeginOverlap(class AActor* overlappedActor, class AActor* otherActor);
	void OnZoneEndOverlap(class AActor* overlappedActor, class AActor* otherActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardSlowingZone">();
	}
	static class AGuardSlowingZone* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGuardSlowingZone>();
	}
};
static_assert(alignof(AGuardSlowingZone) == 0x000008, "Wrong alignment on AGuardSlowingZone");
static_assert(sizeof(AGuardSlowingZone) == 0x000230, "Wrong size on AGuardSlowingZone");

// Class TheK30.GuardPalletSlowingZone
// 0x0008 (0x0238 - 0x0230)
class AGuardPalletSlowingZone final : public AGuardSlowingZone
{
public:
	class APallet*                                _linkedPallet;                                     // 0x0230(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnRep_LinkedPallet();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardPalletSlowingZone">();
	}
	static class AGuardPalletSlowingZone* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGuardPalletSlowingZone>();
	}
};
static_assert(alignof(AGuardPalletSlowingZone) == 0x000008, "Wrong alignment on AGuardPalletSlowingZone");
static_assert(sizeof(AGuardPalletSlowingZone) == 0x000238, "Wrong size on AGuardPalletSlowingZone");
static_assert(offsetof(AGuardPalletSlowingZone, _linkedPallet) == 0x000230, "Member 'AGuardPalletSlowingZone::_linkedPallet' has a wrong offset!");

// Class TheK30.K30BaseStatusEffectAddon
// 0x0020 (0x02D8 - 0x02B8)
class UK30BaseStatusEffectAddon : public UItemAddon
{
public:
	TArray<TSubclassOf<class UStatusEffect>>      _baseStatusEffectClasses;                          // 0x02B8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	float                                         _lifetime;                                         // 0x02C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _customParam;                                      // 0x02CC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _shouldDisplay;                                    // 0x02D0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K30BaseStatusEffectAddon">();
	}
	static class UK30BaseStatusEffectAddon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK30BaseStatusEffectAddon>();
	}
};
static_assert(alignof(UK30BaseStatusEffectAddon) == 0x000008, "Wrong alignment on UK30BaseStatusEffectAddon");
static_assert(sizeof(UK30BaseStatusEffectAddon) == 0x0002D8, "Wrong size on UK30BaseStatusEffectAddon");
static_assert(offsetof(UK30BaseStatusEffectAddon, _baseStatusEffectClasses) == 0x0002B8, "Member 'UK30BaseStatusEffectAddon::_baseStatusEffectClasses' has a wrong offset!");
static_assert(offsetof(UK30BaseStatusEffectAddon, _lifetime) == 0x0002C8, "Member 'UK30BaseStatusEffectAddon::_lifetime' has a wrong offset!");
static_assert(offsetof(UK30BaseStatusEffectAddon, _customParam) == 0x0002CC, "Member 'UK30BaseStatusEffectAddon::_customParam' has a wrong offset!");
static_assert(offsetof(UK30BaseStatusEffectAddon, _shouldDisplay) == 0x0002D0, "Member 'UK30BaseStatusEffectAddon::_shouldDisplay' has a wrong offset!");

// Class TheK30.K30InflictStatusOnEndHuntAddon
// 0x0010 (0x02E8 - 0x02D8)
class UK30InflictStatusOnEndHuntAddon : public UK30BaseStatusEffectAddon
{
public:
	TArray<EGuardHuntEndReason>                   _huntEndReasonsToApplyEffect;                      // 0x02D8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	void Authority_OnEndHunt(class ADBDPlayer* player, EGuardHuntEndReason huntEndReason);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K30InflictStatusOnEndHuntAddon">();
	}
	static class UK30InflictStatusOnEndHuntAddon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK30InflictStatusOnEndHuntAddon>();
	}
};
static_assert(alignof(UK30InflictStatusOnEndHuntAddon) == 0x000008, "Wrong alignment on UK30InflictStatusOnEndHuntAddon");
static_assert(sizeof(UK30InflictStatusOnEndHuntAddon) == 0x0002E8, "Wrong size on UK30InflictStatusOnEndHuntAddon");
static_assert(offsetof(UK30InflictStatusOnEndHuntAddon, _huntEndReasonsToApplyEffect) == 0x0002D8, "Member 'UK30InflictStatusOnEndHuntAddon::_huntEndReasonsToApplyEffect' has a wrong offset!");

// Class TheK30.K30Addon14
// 0x0008 (0x02F0 - 0x02E8)
class UK30Addon14 final : public UK30InflictStatusOnEndHuntAddon
{
public:
	int32                                         _numberOfEscapesBeforeEffect;                      // 0x02E8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K30Addon14">();
	}
	static class UK30Addon14* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK30Addon14>();
	}
};
static_assert(alignof(UK30Addon14) == 0x000008, "Wrong alignment on UK30Addon14");
static_assert(sizeof(UK30Addon14) == 0x0002F0, "Wrong size on UK30Addon14");
static_assert(offsetof(UK30Addon14, _numberOfEscapesBeforeEffect) == 0x0002E8, "Member 'UK30Addon14::_numberOfEscapesBeforeEffect' has a wrong offset!");

// Class TheK30.K30ApplyStatusOnWakeUpAddon
// 0x0008 (0x02E0 - 0x02D8)
class UK30ApplyStatusOnWakeUpAddon : public UK30BaseStatusEffectAddon
{
public:
	TSubclassOf<class AKnightGuard>               _applicableGuard;                                  // 0x02D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void Authority_OnWakeUp(class AKnightGuard* currentGuard);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K30ApplyStatusOnWakeUpAddon">();
	}
	static class UK30ApplyStatusOnWakeUpAddon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK30ApplyStatusOnWakeUpAddon>();
	}
};
static_assert(alignof(UK30ApplyStatusOnWakeUpAddon) == 0x000008, "Wrong alignment on UK30ApplyStatusOnWakeUpAddon");
static_assert(sizeof(UK30ApplyStatusOnWakeUpAddon) == 0x0002E0, "Wrong size on UK30ApplyStatusOnWakeUpAddon");
static_assert(offsetof(UK30ApplyStatusOnWakeUpAddon, _applicableGuard) == 0x0002D8, "Member 'UK30ApplyStatusOnWakeUpAddon::_applicableGuard' has a wrong offset!");

// Class TheK30.K30Addon16
// 0x0000 (0x02E0 - 0x02E0)
class UK30Addon16 final : public UK30ApplyStatusOnWakeUpAddon
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K30Addon16">();
	}
	static class UK30Addon16* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK30Addon16>();
	}
};
static_assert(alignof(UK30Addon16) == 0x000008, "Wrong alignment on UK30Addon16");
static_assert(sizeof(UK30Addon16) == 0x0002E0, "Wrong size on UK30Addon16");

// Class TheK30.K30Addon17
// 0x0010 (0x02F0 - 0x02E0)
class UK30Addon17 final : public UK30ApplyStatusOnWakeUpAddon
{
public:
	TSubclassOf<class UStatusEffect>              _revealAuraToKillerEffectClass;                    // 0x02E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _distanceForScreams;                               // 0x02E8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_RevealAndMakeSurvivorScream(class ADBDPlayer* survivorPlayer, const float screamRevealDuration);
	void Multicast_OnMakeSurvivorScream(class ADBDPlayer* player, const float lifetime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K30Addon17">();
	}
	static class UK30Addon17* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK30Addon17>();
	}
};
static_assert(alignof(UK30Addon17) == 0x000008, "Wrong alignment on UK30Addon17");
static_assert(sizeof(UK30Addon17) == 0x0002F0, "Wrong size on UK30Addon17");
static_assert(offsetof(UK30Addon17, _revealAuraToKillerEffectClass) == 0x0002E0, "Member 'UK30Addon17::_revealAuraToKillerEffectClass' has a wrong offset!");
static_assert(offsetof(UK30Addon17, _distanceForScreams) == 0x0002E8, "Member 'UK30Addon17::_distanceForScreams' has a wrong offset!");

// Class TheK30.K30Addon19
// 0x0010 (0x02F0 - 0x02E0)
class UK30Addon19 final : public UK30ApplyStatusOnWakeUpAddon
{
public:
	int32                                         _numberOfSummonsBeforeEffect;                      // 0x02E0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _distanceThresholdForEffect;                       // 0x02E4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2E8[0x8];                                      // 0x02E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K30Addon19">();
	}
	static class UK30Addon19* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK30Addon19>();
	}
};
static_assert(alignof(UK30Addon19) == 0x000008, "Wrong alignment on UK30Addon19");
static_assert(sizeof(UK30Addon19) == 0x0002F0, "Wrong size on UK30Addon19");
static_assert(offsetof(UK30Addon19, _numberOfSummonsBeforeEffect) == 0x0002E0, "Member 'UK30Addon19::_numberOfSummonsBeforeEffect' has a wrong offset!");
static_assert(offsetof(UK30Addon19, _distanceThresholdForEffect) == 0x0002E4, "Member 'UK30Addon19::_distanceThresholdForEffect' has a wrong offset!");

// Class TheK30.K30Addon20
// 0x0038 (0x0310 - 0x02D8)
class UK30Addon20 final : public UK30BaseStatusEffectAddon
{
public:
	uint8                                         Pad_2D8[0x10];                                     // 0x02D8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AWindow*>                        _blockedWindows;                                   // 0x02E8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class ADBDPlayer*                             _huntedSurvivor;                                   // 0x02F8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _gateBlockerEffectClass;                           // 0x0300(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _trailPassThroughWindowBlockTime;                  // 0x0308(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnEndHunt(class ADBDPlayer* player, EGuardHuntEndReason huntEndReason);
	void Authority_OnHuntedSurvivorVault(const struct FGameplayTag& gameEventType, const struct FGameEventData& gameEventData);
	void Authority_OnStartHunt(class ADBDPlayer* player);
	void Authority_OnTrailCameraGoThroughWindow(class AWindow* window);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K30Addon20">();
	}
	static class UK30Addon20* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK30Addon20>();
	}
};
static_assert(alignof(UK30Addon20) == 0x000008, "Wrong alignment on UK30Addon20");
static_assert(sizeof(UK30Addon20) == 0x000310, "Wrong size on UK30Addon20");
static_assert(offsetof(UK30Addon20, _blockedWindows) == 0x0002E8, "Member 'UK30Addon20::_blockedWindows' has a wrong offset!");
static_assert(offsetof(UK30Addon20, _huntedSurvivor) == 0x0002F8, "Member 'UK30Addon20::_huntedSurvivor' has a wrong offset!");
static_assert(offsetof(UK30Addon20, _gateBlockerEffectClass) == 0x000300, "Member 'UK30Addon20::_gateBlockerEffectClass' has a wrong offset!");
static_assert(offsetof(UK30Addon20, _trailPassThroughWindowBlockTime) == 0x000308, "Member 'UK30Addon20::_trailPassThroughWindowBlockTime' has a wrong offset!");

// Class TheK30.K30AnimInstance
// 0x0010 (0x0610 - 0x0600)
class UK30AnimInstance final : public UKillerAnimInstance
{
public:
	bool                                          _isChargingPower;                                  // 0x0600(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isSnapping;                                       // 0x0601(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isDrawingPath;                                    // 0x0602(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_603[0xD];                                      // 0x0603(0x000D)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K30AnimInstance">();
	}
	static class UK30AnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK30AnimInstance>();
	}
};
static_assert(alignof(UK30AnimInstance) == 0x000010, "Wrong alignment on UK30AnimInstance");
static_assert(sizeof(UK30AnimInstance) == 0x000610, "Wrong size on UK30AnimInstance");
static_assert(offsetof(UK30AnimInstance, _isChargingPower) == 0x000600, "Member 'UK30AnimInstance::_isChargingPower' has a wrong offset!");
static_assert(offsetof(UK30AnimInstance, _isSnapping) == 0x000601, "Member 'UK30AnimInstance::_isSnapping' has a wrong offset!");
static_assert(offsetof(UK30AnimInstance, _isDrawingPath) == 0x000602, "Member 'UK30AnimInstance::_isDrawingPath' has a wrong offset!");

// Class TheK30.K30CheatComponent
// 0x0008 (0x00C0 - 0x00B8)
class UK30CheatComponent final : public UActorComponent
{
public:
