#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheK24

#include "Basic.hpp"

#include "TheK24_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "DataTableUtilities_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "DBDCompetence_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DBDBots_classes.hpp"
#include "DBDAnimation_classes.hpp"
#include "SimpleStateMachine_classes.hpp"
#include "DBDGameplay_classes.hpp"
#include "AIModule_classes.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "StatSystem_structs.hpp"
#include "DBDInteraction_classes.hpp"
#include "DBDAttack_classes.hpp"
#include "GameplayTagUtilities_structs.hpp"


namespace SDK
{

// Class TheK24.ZombieAIController
// 0x02F0 (0x0630 - 0x0340)
class AZombieAIController final : public AAIController
{
public:
	uint8                                         Pad_340[0x18];                                     // 0x0340(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UBehaviorTree*                          _zombieBehaviorTree;                               // 0x0358(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAIPerceptionComponent*                 _aiPerceptionComponent;                            // 0x0360(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACamperPlayer*>                  _survivorInVision;                                 // 0x0370(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class ACamperPlayer*                          _chaseTargetSurvivor;                              // 0x0380(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                _goToLocation;                                     // 0x0388(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMeatHook*                              _patrolArea;                                       // 0x0398(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class ACamperPlayer*>                  _survivorsInAttackDetector;                        // 0x03A0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<struct FGameplayTag>                   _cannotChaseWhileIdleTags;                         // 0x03B0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _zombieAttackHitTime;                              // 0x03C0(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _zombieAttackOpenTime;                             // 0x03E8(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _zombieAnimSpawnTime;                              // 0x0410(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _zombieAnimDyingTime;                              // 0x0438(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _zombieSightRadius;                                // 0x0460(0x0080)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _zombieLoseSightRadius;                            // 0x04E0(0x0080)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _zombieVisionHalfAngle;                            // 0x0560(0x0080)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _zombieFallSmashTime;                              // 0x05E0(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _zombieAttackCooldownTime;                         // 0x0608(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Authority_OnTargetPerceptionUpdated(class AActor* actor, const struct FAIStimulus& stimulus);
	void OnSlasherSet(class ASlasherPlayer* slasher);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZombieAIController">();
	}
	static class AZombieAIController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZombieAIController>();
	}
};
static_assert(alignof(AZombieAIController) == 0x000008, "Wrong alignment on AZombieAIController");
static_assert(sizeof(AZombieAIController) == 0x000630, "Wrong size on AZombieAIController");
static_assert(offsetof(AZombieAIController, _zombieBehaviorTree) == 0x000358, "Member 'AZombieAIController::_zombieBehaviorTree' has a wrong offset!");
static_assert(offsetof(AZombieAIController, _aiPerceptionComponent) == 0x000360, "Member 'AZombieAIController::_aiPerceptionComponent' has a wrong offset!");
static_assert(offsetof(AZombieAIController, _survivorInVision) == 0x000370, "Member 'AZombieAIController::_survivorInVision' has a wrong offset!");
static_assert(offsetof(AZombieAIController, _chaseTargetSurvivor) == 0x000380, "Member 'AZombieAIController::_chaseTargetSurvivor' has a wrong offset!");
static_assert(offsetof(AZombieAIController, _goToLocation) == 0x000388, "Member 'AZombieAIController::_goToLocation' has a wrong offset!");
static_assert(offsetof(AZombieAIController, _patrolArea) == 0x000398, "Member 'AZombieAIController::_patrolArea' has a wrong offset!");
static_assert(offsetof(AZombieAIController, _survivorsInAttackDetector) == 0x0003A0, "Member 'AZombieAIController::_survivorsInAttackDetector' has a wrong offset!");
static_assert(offsetof(AZombieAIController, _cannotChaseWhileIdleTags) == 0x0003B0, "Member 'AZombieAIController::_cannotChaseWhileIdleTags' has a wrong offset!");
static_assert(offsetof(AZombieAIController, _zombieAttackHitTime) == 0x0003C0, "Member 'AZombieAIController::_zombieAttackHitTime' has a wrong offset!");
static_assert(offsetof(AZombieAIController, _zombieAttackOpenTime) == 0x0003E8, "Member 'AZombieAIController::_zombieAttackOpenTime' has a wrong offset!");
static_assert(offsetof(AZombieAIController, _zombieAnimSpawnTime) == 0x000410, "Member 'AZombieAIController::_zombieAnimSpawnTime' has a wrong offset!");
static_assert(offsetof(AZombieAIController, _zombieAnimDyingTime) == 0x000438, "Member 'AZombieAIController::_zombieAnimDyingTime' has a wrong offset!");
static_assert(offsetof(AZombieAIController, _zombieSightRadius) == 0x000460, "Member 'AZombieAIController::_zombieSightRadius' has a wrong offset!");
static_assert(offsetof(AZombieAIController, _zombieLoseSightRadius) == 0x0004E0, "Member 'AZombieAIController::_zombieLoseSightRadius' has a wrong offset!");
static_assert(offsetof(AZombieAIController, _zombieVisionHalfAngle) == 0x000560, "Member 'AZombieAIController::_zombieVisionHalfAngle' has a wrong offset!");
static_assert(offsetof(AZombieAIController, _zombieFallSmashTime) == 0x0005E0, "Member 'AZombieAIController::_zombieFallSmashTime' has a wrong offset!");
static_assert(offsetof(AZombieAIController, _zombieAttackCooldownTime) == 0x000608, "Member 'AZombieAIController::_zombieAttackCooldownTime' has a wrong offset!");

// Class TheK24.ActivateK24PowerInteraction
// 0x0090 (0x07D0 - 0x0740)
class UActivateK24PowerInteraction final : public UChargeableInteractionDefinition
{
public:
	uint8                                         Pad_740[0x10];                                     // 0x0740(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _interactionViewPitchMax;                          // 0x0750(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _interactionViewPitchMin;                          // 0x0778(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _maximumTimeToTriggerRegularAttack;                // 0x07A0(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7C8[0x8];                                      // 0x07C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetK24Power(class AK24Power* k24Power);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActivateK24PowerInteraction">();
	}
	static class UActivateK24PowerInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivateK24PowerInteraction>();
	}
};
static_assert(alignof(UActivateK24PowerInteraction) == 0x000010, "Wrong alignment on UActivateK24PowerInteraction");
static_assert(sizeof(UActivateK24PowerInteraction) == 0x0007D0, "Wrong size on UActivateK24PowerInteraction");
static_assert(offsetof(UActivateK24PowerInteraction, _interactionViewPitchMax) == 0x000750, "Member 'UActivateK24PowerInteraction::_interactionViewPitchMax' has a wrong offset!");
static_assert(offsetof(UActivateK24PowerInteraction, _interactionViewPitchMin) == 0x000778, "Member 'UActivateK24PowerInteraction::_interactionViewPitchMin' has a wrong offset!");
static_assert(offsetof(UActivateK24PowerInteraction, _maximumTimeToTriggerRegularAttack) == 0x0007A0, "Member 'UActivateK24PowerInteraction::_maximumTimeToTriggerRegularAttack' has a wrong offset!");

// Class TheK24.ZombieAnimInstance
// 0x0090 (0x0350 - 0x02C0)
class UZombieAnimInstance final : public UAnimInstance
{
public:
	bool                                          _isChasing;                                        // 0x02C0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _chaseLocomotionPlayRate;                          // 0x02C4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _chaseSequenceMaxSpeed;                            // 0x02C8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         _chaseLocomotionIndex;                             // 0x02CC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         _chaseLocomotionMaxIndex;                          // 0x02D0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFloatRange                            _chaseLocomotionIndexChangeTimerDurationRange;     // 0x02D4(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isUsingFirstChaseLocomotionPlayer;                // 0x02E4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isAttacking;                                      // 0x02E5(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E6[0x2];                                      // 0x02E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         _attackIndex;                                      // 0x02E8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         _maxAttackIndex;                                   // 0x02EC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isPatrollingOrSearching;                          // 0x02F0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isStunned;                                        // 0x02F1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isDying;                                          // 0x02F2(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isSpawning;                                       // 0x02F3(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInPool;                                         // 0x02F4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AZombieCharacter*                       _zombieCharacter;                                  // 0x02F8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _speed;                                            // 0x0300(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isMoving;                                         // 0x0304(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isFalling;                                        // 0x0305(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isMale;                                           // 0x0306(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_307[0x1];                                      // 0x0307(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _currentDirection;                                 // 0x0308(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               _currentRotation;                                  // 0x030C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         _rotationInterpolationSpeed;                       // 0x0318(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _rotationInterpolationSpeedDuringChase;            // 0x031C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_320[0x30];                                     // 0x0320(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZombieAnimInstance">();
	}
	static class UZombieAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZombieAnimInstance>();
	}
};
static_assert(alignof(UZombieAnimInstance) == 0x000010, "Wrong alignment on UZombieAnimInstance");
static_assert(sizeof(UZombieAnimInstance) == 0x000350, "Wrong size on UZombieAnimInstance");
static_assert(offsetof(UZombieAnimInstance, _isChasing) == 0x0002C0, "Member 'UZombieAnimInstance::_isChasing' has a wrong offset!");
static_assert(offsetof(UZombieAnimInstance, _chaseLocomotionPlayRate) == 0x0002C4, "Member 'UZombieAnimInstance::_chaseLocomotionPlayRate' has a wrong offset!");
static_assert(offsetof(UZombieAnimInstance, _chaseSequenceMaxSpeed) == 0x0002C8, "Member 'UZombieAnimInstance::_chaseSequenceMaxSpeed' has a wrong offset!");
static_assert(offsetof(UZombieAnimInstance, _chaseLocomotionIndex) == 0x0002CC, "Member 'UZombieAnimInstance::_chaseLocomotionIndex' has a wrong offset!");
static_assert(offsetof(UZombieAnimInstance, _chaseLocomotionMaxIndex) == 0x0002D0, "Member 'UZombieAnimInstance::_chaseLocomotionMaxIndex' has a wrong offset!");
static_assert(offsetof(UZombieAnimInstance, _chaseLocomotionIndexChangeTimerDurationRange) == 0x0002D4, "Member 'UZombieAnimInstance::_chaseLocomotionIndexChangeTimerDurationRange' has a wrong offset!");
static_assert(offsetof(UZombieAnimInstance, _isUsingFirstChaseLocomotionPlayer) == 0x0002E4, "Member 'UZombieAnimInstance::_isUsingFirstChaseLocomotionPlayer' has a wrong offset!");
static_assert(offsetof(UZombieAnimInstance, _isAttacking) == 0x0002E5, "Member 'UZombieAnimInstance::_isAttacking' has a wrong offset!");
static_assert(offsetof(UZombieAnimInstance, _attackIndex) == 0x0002E8, "Member 'UZombieAnimInstance::_attackIndex' has a wrong offset!");
static_assert(offsetof(UZombieAnimInstance, _maxAttackIndex) == 0x0002EC, "Member 'UZombieAnimInstance::_maxAttackIndex' has a wrong offset!");
static_assert(offsetof(UZombieAnimInstance, _isPatrollingOrSearching) == 0x0002F0, "Member 'UZombieAnimInstance::_isPatrollingOrSearching' has a wrong offset!");
static_assert(offsetof(UZombieAnimInstance, _isStunned) == 0x0002F1, "Member 'UZombieAnimInstance::_isStunned' has a wrong offset!");
static_assert(offsetof(UZombieAnimInstance, _isDying) == 0x0002F2, "Member 'UZombieAnimInstance::_isDying' has a wrong offset!");
static_assert(offsetof(UZombieAnimInstance, _isSpawning) == 0x0002F3, "Member 'UZombieAnimInstance::_isSpawning' has a wrong offset!");
static_assert(offsetof(UZombieAnimInstance, _isInPool) == 0x0002F4, "Member 'UZombieAnimInstance::_isInPool' has a wrong offset!");
static_assert(offsetof(UZombieAnimInstance, _zombieCharacter) == 0x0002F8, "Member 'UZombieAnimInstance::_zombieCharacter' has a wrong offset!");
static_assert(offsetof(UZombieAnimInstance, _speed) == 0x000300, "Member 'UZombieAnimInstance::_speed' has a wrong offset!");
static_assert(offsetof(UZombieAnimInstance, _isMoving) == 0x000304, "Member 'UZombieAnimInstance::_isMoving' has a wrong offset!");
static_assert(offsetof(UZombieAnimInstance, _isFalling) == 0x000305, "Member 'UZombieAnimInstance::_isFalling' has a wrong offset!");
static_assert(offsetof(UZombieAnimInstance, _isMale) == 0x000306, "Member 'UZombieAnimInstance::_isMale' has a wrong offset!");
static_assert(offsetof(UZombieAnimInstance, _currentDirection) == 0x000308, "Member 'UZombieAnimInstance::_currentDirection' has a wrong offset!");
static_assert(offsetof(UZombieAnimInstance, _currentRotation) == 0x00030C, "Member 'UZombieAnimInstance::_currentRotation' has a wrong offset!");
static_assert(offsetof(UZombieAnimInstance, _rotationInterpolationSpeed) == 0x000318, "Member 'UZombieAnimInstance::_rotationInterpolationSpeed' has a wrong offset!");
static_assert(offsetof(UZombieAnimInstance, _rotationInterpolationSpeedDuringChase) == 0x00031C, "Member 'UZombieAnimInstance::_rotationInterpolationSpeedDuringChase' has a wrong offset!");

// Class TheK24.Addon_K24_04
// 0x0018 (0x02E0 - 0x02C8)
class UAddon_K24_04 final : public UOnEventBaseAddon
{
public:
	float                                         _effectTime;                                       // 0x02C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           outlineColor;                                      // 0x02CC(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K24_04">();
	}
	static class UAddon_K24_04* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K24_04>();
	}
};
static_assert(alignof(UAddon_K24_04) == 0x000008, "Wrong alignment on UAddon_K24_04");
static_assert(sizeof(UAddon_K24_04) == 0x0002E0, "Wrong size on UAddon_K24_04");
static_assert(offsetof(UAddon_K24_04, _effectTime) == 0x0002C8, "Member 'UAddon_K24_04::_effectTime' has a wrong offset!");
static_assert(offsetof(UAddon_K24_04, outlineColor) == 0x0002CC, "Member 'UAddon_K24_04::outlineColor' has a wrong offset!");

// Class TheK24.ZombieAttackSurvivorBTTask
// 0x0000 (0x00B0 - 0x00B0)
class UZombieAttackSurvivorBTTask final : public UBTTask_BlueprintBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZombieAttackSurvivorBTTask">();
	}
	static class UZombieAttackSurvivorBTTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZombieAttackSurvivorBTTask>();
	}
};
static_assert(alignof(UZombieAttackSurvivorBTTask) == 0x000008, "Wrong alignment on UZombieAttackSurvivorBTTask");
static_assert(sizeof(UZombieAttackSurvivorBTTask) == 0x0000B0, "Wrong size on UZombieAttackSurvivorBTTask");

// Class TheK24.Addon_K24_18
// 0x0008 (0x02F0 - 0x02E8)
class UAddon_K24_18 final : public UImposeStatusEffectOnEventAddon
{
public:
	TSubclassOf<class AZombieEscapeDoorPointsActor> _zombieEscapeDoorPointsActor;                    // 0x02E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K24_18">();
	}
	static class UAddon_K24_18* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K24_18>();
	}
};
static_assert(alignof(UAddon_K24_18) == 0x000008, "Wrong alignment on UAddon_K24_18");
static_assert(sizeof(UAddon_K24_18) == 0x0002F0, "Wrong size on UAddon_K24_18");
static_assert(offsetof(UAddon_K24_18, _zombieEscapeDoorPointsActor) == 0x0002E8, "Member 'UAddon_K24_18::_zombieEscapeDoorPointsActor' has a wrong offset!");

// Class TheK24.ZombieAttractedByGeneratorBTService
// 0x0030 (0x00D0 - 0x00A0)
class UZombieAttractedByGeneratorBTService final : public UBTService_BlueprintBase
{
public:
	float                                         _genRepairingHearingRange;                         // 0x00A0(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A4[0x2C];                                      // 0x00A4(0x002C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnInRangeChanged(const bool inRange, class AGenerator* generator);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZombieAttractedByGeneratorBTService">();
	}
	static class UZombieAttractedByGeneratorBTService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZombieAttractedByGeneratorBTService>();
	}
};
static_assert(alignof(UZombieAttractedByGeneratorBTService) == 0x000008, "Wrong alignment on UZombieAttractedByGeneratorBTService");
static_assert(sizeof(UZombieAttractedByGeneratorBTService) == 0x0000D0, "Wrong size on UZombieAttractedByGeneratorBTService");
static_assert(offsetof(UZombieAttractedByGeneratorBTService, _genRepairingHearingRange) == 0x0000A0, "Member 'UZombieAttractedByGeneratorBTService::_genRepairingHearingRange' has a wrong offset!");

// Class TheK24.AISkill_FindCollectable_SupplyCrate
// 0x0010 (0x0158 - 0x0148)
class UAISkill_FindCollectable_SupplyCrate final : public UAISkill_FindCollectable_Searchable
{
public:
	struct FAITunableParameter                    UrgencyGoalWeight;                                 // 0x0148(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_FindCollectable_SupplyCrate">();
	}
	static class UAISkill_FindCollectable_SupplyCrate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_FindCollectable_SupplyCrate>();
	}
};
static_assert(alignof(UAISkill_FindCollectable_SupplyCrate) == 0x000008, "Wrong alignment on UAISkill_FindCollectable_SupplyCrate");
static_assert(sizeof(UAISkill_FindCollectable_SupplyCrate) == 0x000158, "Wrong size on UAISkill_FindCollectable_SupplyCrate");
static_assert(offsetof(UAISkill_FindCollectable_SupplyCrate, UrgencyGoalWeight) == 0x000148, "Member 'UAISkill_FindCollectable_SupplyCrate::UrgencyGoalWeight' has a wrong offset!");

// Class TheK24.AISkill_InteractionUseItem_Serum
// 0x0000 (0x0188 - 0x0188)
class UAISkill_InteractionUseItem_Serum final : public UAISkill_InteractionUseItem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_InteractionUseItem_Serum">();
	}
	static class UAISkill_InteractionUseItem_Serum* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_InteractionUseItem_Serum>();
	}
};
static_assert(alignof(UAISkill_InteractionUseItem_Serum) == 0x000008, "Wrong alignment on UAISkill_InteractionUseItem_Serum");
static_assert(sizeof(UAISkill_InteractionUseItem_Serum) == 0x000188, "Wrong size on UAISkill_InteractionUseItem_Serum");

// Class TheK24.BiteTheBullet
// 0x0010 (0x03D8 - 0x03C8)
class UBiteTheBullet final : public UPerk
{
public:
	TSubclassOf<class UBiteTheBulletEffect>       _effectClass;                                      // 0x03C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ADBDPlayer*                             _server_healTarget;                                // 0x03D0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BiteTheBullet">();
	}
	static class UBiteTheBullet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiteTheBullet>();
	}
};
static_assert(alignof(UBiteTheBullet) == 0x000008, "Wrong alignment on UBiteTheBullet");
static_assert(sizeof(UBiteTheBullet) == 0x0003D8, "Wrong size on UBiteTheBullet");
static_assert(offsetof(UBiteTheBullet, _effectClass) == 0x0003C8, "Member 'UBiteTheBullet::_effectClass' has a wrong offset!");
static_assert(offsetof(UBiteTheBullet, _server_healTarget) == 0x0003D0, "Member 'UBiteTheBullet::_server_healTarget' has a wrong offset!");

// Class TheK24.BiteTheBulletEffect
// 0x0008 (0x0360 - 0x0358)
class UBiteTheBulletEffect final : public UBaseLingeringStatusEffect
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BiteTheBulletEffect">();
	}
	static class UBiteTheBulletEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiteTheBulletEffect>();
	}
};
static_assert(alignof(UBiteTheBulletEffect) == 0x000008, "Wrong alignment on UBiteTheBulletEffect");
static_assert(sizeof(UBiteTheBulletEffect) == 0x000360, "Wrong size on UBiteTheBulletEffect");

// Class TheK24.BlastMine
// 0x0020 (0x04D8 - 0x04B8)
class UBlastMine final : public UGeneratorTrapPerk
{
public:
	TSubclassOf<class UGeneratorBlastMinePlacerComponent> _blastMinePlacerClass;                     // 0x04B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class ABlastMineFirecracker>      _blastMineFirecrackerClass;                        // 0x04C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ABlastMineFirecracker*                  _blastMine;                                        // 0x04C8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4D0[0x8];                                      // 0x04D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Client_TrapActivatedLoudNotification(const struct FTransform& location);
	void ThrowBubbleIndicator_Cosmetic(const struct FTransform& location);
	void TrapAttachedToGenerator_Cosmetic(class AGenerator* trappedGenerator);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlastMine">();
	}
	static class UBlastMine* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlastMine>();
	}
};
static_assert(alignof(UBlastMine) == 0x000008, "Wrong alignment on UBlastMine");
static_assert(sizeof(UBlastMine) == 0x0004D8, "Wrong size on UBlastMine");
static_assert(offsetof(UBlastMine, _blastMinePlacerClass) == 0x0004B8, "Member 'UBlastMine::_blastMinePlacerClass' has a wrong offset!");
static_assert(offsetof(UBlastMine, _blastMineFirecrackerClass) == 0x0004C0, "Member 'UBlastMine::_blastMineFirecrackerClass' has a wrong offset!");
static_assert(offsetof(UBlastMine, _blastMine) == 0x0004C8, "Member 'UBlastMine::_blastMine' has a wrong offset!");

// Class TheK24.BlastMineFirecracker
// 0x0080 (0x0400 - 0x0380)
class ABlastMineFirecracker final : public AFirecracker
{
public:
	uint8                                         Pad_380[0x30];                                     // 0x0380(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(EBlastMineRemovedReason removedReason)> OnTrapRemovedBlueprintEvent; // 0x03B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AGenerator*                             _trappedGenerator;                                 // 0x03C0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C8[0x8];                                      // 0x03C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USimpleStateMachine*                    _stateMachine;                                     // 0x03D0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBlastMineKickSensor*                   _kickSensor;                                       // 0x03D8(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBlastMineVisibilityController*         _visibilityController;                             // 0x03E0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _lifetime;                                         // 0x03E8(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         _authority_ExplosionCount;                         // 0x03EC(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   _authority_CurrentState;                           // 0x03F0(0x000C)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3FC[0x4];                                      // 0x03FC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_AuthorityCurrentState();
	void OnRep_AuthorityExplosionCount();
	void OnRep_Lifetime();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlastMineFirecracker">();
	}
	static class ABlastMineFirecracker* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABlastMineFirecracker>();
	}
};
static_assert(alignof(ABlastMineFirecracker) == 0x000008, "Wrong alignment on ABlastMineFirecracker");
static_assert(sizeof(ABlastMineFirecracker) == 0x000400, "Wrong size on ABlastMineFirecracker");
static_assert(offsetof(ABlastMineFirecracker, OnTrapRemovedBlueprintEvent) == 0x0003B0, "Member 'ABlastMineFirecracker::OnTrapRemovedBlueprintEvent' has a wrong offset!");
static_assert(offsetof(ABlastMineFirecracker, _trappedGenerator) == 0x0003C0, "Member 'ABlastMineFirecracker::_trappedGenerator' has a wrong offset!");
static_assert(offsetof(ABlastMineFirecracker, _stateMachine) == 0x0003D0, "Member 'ABlastMineFirecracker::_stateMachine' has a wrong offset!");
static_assert(offsetof(ABlastMineFirecracker, _kickSensor) == 0x0003D8, "Member 'ABlastMineFirecracker::_kickSensor' has a wrong offset!");
static_assert(offsetof(ABlastMineFirecracker, _visibilityController) == 0x0003E0, "Member 'ABlastMineFirecracker::_visibilityController' has a wrong offset!");
static_assert(offsetof(ABlastMineFirecracker, _lifetime) == 0x0003E8, "Member 'ABlastMineFirecracker::_lifetime' has a wrong offset!");
static_assert(offsetof(ABlastMineFirecracker, _authority_ExplosionCount) == 0x0003EC, "Member 'ABlastMineFirecracker::_authority_ExplosionCount' has a wrong offset!");
static_assert(offsetof(ABlastMineFirecracker, _authority_CurrentState) == 0x0003F0, "Member 'ABlastMineFirecracker::_authority_CurrentState' has a wrong offset!");

// Class TheK24.BlastMineKickSensor
// 0x0060 (0x0118 - 0x00B8)
class UBlastMineKickSensor final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x18];                                      // 0x00B8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFloatRange                            _kickChargeTriggerRange;                           // 0x00D0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ASlasherPlayer*                         _kickingKiller;                                    // 0x00E0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChargeableComponent*                   _kickGeneratorChargeable;                          // 0x00E8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AGenerator*                             _generator;                                        // 0x00F0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F8[0x20];                                      // 0x00F8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnKickChargeablePercentChanged(class UChargeableComponent* chargeableComponent, float percentCompletionChange, float totalPercentComplete);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlastMineKickSensor">();
	}
	static class UBlastMineKickSensor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlastMineKickSensor>();
	}
};
static_assert(alignof(UBlastMineKickSensor) == 0x000008, "Wrong alignment on UBlastMineKickSensor");
static_assert(sizeof(UBlastMineKickSensor) == 0x000118, "Wrong size on UBlastMineKickSensor");
static_assert(offsetof(UBlastMineKickSensor, _kickChargeTriggerRange) == 0x0000D0, "Member 'UBlastMineKickSensor::_kickChargeTriggerRange' has a wrong offset!");
static_assert(offsetof(UBlastMineKickSensor, _kickingKiller) == 0x0000E0, "Member 'UBlastMineKickSensor::_kickingKiller' has a wrong offset!");
static_assert(offsetof(UBlastMineKickSensor, _kickGeneratorChargeable) == 0x0000E8, "Member 'UBlastMineKickSensor::_kickGeneratorChargeable' has a wrong offset!");
static_assert(offsetof(UBlastMineKickSensor, _generator) == 0x0000F0, "Member 'UBlastMineKickSensor::_generator' has a wrong offset!");

// Class TheK24.BlastMineState_Explode
// 0x0028 (0x0070 - 0x0048)
class UBlastMineState_Explode final : public USimpleStateMachineBaseState
{
public:
	uint8                                         Pad_48[0x28];                                      // 0x0048(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlastMineState_Explode">();
	}
	static class UBlastMineState_Explode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlastMineState_Explode>();
	}
};
static_assert(alignof(UBlastMineState_Explode) == 0x000008, "Wrong alignment on UBlastMineState_Explode");
static_assert(sizeof(UBlastMineState_Explode) == 0x000070, "Wrong size on UBlastMineState_Explode");

// Class TheK24.BlastMineTransition_ExplodeToHidden
// 0x0000 (0x0050 - 0x0050)
class UBlastMineTransition_ExplodeToHidden final : public USimpleStateMachineBaseTransition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlastMineTransition_ExplodeToHidden">();
	}
	static class UBlastMineTransition_ExplodeToHidden* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlastMineTransition_ExplodeToHidden>();
	}
};
static_assert(alignof(UBlastMineTransition_ExplodeToHidden) == 0x000008, "Wrong alignment on UBlastMineTransition_ExplodeToHidden");
static_assert(sizeof(UBlastMineTransition_ExplodeToHidden) == 0x000050, "Wrong size on UBlastMineTransition_ExplodeToHidden");

// Class TheK24.BlastMineState_Hidden
// 0x0010 (0x0058 - 0x0048)
class UBlastMineState_Hidden final : public USimpleStateMachineBaseState
{
public:
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlastMineState_Hidden">();
	}
	static class UBlastMineState_Hidden* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlastMineState_Hidden>();
	}
};
static_assert(alignof(UBlastMineState_Hidden) == 0x000008, "Wrong alignment on UBlastMineState_Hidden");
static_assert(sizeof(UBlastMineState_Hidden) == 0x000058, "Wrong size on UBlastMineState_Hidden");

// Class TheK24.BlastMineTransition_HiddenToSpawned
// 0x0000 (0x0050 - 0x0050)
class UBlastMineTransition_HiddenToSpawned final : public USimpleStateMachineBaseTransition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlastMineTransition_HiddenToSpawned">();
	}
	static class UBlastMineTransition_HiddenToSpawned* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlastMineTransition_HiddenToSpawned>();
	}
};
static_assert(alignof(UBlastMineTransition_HiddenToSpawned) == 0x000008, "Wrong alignment on UBlastMineTransition_HiddenToSpawned");
static_assert(sizeof(UBlastMineTransition_HiddenToSpawned) == 0x000050, "Wrong size on UBlastMineTransition_HiddenToSpawned");

// Class TheK24.BlastMineState_Spawned
// 0x0050 (0x0098 - 0x0048)
class UBlastMineState_Spawned final : public USimpleStateMachineBaseState
{
public:
	uint8                                         Pad_48[0x50];                                      // 0x0048(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlastMineState_Spawned">();
	}
	static class UBlastMineState_Spawned* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlastMineState_Spawned>();
	}
};
static_assert(alignof(UBlastMineState_Spawned) == 0x000008, "Wrong alignment on UBlastMineState_Spawned");
static_assert(sizeof(UBlastMineState_Spawned) == 0x000098, "Wrong size on UBlastMineState_Spawned");

// Class TheK24.BlastMineTransition_SpawnedToExplode
// 0x0000 (0x0050 - 0x0050)
class UBlastMineTransition_SpawnedToExplode final : public USimpleStateMachineBaseTransition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlastMineTransition_SpawnedToExplode">();
	}
	static class UBlastMineTransition_SpawnedToExplode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlastMineTransition_SpawnedToExplode>();
	}
};
static_assert(alignof(UBlastMineTransition_SpawnedToExplode) == 0x000008, "Wrong alignment on UBlastMineTransition_SpawnedToExplode");
static_assert(sizeof(UBlastMineTransition_SpawnedToExplode) == 0x000050, "Wrong size on UBlastMineTransition_SpawnedToExplode");

// Class TheK24.BlastMineTransition_SpawnedToHidden
// 0x0000 (0x0050 - 0x0050)
class UBlastMineTransition_SpawnedToHidden final : public USimpleStateMachineBaseTransition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlastMineTransition_SpawnedToHidden">();
	}
	static class UBlastMineTransition_SpawnedToHidden* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlastMineTransition_SpawnedToHidden>();
	}
};
static_assert(alignof(UBlastMineTransition_SpawnedToHidden) == 0x000008, "Wrong alignment on UBlastMineTransition_SpawnedToHidden");
static_assert(sizeof(UBlastMineTransition_SpawnedToHidden) == 0x000050, "Wrong size on UBlastMineTransition_SpawnedToHidden");

// Class TheK24.BlastMineVisibilityController
// 0x0118 (0x01D0 - 0x00B8)
class UBlastMineVisibilityController final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x70];                                      // 0x00B8(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class UFXSystemComponent*>               _systems;                                          // 0x0128(0x0050)(ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TSet<class UMeshComponent*>                   _meshes;                                           // 0x0178(0x0050)(ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C8[0x8];                                      // 0x01C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddFXSystem(class UFXSystemComponent* system);
	void AddMeshComponent(class UMeshComponent* meshComponent);

	bool IsVisible() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlastMineVisibilityController">();
	}
	static class UBlastMineVisibilityController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlastMineVisibilityController>();
	}
};
static_assert(alignof(UBlastMineVisibilityController) == 0x000008, "Wrong alignment on UBlastMineVisibilityController");
static_assert(sizeof(UBlastMineVisibilityController) == 0x0001D0, "Wrong size on UBlastMineVisibilityController");
static_assert(offsetof(UBlastMineVisibilityController, _systems) == 0x000128, "Member 'UBlastMineVisibilityController::_systems' has a wrong offset!");
static_assert(offsetof(UBlastMineVisibilityController, _meshes) == 0x000178, "Member 'UBlastMineVisibilityController::_meshes' has a wrong offset!");

// Class TheK24.BlindZombieFlashlightableLightingStrategy
// 0x0000 (0x0040 - 0x0040)
class UBlindZombieFlashlightableLightingStrategy final : public UFlashlightablePointsLightingStrategy
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlindZombieFlashlightableLightingStrategy">();
	}
	static class UBlindZombieFlashlightableLightingStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlindZombieFlashlightableLightingStrategy>();
	}
};
static_assert(alignof(UBlindZombieFlashlightableLightingStrategy) == 0x000008, "Wrong alignment on UBlindZombieFlashlightableLightingStrategy");
static_assert(sizeof(UBlindZombieFlashlightableLightingStrategy) == 0x000040, "Wrong size on UBlindZombieFlashlightableLightingStrategy");

// Class TheK24.BTTask_MoveToAbortIfStuck
// 0x0018 (0x00D8 - 0x00C0)
class UBTTask_MoveToAbortIfStuck final : public UBTTask_MoveTo
{
public:
	uint8                                         Pad_C0[0x4];                                       // 0x00C0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _deltaConsideredStuck;                             // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C8[0xC];                                       // 0x00C8(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _maxTimeStuck;                                     // 0x00D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTTask_MoveToAbortIfStuck">();
	}
	static class UBTTask_MoveToAbortIfStuck* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_MoveToAbortIfStuck>();
	}
};
static_assert(alignof(UBTTask_MoveToAbortIfStuck) == 0x000008, "Wrong alignment on UBTTask_MoveToAbortIfStuck");
static_assert(sizeof(UBTTask_MoveToAbortIfStuck) == 0x0000D8, "Wrong size on UBTTask_MoveToAbortIfStuck");
static_assert(offsetof(UBTTask_MoveToAbortIfStuck, _deltaConsideredStuck) == 0x0000C4, "Member 'UBTTask_MoveToAbortIfStuck::_deltaConsideredStuck' has a wrong offset!");
static_assert(offsetof(UBTTask_MoveToAbortIfStuck, _maxTimeStuck) == 0x0000D4, "Member 'UBTTask_MoveToAbortIfStuck::_maxTimeStuck' has a wrong offset!");

// Class TheK24.ChangeZombieStateBTTask
// 0x0008 (0x00B8 - 0x00B0)
class UChangeZombieStateBTTask final : public UBTTask_BlueprintBase
{
public:
	EZombieState                                  _zombieState;                                      // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChangeZombieStateBTTask">();
	}
	static class UChangeZombieStateBTTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChangeZombieStateBTTask>();
	}
};
static_assert(alignof(UChangeZombieStateBTTask) == 0x000008, "Wrong alignment on UChangeZombieStateBTTask");
static_assert(sizeof(UChangeZombieStateBTTask) == 0x0000B8, "Wrong size on UChangeZombieStateBTTask");
static_assert(offsetof(UChangeZombieStateBTTask, _zombieState) == 0x0000B0, "Member 'UChangeZombieStateBTTask::_zombieState' has a wrong offset!");

// Class TheK24.ContaminationSerumCollectable
// 0x0018 (0x0510 - 0x04F8)
class AContaminationSerumCollectable final : public ABaseCamperCollectable
{
public:
	uint8                                         Pad_4F8[0x18];                                     // 0x04F8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ContaminationSerumCollectable">();
	}
	static class AContaminationSerumCollectable* GetDefaultObj()
	{
		return GetDefaultObjImpl<AContaminationSerumCollectable>();
	}
};
static_assert(alignof(AContaminationSerumCollectable) == 0x000008, "Wrong alignment on AContaminationSerumCollectable");
static_assert(sizeof(AContaminationSerumCollectable) == 0x000510, "Wrong size on AContaminationSerumCollectable");

// Class TheK24.ContaminationSubAnimInstance
// 0x0070 (0x05C0 - 0x0550)
class UContaminationSubAnimInstance final : public UBaseSurvivorAnimInstance
{
public:
	uint8                                         Pad_548[0x8];                                      // 0x0548(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _isContaminated;                                   // 0x0550(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInjectingSerumSelf;                             // 0x0551(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInjectingSerumOther;                            // 0x0552(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isBeingInjectedWithSerum;                         // 0x0553(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isBeingHealed;                                    // 0x0554(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isFirstContaminationHit;                          // 0x0555(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _triggerCough;                                     // 0x0556(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_557[0x1];                                      // 0x0557(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _timeBetweenCough;                                 // 0x0558(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isIdle;                                           // 0x055C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isCrouched;                                       // 0x055D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInsideCloset;                                   // 0x055E(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInteracting;                                    // 0x055F(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isHoldingAimItem;                                 // 0x0560(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isCrawling;                                       // 0x0561(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isHooked;                                         // 0x0562(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isDead;                                           // 0x0563(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isFrightScreaming;                                // 0x0564(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isHoldingSmallItem;                               // 0x0565(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isUsingAimItem;                                   // 0x0566(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isHoldingHandleItem;                              // 0x0567(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInjured;                                        // 0x0568(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isCarried;                                        // 0x0569(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EInteractionAnimation                         _interactionType;                                  // 0x056A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_56B[0x55];                                     // 0x056B(0x0055)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ContaminationSubAnimInstance">();
	}
	static class UContaminationSubAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContaminationSubAnimInstance>();
	}
};
static_assert(alignof(UContaminationSubAnimInstance) == 0x000010, "Wrong alignment on UContaminationSubAnimInstance");
static_assert(sizeof(UContaminationSubAnimInstance) == 0x0005C0, "Wrong size on UContaminationSubAnimInstance");
static_assert(offsetof(UContaminationSubAnimInstance, _isContaminated) == 0x000550, "Member 'UContaminationSubAnimInstance::_isContaminated' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isInjectingSerumSelf) == 0x000551, "Member 'UContaminationSubAnimInstance::_isInjectingSerumSelf' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isInjectingSerumOther) == 0x000552, "Member 'UContaminationSubAnimInstance::_isInjectingSerumOther' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isBeingInjectedWithSerum) == 0x000553, "Member 'UContaminationSubAnimInstance::_isBeingInjectedWithSerum' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isBeingHealed) == 0x000554, "Member 'UContaminationSubAnimInstance::_isBeingHealed' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isFirstContaminationHit) == 0x000555, "Member 'UContaminationSubAnimInstance::_isFirstContaminationHit' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _triggerCough) == 0x000556, "Member 'UContaminationSubAnimInstance::_triggerCough' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _timeBetweenCough) == 0x000558, "Member 'UContaminationSubAnimInstance::_timeBetweenCough' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isIdle) == 0x00055C, "Member 'UContaminationSubAnimInstance::_isIdle' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isCrouched) == 0x00055D, "Member 'UContaminationSubAnimInstance::_isCrouched' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isInsideCloset) == 0x00055E, "Member 'UContaminationSubAnimInstance::_isInsideCloset' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isInteracting) == 0x00055F, "Member 'UContaminationSubAnimInstance::_isInteracting' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isHoldingAimItem) == 0x000560, "Member 'UContaminationSubAnimInstance::_isHoldingAimItem' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isCrawling) == 0x000561, "Member 'UContaminationSubAnimInstance::_isCrawling' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isHooked) == 0x000562, "Member 'UContaminationSubAnimInstance::_isHooked' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isDead) == 0x000563, "Member 'UContaminationSubAnimInstance::_isDead' has a wrong offset!");
