#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheK29

#include "Basic.hpp"

#include "DBDGameplay_classes.hpp"
#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "DBDBots_classes.hpp"
#include "DBDAnimation_classes.hpp"
#include "TheK29_structs.hpp"
#include "DBDCompetence_classes.hpp"
#include "Engine_classes.hpp"
#include "DataTableUtilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "StatSystem_structs.hpp"
#include "DBDCosmetic_classes.hpp"


namespace SDK
{

// Class TheK29.AISkill_FindCollectable_K29SupplyCrate
// 0x0010 (0x0158 - 0x0148)
class UAISkill_FindCollectable_K29SupplyCrate final : public UAISkill_FindCollectable_Searchable
{
public:
	struct FAITunableParameter                    UrgencyGoalWeight;                                 // 0x0148(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_FindCollectable_K29SupplyCrate">();
	}
	static class UAISkill_FindCollectable_K29SupplyCrate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_FindCollectable_K29SupplyCrate>();
	}
};
static_assert(alignof(UAISkill_FindCollectable_K29SupplyCrate) == 0x000008, "Wrong alignment on UAISkill_FindCollectable_K29SupplyCrate");
static_assert(sizeof(UAISkill_FindCollectable_K29SupplyCrate) == 0x000158, "Wrong size on UAISkill_FindCollectable_K29SupplyCrate");
static_assert(offsetof(UAISkill_FindCollectable_K29SupplyCrate, UrgencyGoalWeight) == 0x000148, "Member 'UAISkill_FindCollectable_K29SupplyCrate::UrgencyGoalWeight' has a wrong offset!");

// Class TheK29.AISkill_InteractionUseItem_K29StabilizingSpray
// 0x0000 (0x0188 - 0x0188)
class UAISkill_InteractionUseItem_K29StabilizingSpray final : public UAISkill_InteractionUseItem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_InteractionUseItem_K29StabilizingSpray">();
	}
	static class UAISkill_InteractionUseItem_K29StabilizingSpray* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_InteractionUseItem_K29StabilizingSpray>();
	}
};
static_assert(alignof(UAISkill_InteractionUseItem_K29StabilizingSpray) == 0x000008, "Wrong alignment on UAISkill_InteractionUseItem_K29StabilizingSpray");
static_assert(sizeof(UAISkill_InteractionUseItem_K29StabilizingSpray) == 0x000188, "Wrong size on UAISkill_InteractionUseItem_K29StabilizingSpray");

// Class TheK29.AISkill_InteractionUseItem_K29StabilizingSprayOther
// 0x0000 (0x0188 - 0x0188)
class UAISkill_InteractionUseItem_K29StabilizingSprayOther final : public UAISkill_InteractionUseItem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_InteractionUseItem_K29StabilizingSprayOther">();
	}
	static class UAISkill_InteractionUseItem_K29StabilizingSprayOther* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_InteractionUseItem_K29StabilizingSprayOther>();
	}
};
static_assert(alignof(UAISkill_InteractionUseItem_K29StabilizingSprayOther) == 0x000008, "Wrong alignment on UAISkill_InteractionUseItem_K29StabilizingSprayOther");
static_assert(sizeof(UAISkill_InteractionUseItem_K29StabilizingSprayOther) == 0x000188, "Wrong size on UAISkill_InteractionUseItem_K29StabilizingSprayOther");

// Class TheK29.K29AnimInstance
// 0x0030 (0x0630 - 0x0600)
class UK29AnimInstance final : public UKillerAnimInstance
{
public:
	bool                                          _isRushing;                                        // 0x0600(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isHoldingSurvivor;                                // 0x0601(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isChargingRushing;                                // 0x0602(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isBetweenRushes;                                  // 0x0603(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isThrowing;                                       // 0x0604(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isBouncingBack;                                   // 0x0605(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _hasStartedFinalRush;                              // 0x0606(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _hasRushEndedInSurvivorImpact;                     // 0x0607(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _hasRushEndedInLedgeDrop;                          // 0x0608(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _hasInstantlyPickedUpSurvivor;                     // 0x0609(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isReadyToRushButHasNoPath;                        // 0x060A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_60B[0x25];                                     // 0x060B(0x0025)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnGameEventReceived(const struct FGameplayTag& gameplayTag, const struct FGameEventData& gameEventData);
	void OnHasInstantlyPickedUpSurvivor();
	void OnHasRushEndedInLedgeDrop();
	void OnHasRushEndedInSurvivorImpact();
	void OnStartThrowingSurvivor();
	void ResetHasInstantlyPickedUpSurvivor();
	void ResetHasRushEndedInLedgeDrop();
	void ResetHasRushEndedInSurvivorImpact();
	void ResetStartThrowingSurvivor();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K29AnimInstance">();
	}
	static class UK29AnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK29AnimInstance>();
	}
};
static_assert(alignof(UK29AnimInstance) == 0x000010, "Wrong alignment on UK29AnimInstance");
static_assert(sizeof(UK29AnimInstance) == 0x000630, "Wrong size on UK29AnimInstance");
static_assert(offsetof(UK29AnimInstance, _isRushing) == 0x000600, "Member 'UK29AnimInstance::_isRushing' has a wrong offset!");
static_assert(offsetof(UK29AnimInstance, _isHoldingSurvivor) == 0x000601, "Member 'UK29AnimInstance::_isHoldingSurvivor' has a wrong offset!");
static_assert(offsetof(UK29AnimInstance, _isChargingRushing) == 0x000602, "Member 'UK29AnimInstance::_isChargingRushing' has a wrong offset!");
static_assert(offsetof(UK29AnimInstance, _isBetweenRushes) == 0x000603, "Member 'UK29AnimInstance::_isBetweenRushes' has a wrong offset!");
static_assert(offsetof(UK29AnimInstance, _isThrowing) == 0x000604, "Member 'UK29AnimInstance::_isThrowing' has a wrong offset!");
static_assert(offsetof(UK29AnimInstance, _isBouncingBack) == 0x000605, "Member 'UK29AnimInstance::_isBouncingBack' has a wrong offset!");
static_assert(offsetof(UK29AnimInstance, _hasStartedFinalRush) == 0x000606, "Member 'UK29AnimInstance::_hasStartedFinalRush' has a wrong offset!");
static_assert(offsetof(UK29AnimInstance, _hasRushEndedInSurvivorImpact) == 0x000607, "Member 'UK29AnimInstance::_hasRushEndedInSurvivorImpact' has a wrong offset!");
static_assert(offsetof(UK29AnimInstance, _hasRushEndedInLedgeDrop) == 0x000608, "Member 'UK29AnimInstance::_hasRushEndedInLedgeDrop' has a wrong offset!");
static_assert(offsetof(UK29AnimInstance, _hasInstantlyPickedUpSurvivor) == 0x000609, "Member 'UK29AnimInstance::_hasInstantlyPickedUpSurvivor' has a wrong offset!");
static_assert(offsetof(UK29AnimInstance, _isReadyToRushButHasNoPath) == 0x00060A, "Member 'UK29AnimInstance::_isReadyToRushButHasNoPath' has a wrong offset!");

// Class TheK29.K29GateBlockerStatusEffect
// 0x0020 (0x03F0 - 0x03D0)
class UK29GateBlockerStatusEffect final : public ULingeringMultiStateTagStatusEffect
{
public:
	class FName                                   _escapeZoneBoxComponentTagName;                    // 0x03D0(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3DC[0x14];                                     // 0x03DC(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K29GateBlockerStatusEffect">();
	}
	static class UK29GateBlockerStatusEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK29GateBlockerStatusEffect>();
	}
};
static_assert(alignof(UK29GateBlockerStatusEffect) == 0x000008, "Wrong alignment on UK29GateBlockerStatusEffect");
static_assert(sizeof(UK29GateBlockerStatusEffect) == 0x0003F0, "Wrong size on UK29GateBlockerStatusEffect");
static_assert(offsetof(UK29GateBlockerStatusEffect, _escapeZoneBoxComponentTagName) == 0x0003D0, "Member 'UK29GateBlockerStatusEffect::_escapeZoneBoxComponentTagName' has a wrong offset!");

// Class TheK29.K29HinderedStatusEffect
// 0x00D0 (0x0420 - 0x0350)
class UK29HinderedStatusEffect final : public UStatusEffect
{
public:
	struct FDBDTunableRowHandle                   _maximumMovementSpeedDecrease;                     // 0x0350(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _minimumMovementSpeedDecrease;                     // 0x0378(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A0[0x80];                                     // 0x03A0(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K29HinderedStatusEffect">();
	}
	static class UK29HinderedStatusEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK29HinderedStatusEffect>();
	}
};
static_assert(alignof(UK29HinderedStatusEffect) == 0x000008, "Wrong alignment on UK29HinderedStatusEffect");
static_assert(sizeof(UK29HinderedStatusEffect) == 0x000420, "Wrong size on UK29HinderedStatusEffect");
static_assert(offsetof(UK29HinderedStatusEffect, _maximumMovementSpeedDecrease) == 0x000350, "Member 'UK29HinderedStatusEffect::_maximumMovementSpeedDecrease' has a wrong offset!");
static_assert(offsetof(UK29HinderedStatusEffect, _minimumMovementSpeedDecrease) == 0x000378, "Member 'UK29HinderedStatusEffect::_minimumMovementSpeedDecrease' has a wrong offset!");

// Class TheK29.K29InfectionRemovalCollectable
// 0x0048 (0x0540 - 0x04F8)
class AK29InfectionRemovalCollectable final : public ABaseCamperCollectable
{
public:
	class UK29InfectionRemovalItemOutlineUpdateStrategy* _outlineUpdateStrategy;                     // 0x04F8(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _maxCharges;                                       // 0x0500(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_528[0x18];                                     // 0x0528(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K29InfectionRemovalCollectable">();
	}
	static class AK29InfectionRemovalCollectable* GetDefaultObj()
	{
		return GetDefaultObjImpl<AK29InfectionRemovalCollectable>();
	}
};
static_assert(alignof(AK29InfectionRemovalCollectable) == 0x000008, "Wrong alignment on AK29InfectionRemovalCollectable");
static_assert(sizeof(AK29InfectionRemovalCollectable) == 0x000540, "Wrong size on AK29InfectionRemovalCollectable");
static_assert(offsetof(AK29InfectionRemovalCollectable, _outlineUpdateStrategy) == 0x0004F8, "Member 'AK29InfectionRemovalCollectable::_outlineUpdateStrategy' has a wrong offset!");
static_assert(offsetof(AK29InfectionRemovalCollectable, _maxCharges) == 0x000500, "Member 'AK29InfectionRemovalCollectable::_maxCharges' has a wrong offset!");

// Class TheK29.K29InfectionRemovalItemOutlineUpdateStrategy
// 0x0008 (0x00C8 - 0x00C0)
class UK29InfectionRemovalItemOutlineUpdateStrategy final : public UOutlineUpdateStrategy
{
public:
	bool                                          _isOutlineEnabled;                                 // 0x00C0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 _outlineColour;                                    // 0x00C4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetOutlineVisibility(bool isActive);

	bool IsOutlineVisible() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K29InfectionRemovalItemOutlineUpdateStrategy">();
	}
	static class UK29InfectionRemovalItemOutlineUpdateStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK29InfectionRemovalItemOutlineUpdateStrategy>();
	}
};
static_assert(alignof(UK29InfectionRemovalItemOutlineUpdateStrategy) == 0x000008, "Wrong alignment on UK29InfectionRemovalItemOutlineUpdateStrategy");
static_assert(sizeof(UK29InfectionRemovalItemOutlineUpdateStrategy) == 0x0000C8, "Wrong size on UK29InfectionRemovalItemOutlineUpdateStrategy");
static_assert(offsetof(UK29InfectionRemovalItemOutlineUpdateStrategy, _isOutlineEnabled) == 0x0000C0, "Member 'UK29InfectionRemovalItemOutlineUpdateStrategy::_isOutlineEnabled' has a wrong offset!");
static_assert(offsetof(UK29InfectionRemovalItemOutlineUpdateStrategy, _outlineColour) == 0x0000C4, "Member 'UK29InfectionRemovalItemOutlineUpdateStrategy::_outlineColour' has a wrong offset!");

// Class TheK29.K29P01
// 0x0010 (0x03D8 - 0x03C8)
class UK29P01 final : public UPerk
{
public:
	float                                         _survivorVaultRushedEventRange;                    // 0x03C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _cooldownTime;                                     // 0x03CC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3D0[0x8];                                      // 0x03D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetSurvivorVaultRushedEventRange() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K29P01">();
	}
	static class UK29P01* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK29P01>();
	}
};
static_assert(alignof(UK29P01) == 0x000008, "Wrong alignment on UK29P01");
static_assert(sizeof(UK29P01) == 0x0003D8, "Wrong size on UK29P01");
static_assert(offsetof(UK29P01, _survivorVaultRushedEventRange) == 0x0003C8, "Member 'UK29P01::_survivorVaultRushedEventRange' has a wrong offset!");
static_assert(offsetof(UK29P01, _cooldownTime) == 0x0003CC, "Member 'UK29P01::_cooldownTime' has a wrong offset!");

// Class TheK29.K29P02
// 0x00C8 (0x0490 - 0x03C8)
class UK29P02 final : public UPerk
{
public:
	float                                         _revealRange[0x3];                                 // 0x03C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _effectClass;                                      // 0x03D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<TWeakObjectPtr<class ACamperPlayer>, TWeakObjectPtr<class UStatusEffect>> _survivorRevealedEffects; // 0x03E0(0x0050)(ExportObject, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_430[0x60];                                     // 0x0430(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnInRangeChanged(const bool inRange, class ACamperPlayer* survivor);
	const float GetRevealRange();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K29P02">();
	}
	static class UK29P02* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK29P02>();
	}
};
static_assert(alignof(UK29P02) == 0x000008, "Wrong alignment on UK29P02");
static_assert(sizeof(UK29P02) == 0x000490, "Wrong size on UK29P02");
static_assert(offsetof(UK29P02, _revealRange) == 0x0003C8, "Member 'UK29P02::_revealRange' has a wrong offset!");
static_assert(offsetof(UK29P02, _effectClass) == 0x0003D8, "Member 'UK29P02::_effectClass' has a wrong offset!");
static_assert(offsetof(UK29P02, _survivorRevealedEffects) == 0x0003E0, "Member 'UK29P02::_survivorRevealedEffects' has a wrong offset!");

// Class TheK29.K29P03
// 0x0018 (0x03E0 - 0x03C8)
class UK29P03 final : public UPerk
{
public:
	float                                         _brokenEffectDuration[0x3];                        // 0x03C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _effectClass;                                      // 0x03D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K29P03">();
	}
	static class UK29P03* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK29P03>();
	}
};
static_assert(alignof(UK29P03) == 0x000008, "Wrong alignment on UK29P03");
static_assert(sizeof(UK29P03) == 0x0003E0, "Wrong size on UK29P03");
static_assert(offsetof(UK29P03, _brokenEffectDuration) == 0x0003C8, "Member 'UK29P03::_brokenEffectDuration' has a wrong offset!");
static_assert(offsetof(UK29P03, _effectClass) == 0x0003D8, "Member 'UK29P03::_effectClass' has a wrong offset!");

// Class TheK29.K29P03StatusEffect
// 0x0000 (0x0360 - 0x0360)
class UK29P03StatusEffect final : public UAdjustableCooldownStatusEffect
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K29P03StatusEffect">();
	}
	static class UK29P03StatusEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK29P03StatusEffect>();
	}
};
static_assert(alignof(UK29P03StatusEffect) == 0x000008, "Wrong alignment on UK29P03StatusEffect");
static_assert(sizeof(UK29P03StatusEffect) == 0x000360, "Wrong size on UK29P03StatusEffect");

// Class TheK29.K29PathingCalculatorComponent
// 0x0200 (0x02B8 - 0x00B8)
class UK29PathingCalculatorComponent final : public UActorComponent
{
public:
	struct FDBDTunableRowHandle                   _maxStepHeight;                                    // 0x00B8(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _maxStepHeightDownwards;                           // 0x00E0(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _horizontalAngle;                                  // 0x0108(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _verticalAngle;                                    // 0x0130(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _gridLength;                                       // 0x0158(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _detectionHeightOffset;                            // 0x0180(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _floorSearchLengthFromActorLocation;               // 0x01A8(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _minimumWallDashDistanceCarryingSurvivor;          // 0x01D0(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _floorCheckDistance;                               // 0x01F8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _lineOfSightCapsuleRadius;                         // 0x0200(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _lineOfSightCapsuleHeight;                         // 0x0228(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _lineOfSightCapsuleHeightOffset;                   // 0x0250(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _maximumWalkableAngle;                             // 0x0278(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _groundCollisionDetectionRadius;                   // 0x02A0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _allowedGroundBlockerHeight;                       // 0x02A4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _minimalLedgeDistance;                             // 0x02A8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2AC[0xC];                                      // 0x02AC(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K29PathingCalculatorComponent">();
	}
	static class UK29PathingCalculatorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK29PathingCalculatorComponent>();
	}
};
static_assert(alignof(UK29PathingCalculatorComponent) == 0x000008, "Wrong alignment on UK29PathingCalculatorComponent");
static_assert(sizeof(UK29PathingCalculatorComponent) == 0x0002B8, "Wrong size on UK29PathingCalculatorComponent");
static_assert(offsetof(UK29PathingCalculatorComponent, _maxStepHeight) == 0x0000B8, "Member 'UK29PathingCalculatorComponent::_maxStepHeight' has a wrong offset!");
static_assert(offsetof(UK29PathingCalculatorComponent, _maxStepHeightDownwards) == 0x0000E0, "Member 'UK29PathingCalculatorComponent::_maxStepHeightDownwards' has a wrong offset!");
static_assert(offsetof(UK29PathingCalculatorComponent, _horizontalAngle) == 0x000108, "Member 'UK29PathingCalculatorComponent::_horizontalAngle' has a wrong offset!");
static_assert(offsetof(UK29PathingCalculatorComponent, _verticalAngle) == 0x000130, "Member 'UK29PathingCalculatorComponent::_verticalAngle' has a wrong offset!");
static_assert(offsetof(UK29PathingCalculatorComponent, _gridLength) == 0x000158, "Member 'UK29PathingCalculatorComponent::_gridLength' has a wrong offset!");
static_assert(offsetof(UK29PathingCalculatorComponent, _detectionHeightOffset) == 0x000180, "Member 'UK29PathingCalculatorComponent::_detectionHeightOffset' has a wrong offset!");
static_assert(offsetof(UK29PathingCalculatorComponent, _floorSearchLengthFromActorLocation) == 0x0001A8, "Member 'UK29PathingCalculatorComponent::_floorSearchLengthFromActorLocation' has a wrong offset!");
static_assert(offsetof(UK29PathingCalculatorComponent, _minimumWallDashDistanceCarryingSurvivor) == 0x0001D0, "Member 'UK29PathingCalculatorComponent::_minimumWallDashDistanceCarryingSurvivor' has a wrong offset!");
static_assert(offsetof(UK29PathingCalculatorComponent, _floorCheckDistance) == 0x0001F8, "Member 'UK29PathingCalculatorComponent::_floorCheckDistance' has a wrong offset!");
static_assert(offsetof(UK29PathingCalculatorComponent, _lineOfSightCapsuleRadius) == 0x000200, "Member 'UK29PathingCalculatorComponent::_lineOfSightCapsuleRadius' has a wrong offset!");
static_assert(offsetof(UK29PathingCalculatorComponent, _lineOfSightCapsuleHeight) == 0x000228, "Member 'UK29PathingCalculatorComponent::_lineOfSightCapsuleHeight' has a wrong offset!");
static_assert(offsetof(UK29PathingCalculatorComponent, _lineOfSightCapsuleHeightOffset) == 0x000250, "Member 'UK29PathingCalculatorComponent::_lineOfSightCapsuleHeightOffset' has a wrong offset!");
static_assert(offsetof(UK29PathingCalculatorComponent, _maximumWalkableAngle) == 0x000278, "Member 'UK29PathingCalculatorComponent::_maximumWalkableAngle' has a wrong offset!");
static_assert(offsetof(UK29PathingCalculatorComponent, _groundCollisionDetectionRadius) == 0x0002A0, "Member 'UK29PathingCalculatorComponent::_groundCollisionDetectionRadius' has a wrong offset!");
static_assert(offsetof(UK29PathingCalculatorComponent, _allowedGroundBlockerHeight) == 0x0002A4, "Member 'UK29PathingCalculatorComponent::_allowedGroundBlockerHeight' has a wrong offset!");
static_assert(offsetof(UK29PathingCalculatorComponent, _minimalLedgeDistance) == 0x0002A8, "Member 'UK29PathingCalculatorComponent::_minimalLedgeDistance' has a wrong offset!");

// Class TheK29.K29Power
// 0x01A0 (0x0650 - 0x04B0)
class AK29Power final : public ACollectable
{
public:
	class UChargeableComponent*                   _rushChargeableComponent;                          // 0x04B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInteractor*                            _interactor;                                       // 0x04B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxPlayerOverlapComponent*             _interactionVolume;                                // 0x04C0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UK29PowerChargePresentationItemProgressComponent* _powerChargePresentationItemProgressComponent; // 0x04C8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UK29PowerChargePresentationPowerFadeComponent* _powerChargePresentationPowerFadeComponent; // 0x04D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UK29PowerStatusHandlerComponent> _powerStatusHandlerComponentClass;            // 0x04D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UK29RushChargesHandlerComponent> _rushChargesHandlerComponentClass;            // 0x04E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UK29PathingCalculatorComponent> _pathingCalculatorComponentClass;              // 0x04E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UStatusEffect>              _blindnessProtectionStatusEffectClass;             // 0x04F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTunableStat                           _rushChargeTime;                                   // 0x04F8(0x0080)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FStatProperty                          _scorePercent;                                     // 0x0578(0x0088)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AAnimationFollowerActor>    _moriTentaclesAnimationFollowerActorClass;         // 0x0600(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_608[0x8];                                      // 0x0608(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UK29PowerStatusHandlerComponent*        _powerStatusHandlerComponent;                      // 0x0610(0x0008)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK29RushChargesHandlerComponent*        _rushChargesHandlerComponent;                      // 0x0618(0x0008)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK29PathingCalculatorComponent*         _pathingCalculatorComponent;                       // 0x0620(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_628[0x28];                                     // 0x0628(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnStun(const struct FGameplayTag& gameplayTag, const struct FGameEventData& gameEventData);
	class UK29RushCooldownInteraction* GetDropSurvivorCooldownInteraction();
	class UK29PowerStatusHandlerComponent* GetPowerStatusHandlerComponent();
	class UInteractionDefinition* GetPushSurvivorOverLedgeInteraction();
	class UK29RushCooldownInteraction* GetRushBreakableCooldownInteraction();
	class UK29RushChargeableInteraction* GetRushChargeableInteraction();
	class UK29RushCooldownInteraction* GetRushChargeCancelCooldownInteraction();
	class UK29RushChargesHandlerComponent* GetRushChargesHandlerComponent();
	class UK29RushCooldownInteraction* GetRushCompleteNoSurvivorCooldownInteraction();
	class UK29RushCooldownInteraction* GetRushCompleteSurvivorHitCooldownInteraction();
	class UK29RushCooldownInteraction* GetRushCompleteSurvivorThrowCooldownInteraction();
	class UStaticMeshComponent* GetRushSurvivorDetectionBox();
	class UK29RushCooldownInteraction* GetRushVaultCooldownInteraction();
	class UInteractionDefinition* GetSlashBreakableInteraction();
	class UInteractionDefinition* GetSlashSurvivorInteraction();

	float GetScorePercent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K29Power">();
	}
	static class AK29Power* GetDefaultObj()
	{
		return GetDefaultObjImpl<AK29Power>();
	}
};
static_assert(alignof(AK29Power) == 0x000008, "Wrong alignment on AK29Power");
static_assert(sizeof(AK29Power) == 0x000650, "Wrong size on AK29Power");
static_assert(offsetof(AK29Power, _rushChargeableComponent) == 0x0004B0, "Member 'AK29Power::_rushChargeableComponent' has a wrong offset!");
static_assert(offsetof(AK29Power, _interactor) == 0x0004B8, "Member 'AK29Power::_interactor' has a wrong offset!");
static_assert(offsetof(AK29Power, _interactionVolume) == 0x0004C0, "Member 'AK29Power::_interactionVolume' has a wrong offset!");
static_assert(offsetof(AK29Power, _powerChargePresentationItemProgressComponent) == 0x0004C8, "Member 'AK29Power::_powerChargePresentationItemProgressComponent' has a wrong offset!");
static_assert(offsetof(AK29Power, _powerChargePresentationPowerFadeComponent) == 0x0004D0, "Member 'AK29Power::_powerChargePresentationPowerFadeComponent' has a wrong offset!");
static_assert(offsetof(AK29Power, _powerStatusHandlerComponentClass) == 0x0004D8, "Member 'AK29Power::_powerStatusHandlerComponentClass' has a wrong offset!");
static_assert(offsetof(AK29Power, _rushChargesHandlerComponentClass) == 0x0004E0, "Member 'AK29Power::_rushChargesHandlerComponentClass' has a wrong offset!");
static_assert(offsetof(AK29Power, _pathingCalculatorComponentClass) == 0x0004E8, "Member 'AK29Power::_pathingCalculatorComponentClass' has a wrong offset!");
static_assert(offsetof(AK29Power, _blindnessProtectionStatusEffectClass) == 0x0004F0, "Member 'AK29Power::_blindnessProtectionStatusEffectClass' has a wrong offset!");
static_assert(offsetof(AK29Power, _rushChargeTime) == 0x0004F8, "Member 'AK29Power::_rushChargeTime' has a wrong offset!");
static_assert(offsetof(AK29Power, _scorePercent) == 0x000578, "Member 'AK29Power::_scorePercent' has a wrong offset!");
static_assert(offsetof(AK29Power, _moriTentaclesAnimationFollowerActorClass) == 0x000600, "Member 'AK29Power::_moriTentaclesAnimationFollowerActorClass' has a wrong offset!");
static_assert(offsetof(AK29Power, _powerStatusHandlerComponent) == 0x000610, "Member 'AK29Power::_powerStatusHandlerComponent' has a wrong offset!");
static_assert(offsetof(AK29Power, _rushChargesHandlerComponent) == 0x000618, "Member 'AK29Power::_rushChargesHandlerComponent' has a wrong offset!");
static_assert(offsetof(AK29Power, _pathingCalculatorComponent) == 0x000620, "Member 'AK29Power::_pathingCalculatorComponent' has a wrong offset!");

// Class TheK29.K29PowerChargePresentationItemProgressComponent
// 0x0018 (0x00D0 - 0x00B8)
class UK29PowerChargePresentationItemProgressComponent final : public UPresentationItemProgressComponent
{
public:
	class UK29PowerStatusHandlerComponent*        _statusHandlerComponent;                           // 0x00B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK29RushChargesHandlerComponent*        _rushChargesHandlerComponent;                      // 0x00C0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK29RushChargeableInteraction*          _rushInteraction;                                  // 0x00C8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K29PowerChargePresentationItemProgressComponent">();
	}
	static class UK29PowerChargePresentationItemProgressComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK29PowerChargePresentationItemProgressComponent>();
	}
};
static_assert(alignof(UK29PowerChargePresentationItemProgressComponent) == 0x000008, "Wrong alignment on UK29PowerChargePresentationItemProgressComponent");
static_assert(sizeof(UK29PowerChargePresentationItemProgressComponent) == 0x0000D0, "Wrong size on UK29PowerChargePresentationItemProgressComponent");
static_assert(offsetof(UK29PowerChargePresentationItemProgressComponent, _statusHandlerComponent) == 0x0000B8, "Member 'UK29PowerChargePresentationItemProgressComponent::_statusHandlerComponent' has a wrong offset!");
static_assert(offsetof(UK29PowerChargePresentationItemProgressComponent, _rushChargesHandlerComponent) == 0x0000C0, "Member 'UK29PowerChargePresentationItemProgressComponent::_rushChargesHandlerComponent' has a wrong offset!");
static_assert(offsetof(UK29PowerChargePresentationItemProgressComponent, _rushInteraction) == 0x0000C8, "Member 'UK29PowerChargePresentationItemProgressComponent::_rushInteraction' has a wrong offset!");

// Class TheK29.K29PowerChargePresentationPowerFadeComponent
// 0x0018 (0x00D0 - 0x00B8)
class UK29PowerChargePresentationPowerFadeComponent final : public UPresentationPowerFadeComponent
{
public:
	class UK29RushChargesHandlerComponent*        _rushChargesHandlerComponent;                      // 0x00B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C0[0x10];                                      // 0x00C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnKillerSet(class ASlasherPlayer* killer);
	void SetDependencies(class UK29RushChargesHandlerComponent* ammoHandler);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K29PowerChargePresentationPowerFadeComponent">();
	}
	static class UK29PowerChargePresentationPowerFadeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK29PowerChargePresentationPowerFadeComponent>();
	}
};
static_assert(alignof(UK29PowerChargePresentationPowerFadeComponent) == 0x000008, "Wrong alignment on UK29PowerChargePresentationPowerFadeComponent");
static_assert(sizeof(UK29PowerChargePresentationPowerFadeComponent) == 0x0000D0, "Wrong size on UK29PowerChargePresentationPowerFadeComponent");
static_assert(offsetof(UK29PowerChargePresentationPowerFadeComponent, _rushChargesHandlerComponent) == 0x0000B8, "Member 'UK29PowerChargePresentationPowerFadeComponent::_rushChargesHandlerComponent' has a wrong offset!");

// Class TheK29.K29PowerStatusHandlerComponent
// 0x0370 (0x0428 - 0x00B8)
class UK29PowerStatusHandlerComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x30];                                      // 0x00B8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _maxInfectionLevel;                                // 0x00E8(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTunableStat                           _infectionAddedPerTickWhileActive;                 // 0x0110(0x0080)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            _stabilizingHealAmountByUsage;                     // 0x0190(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTunableStat                           _initialInfectionLevel;                            // 0x0198(0x0080)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTunableStat                           _addedInfectionLevelsOnGrab;                       // 0x0218(0x0080)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTunableStat                           _infectionHealingMultiplier;                       // 0x0298(0x0080)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _infectionIncubationThreshold;                     // 0x0318(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTunableStat                           _useInfectionRemoverChargeTime;                    // 0x0340(0x0080)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UStatusEffect>              _hinderedStatusEffectClass;                        // 0x03C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UStatusEffect>              _gateBlockerStatusEffectClass;                     // 0x03C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UK29SurvivorThrowableComponent> _survivorThrowableClass;                       // 0x03D0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UChargeableInteractionDefinition> _useInfectionRemoverInteractionSelfClass;    // 0x03D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UChargeableInteractionDefinition> _useInfectionRemoverInteractionOtherClass;   // 0x03E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         _maxInfectionLevelWhenHooked;                      // 0x03E8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _recentlyGrabbedThresholdSeconds;                  // 0x03EC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FK29SurvivorStatus>             _survivorStatusList;                               // 0x03F0(0x0010)(Net, ZeroConstructor, RepNotify, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_400[0x28];                                     // 0x0400(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddToTimesCuredByHeal(const class ACamperPlayer* survivor);
	void Authority_AddInfectionLevels(const class ACamperPlayer* survivor, const int32 infectionToAdd);
	void Authority_HealAllSurvivorsInfectionWithStabilizingSpray();
	void Authority_HealInfectionLevels(const class ACamperPlayer* survivor, const int32 infectionLevelsToHeal, const bool shouldSetInfectionActiveToFalse);
	void Authority_OnIntroCompleted();
	void Authority_OnSlash(class ACamperPlayer* targetSurvivor);
	void Authority_OnSurvivorAdded(class ACamperPlayer* survivor);
	void Authority_OnSurvivorImmoblizedChanged();
	void Authority_SetAllSurvivorsToInitialInfection();
	void Authority_SetAllSurvivorsToMaxInfection();
	void Authority_UseStabilizingSpray(class ACamperPlayer* instigatingSurvivor, class ACamperPlayer* targetSurvivor);
	void Cosmetic_OnGrabbingInfectedSurvivor();
	void Cosmetic_OnGrabbingNonInfectedSurvivor();
	int32 GetInfectionLevel(const class ACamperPlayer* survivor);
	int32 GetMaxInfectionLevel();
	void Multicast_DropSurvivor(class ACamperPlayer* leftSurvivor);
	void Multicast_GrabSurvivor(class ACamperPlayer* survivor, const bool isProcessingInitialInfection);
	void Multicast_ReleaseSurvivor(class ACamperPlayer* survivor, bool isForced);
	void Multicast_RemoveSurvivorFromCloset(class ACamperPlayer* survivor);
	void Multicast_UseStabilizingSpray(class ACamperPlayer* targetSurvivor);
	void OnKillerSet(class ASlasherPlayer* killer);
	void OnRep_SurvivorStatusList(const TArray<struct FK29SurvivorStatus>& oldSurvivorStatus);
	void Server_GrabSurvivor(class ACamperPlayer* survivor, const bool isProcessingInitialInfection);
	void Server_ReleaseSurvivor(class ACamperPlayer* survivor, bool isForced);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K29PowerStatusHandlerComponent">();
	}
	static class UK29PowerStatusHandlerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK29PowerStatusHandlerComponent>();
	}
};
static_assert(alignof(UK29PowerStatusHandlerComponent) == 0x000008, "Wrong alignment on UK29PowerStatusHandlerComponent");
static_assert(sizeof(UK29PowerStatusHandlerComponent) == 0x000428, "Wrong size on UK29PowerStatusHandlerComponent");
static_assert(offsetof(UK29PowerStatusHandlerComponent, _maxInfectionLevel) == 0x0000E8, "Member 'UK29PowerStatusHandlerComponent::_maxInfectionLevel' has a wrong offset!");
static_assert(offsetof(UK29PowerStatusHandlerComponent, _infectionAddedPerTickWhileActive) == 0x000110, "Member 'UK29PowerStatusHandlerComponent::_infectionAddedPerTickWhileActive' has a wrong offset!");
static_assert(offsetof(UK29PowerStatusHandlerComponent, _stabilizingHealAmountByUsage) == 0x000190, "Member 'UK29PowerStatusHandlerComponent::_stabilizingHealAmountByUsage' has a wrong offset!");
static_assert(offsetof(UK29PowerStatusHandlerComponent, _initialInfectionLevel) == 0x000198, "Member 'UK29PowerStatusHandlerComponent::_initialInfectionLevel' has a wrong offset!");
static_assert(offsetof(UK29PowerStatusHandlerComponent, _addedInfectionLevelsOnGrab) == 0x000218, "Member 'UK29PowerStatusHandlerComponent::_addedInfectionLevelsOnGrab' has a wrong offset!");
static_assert(offsetof(UK29PowerStatusHandlerComponent, _infectionHealingMultiplier) == 0x000298, "Member 'UK29PowerStatusHandlerComponent::_infectionHealingMultiplier' has a wrong offset!");
static_assert(offsetof(UK29PowerStatusHandlerComponent, _infectionIncubationThreshold) == 0x000318, "Member 'UK29PowerStatusHandlerComponent::_infectionIncubationThreshold' has a wrong offset!");
static_assert(offsetof(UK29PowerStatusHandlerComponent, _useInfectionRemoverChargeTime) == 0x000340, "Member 'UK29PowerStatusHandlerComponent::_useInfectionRemoverChargeTime' has a wrong offset!");
static_assert(offsetof(UK29PowerStatusHandlerComponent, _hinderedStatusEffectClass) == 0x0003C0, "Member 'UK29PowerStatusHandlerComponent::_hinderedStatusEffectClass' has a wrong offset!");
static_assert(offsetof(UK29PowerStatusHandlerComponent, _gateBlockerStatusEffectClass) == 0x0003C8, "Member 'UK29PowerStatusHandlerComponent::_gateBlockerStatusEffectClass' has a wrong offset!");
static_assert(offsetof(UK29PowerStatusHandlerComponent, _survivorThrowableClass) == 0x0003D0, "Member 'UK29PowerStatusHandlerComponent::_survivorThrowableClass' has a wrong offset!");
static_assert(offsetof(UK29PowerStatusHandlerComponent, _useInfectionRemoverInteractionSelfClass) == 0x0003D8, "Member 'UK29PowerStatusHandlerComponent::_useInfectionRemoverInteractionSelfClass' has a wrong offset!");
static_assert(offsetof(UK29PowerStatusHandlerComponent, _useInfectionRemoverInteractionOtherClass) == 0x0003E0, "Member 'UK29PowerStatusHandlerComponent::_useInfectionRemoverInteractionOtherClass' has a wrong offset!");
static_assert(offsetof(UK29PowerStatusHandlerComponent, _maxInfectionLevelWhenHooked) == 0x0003E8, "Member 'UK29PowerStatusHandlerComponent::_maxInfectionLevelWhenHooked' has a wrong offset!");
static_assert(offsetof(UK29PowerStatusHandlerComponent, _recentlyGrabbedThresholdSeconds) == 0x0003EC, "Member 'UK29PowerStatusHandlerComponent::_recentlyGrabbedThresholdSeconds' has a wrong offset!");
static_assert(offsetof(UK29PowerStatusHandlerComponent, _survivorStatusList) == 0x0003F0, "Member 'UK29PowerStatusHandlerComponent::_survivorStatusList' has a wrong offset!");

// Class TheK29.K29RushChargeableInteraction
// 0x0800 (0x0F40 - 0x0740)
class UK29RushChargeableInteraction final : public UChargeableInteractionDefinition
{
public:
	uint8                                         Pad_740[0x10];                                     // 0x0740(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UK29RushChargesHandlerComponent*        _rushChargesHandlerComponent;                      // 0x0750(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UK29PowerStatusHandlerComponent*        _powerStatusHandlerComponent;                      // 0x0758(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UK29PathingCalculatorComponent*         _pathingCalculatorComponent;                       // 0x0760(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AK29Power*                              _powerCollectable;                                 // 0x0768(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<EK29RushPhase, struct FK29RushMovementSpeedSetting> _movementSpeedSettingsByState;          // 0x0770(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UCurveFloat*                            _subsequentRushTimerTimeoutMovementSpeedMultiplierCurve; // 0x07C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTunableStat                           _subsequentRushTimerTimeoutMovementSpeedReductionDuration; // 0x07C8(0x0080)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTunableStat                           _subsequentRushOpportunityTimerDuration;           // 0x0848(0x0080)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTunableStat                           _rushDuration;                                     // 0x08C8(0x0080)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTunableStat                           _rushDurationAfterFirst;                           // 0x0948(0x0080)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _capsuleRadius;                                    // 0x09C8(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _survivorRevealTimeOnInstantPickup;                // 0x09F0(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _capsuleHeight;                                    // 0x0A18(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _capsuleHeightOffset;                              // 0x0A40(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _bounceDuration;                                   // 0x0A68(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _rushAccelerationMultiplier;                       // 0x0A90(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _instantCarryAnimationDuration;                    // 0x0AB8(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _percentageForRushChargeEndAvailability;           // 0x0AE0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _distanceInCmForNearMiss;                          // 0x0AE4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _rushDetectionBackwardsOffset;                     // 0x0AE8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AEC[0x4];                                      // 0x0AEC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _revealToSurvivorsStatusEffect;                    // 0x0AF0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _rushMovementSpeedInCmPerSecond;                   // 0x0AF8(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _rushGrabMovementSpeedInCmPerSecond;               // 0x0B20(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTunableStat                           _grabRushDuration;                                 // 0x0B48(0x0080)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _rotationStrengthTransitionTime;                   // 0x0BC8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BCC[0x4];                                      // 0x0BCC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _minimumRushDistance;                              // 0x0BD0(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _intoGrabbingTime;                                 // 0x0BF8(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _smashOutTimerDuration;                            // 0x0C20(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _isStoppingMomentumAtIntoGrabbing;                 // 0x0C48(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            _movementSpeedCurveBetweenRushesIncreased;         // 0x0C70(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            _movementSpeedCurveChargingIncreased;              // 0x0C78(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            _rushMovementSpeedCurve;                           // 0x0C80(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            _rushMovementSpeedCurveWithSurvivor;               // 0x0C88(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _killerRushSmashAnimationName;                     // 0x0C90(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _survivorRushSmashAnimationName;                   // 0x0C9C(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _killerRushToCarryAnimationName;                   // 0x0CA8(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _survivorRushToCarryAnimationName;                 // 0x0CB4(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _survivorRushDropAnimationName;                    // 0x0CC0(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _killerRushCooldownAnimationName;                  // 0x0CCC(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _animTagFPV;                                       // 0x0CD8(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
