#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheK25

#include "Basic.hpp"

#include "DeadByDaylight_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TheK25_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Projectile_structs.hpp"


namespace SDK::Params
{

// Function TheK25.LamentConfiguration.Authority_OnEndGameOver
// 0x0038 (0x0038 - 0x0000)
struct LamentConfiguration_Authority_OnEndGameOver final
{
public:
	struct FGameplayTag                           gameEventType;                                     // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         gameEventData;                                     // 0x0010(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_Authority_OnEndGameOver) == 0x000008, "Wrong alignment on LamentConfiguration_Authority_OnEndGameOver");
static_assert(sizeof(LamentConfiguration_Authority_OnEndGameOver) == 0x000038, "Wrong size on LamentConfiguration_Authority_OnEndGameOver");
static_assert(offsetof(LamentConfiguration_Authority_OnEndGameOver, gameEventType) == 0x000000, "Member 'LamentConfiguration_Authority_OnEndGameOver::gameEventType' has a wrong offset!");
static_assert(offsetof(LamentConfiguration_Authority_OnEndGameOver, gameEventData) == 0x000010, "Member 'LamentConfiguration_Authority_OnEndGameOver::gameEventData' has a wrong offset!");

// Function TheK25.LamentConfiguration.Authority_OnGameEnded
// 0x0038 (0x0038 - 0x0000)
struct LamentConfiguration_Authority_OnGameEnded final
{
public:
	struct FGameplayTag                           gameEventType;                                     // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         gameEventData;                                     // 0x0010(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_Authority_OnGameEnded) == 0x000008, "Wrong alignment on LamentConfiguration_Authority_OnGameEnded");
static_assert(sizeof(LamentConfiguration_Authority_OnGameEnded) == 0x000038, "Wrong size on LamentConfiguration_Authority_OnGameEnded");
static_assert(offsetof(LamentConfiguration_Authority_OnGameEnded, gameEventType) == 0x000000, "Member 'LamentConfiguration_Authority_OnGameEnded::gameEventType' has a wrong offset!");
static_assert(offsetof(LamentConfiguration_Authority_OnGameEnded, gameEventData) == 0x000010, "Member 'LamentConfiguration_Authority_OnGameEnded::gameEventData' has a wrong offset!");

// Function TheK25.LamentConfiguration.Authority_OnOverlapBegin
// 0x00B0 (0x00B0 - 0x0000)
struct LamentConfiguration_Authority_OnOverlapBegin final
{
public:
	class UPrimitiveComponent*                    overlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 other;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    otherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         otherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             sweepResult;                                       // 0x0020(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_Authority_OnOverlapBegin) == 0x000008, "Wrong alignment on LamentConfiguration_Authority_OnOverlapBegin");
static_assert(sizeof(LamentConfiguration_Authority_OnOverlapBegin) == 0x0000B0, "Wrong size on LamentConfiguration_Authority_OnOverlapBegin");
static_assert(offsetof(LamentConfiguration_Authority_OnOverlapBegin, overlappedComponent) == 0x000000, "Member 'LamentConfiguration_Authority_OnOverlapBegin::overlappedComponent' has a wrong offset!");
static_assert(offsetof(LamentConfiguration_Authority_OnOverlapBegin, other) == 0x000008, "Member 'LamentConfiguration_Authority_OnOverlapBegin::other' has a wrong offset!");
static_assert(offsetof(LamentConfiguration_Authority_OnOverlapBegin, otherComp) == 0x000010, "Member 'LamentConfiguration_Authority_OnOverlapBegin::otherComp' has a wrong offset!");
static_assert(offsetof(LamentConfiguration_Authority_OnOverlapBegin, otherBodyIndex) == 0x000018, "Member 'LamentConfiguration_Authority_OnOverlapBegin::otherBodyIndex' has a wrong offset!");
static_assert(offsetof(LamentConfiguration_Authority_OnOverlapBegin, bFromSweep) == 0x00001C, "Member 'LamentConfiguration_Authority_OnOverlapBegin::bFromSweep' has a wrong offset!");
static_assert(offsetof(LamentConfiguration_Authority_OnOverlapBegin, sweepResult) == 0x000020, "Member 'LamentConfiguration_Authority_OnOverlapBegin::sweepResult' has a wrong offset!");

// Function TheK25.LamentConfiguration.Authority_OnOverlapEnd
// 0x0020 (0x0020 - 0x0000)
struct LamentConfiguration_Authority_OnOverlapEnd final
{
public:
	class UPrimitiveComponent*                    overlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 otherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    otherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         otherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LamentConfiguration_Authority_OnOverlapEnd) == 0x000008, "Wrong alignment on LamentConfiguration_Authority_OnOverlapEnd");
static_assert(sizeof(LamentConfiguration_Authority_OnOverlapEnd) == 0x000020, "Wrong size on LamentConfiguration_Authority_OnOverlapEnd");
static_assert(offsetof(LamentConfiguration_Authority_OnOverlapEnd, overlappedComponent) == 0x000000, "Member 'LamentConfiguration_Authority_OnOverlapEnd::overlappedComponent' has a wrong offset!");
static_assert(offsetof(LamentConfiguration_Authority_OnOverlapEnd, otherActor) == 0x000008, "Member 'LamentConfiguration_Authority_OnOverlapEnd::otherActor' has a wrong offset!");
static_assert(offsetof(LamentConfiguration_Authority_OnOverlapEnd, otherComp) == 0x000010, "Member 'LamentConfiguration_Authority_OnOverlapEnd::otherComp' has a wrong offset!");
static_assert(offsetof(LamentConfiguration_Authority_OnOverlapEnd, otherBodyIndex) == 0x000018, "Member 'LamentConfiguration_Authority_OnOverlapEnd::otherBodyIndex' has a wrong offset!");

// Function TheK25.LamentConfiguration.Authority_OnSurvivorHitByControlledProjectile
// 0x0038 (0x0038 - 0x0000)
struct LamentConfiguration_Authority_OnSurvivorHitByControlledProjectile final
{
public:
	struct FGameplayTag                           gameEventType;                                     // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         gameEventData;                                     // 0x0010(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_Authority_OnSurvivorHitByControlledProjectile) == 0x000008, "Wrong alignment on LamentConfiguration_Authority_OnSurvivorHitByControlledProjectile");
static_assert(sizeof(LamentConfiguration_Authority_OnSurvivorHitByControlledProjectile) == 0x000038, "Wrong size on LamentConfiguration_Authority_OnSurvivorHitByControlledProjectile");
static_assert(offsetof(LamentConfiguration_Authority_OnSurvivorHitByControlledProjectile, gameEventType) == 0x000000, "Member 'LamentConfiguration_Authority_OnSurvivorHitByControlledProjectile::gameEventType' has a wrong offset!");
static_assert(offsetof(LamentConfiguration_Authority_OnSurvivorHitByControlledProjectile, gameEventData) == 0x000010, "Member 'LamentConfiguration_Authority_OnSurvivorHitByControlledProjectile::gameEventData' has a wrong offset!");

// Function TheK25.LamentConfiguration.Authority_RespawnLamentConfiguration
// 0x0001 (0x0001 - 0x0000)
struct LamentConfiguration_Authority_RespawnLamentConfiguration final
{
public:
	bool                                          triggerChainHuntUponSpawning;                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_Authority_RespawnLamentConfiguration) == 0x000001, "Wrong alignment on LamentConfiguration_Authority_RespawnLamentConfiguration");
static_assert(sizeof(LamentConfiguration_Authority_RespawnLamentConfiguration) == 0x000001, "Wrong size on LamentConfiguration_Authority_RespawnLamentConfiguration");
static_assert(offsetof(LamentConfiguration_Authority_RespawnLamentConfiguration, triggerChainHuntUponSpawning) == 0x000000, "Member 'LamentConfiguration_Authority_RespawnLamentConfiguration::triggerChainHuntUponSpawning' has a wrong offset!");

// Function TheK25.LamentConfiguration.Cosmetic_EndSolvingCubeSFX
// 0x0001 (0x0001 - 0x0000)
struct LamentConfiguration_Cosmetic_EndSolvingCubeSFX final
{
public:
	bool                                          hasBeenSolved;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_Cosmetic_EndSolvingCubeSFX) == 0x000001, "Wrong alignment on LamentConfiguration_Cosmetic_EndSolvingCubeSFX");
static_assert(sizeof(LamentConfiguration_Cosmetic_EndSolvingCubeSFX) == 0x000001, "Wrong size on LamentConfiguration_Cosmetic_EndSolvingCubeSFX");
static_assert(offsetof(LamentConfiguration_Cosmetic_EndSolvingCubeSFX, hasBeenSolved) == 0x000000, "Member 'LamentConfiguration_Cosmetic_EndSolvingCubeSFX::hasBeenSolved' has a wrong offset!");

// Function TheK25.LamentConfiguration.Cosmetic_OnChainHuntChargeStart
// 0x0004 (0x0004 - 0x0000)
struct LamentConfiguration_Cosmetic_OnChainHuntChargeStart final
{
public:
	float                                         chargeTime;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_Cosmetic_OnChainHuntChargeStart) == 0x000004, "Wrong alignment on LamentConfiguration_Cosmetic_OnChainHuntChargeStart");
static_assert(sizeof(LamentConfiguration_Cosmetic_OnChainHuntChargeStart) == 0x000004, "Wrong size on LamentConfiguration_Cosmetic_OnChainHuntChargeStart");
static_assert(offsetof(LamentConfiguration_Cosmetic_OnChainHuntChargeStart, chargeTime) == 0x000000, "Member 'LamentConfiguration_Cosmetic_OnChainHuntChargeStart::chargeTime' has a wrong offset!");

// Function TheK25.LamentConfiguration.Cosmetic_OnHoldingSurvivorHostageEnd
// 0x0001 (0x0001 - 0x0000)
struct LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageEnd final
{
public:
	bool                                          hasEndedThroughKillerAttack;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageEnd) == 0x000001, "Wrong alignment on LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageEnd");
static_assert(sizeof(LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageEnd) == 0x000001, "Wrong size on LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageEnd");
static_assert(offsetof(LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageEnd, hasEndedThroughKillerAttack) == 0x000000, "Member 'LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageEnd::hasEndedThroughKillerAttack' has a wrong offset!");

// Function TheK25.LamentConfiguration.Cosmetic_OnHoldingSurvivorHostageStart
// 0x0004 (0x0004 - 0x0000)
struct LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageStart final
{
public:
	float                                         hostageDuration;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageStart) == 0x000004, "Wrong alignment on LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageStart");
static_assert(sizeof(LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageStart) == 0x000004, "Wrong size on LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageStart");
static_assert(offsetof(LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageStart, hostageDuration) == 0x000000, "Member 'LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageStart::hostageDuration' has a wrong offset!");

// Function TheK25.LamentConfiguration.Cosmetic_OnKillerDownedSurvivorHoldingLamentConfiguration
// 0x0010 (0x0010 - 0x0000)
struct LamentConfiguration_Cosmetic_OnKillerDownedSurvivorHoldingLamentConfiguration final
{
public:
	class ASlasherPlayer*                         killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACamperPlayer*                          survivorDowned;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_Cosmetic_OnKillerDownedSurvivorHoldingLamentConfiguration) == 0x000008, "Wrong alignment on LamentConfiguration_Cosmetic_OnKillerDownedSurvivorHoldingLamentConfiguration");
static_assert(sizeof(LamentConfiguration_Cosmetic_OnKillerDownedSurvivorHoldingLamentConfiguration) == 0x000010, "Wrong size on LamentConfiguration_Cosmetic_OnKillerDownedSurvivorHoldingLamentConfiguration");
static_assert(offsetof(LamentConfiguration_Cosmetic_OnKillerDownedSurvivorHoldingLamentConfiguration, killer) == 0x000000, "Member 'LamentConfiguration_Cosmetic_OnKillerDownedSurvivorHoldingLamentConfiguration::killer' has a wrong offset!");
static_assert(offsetof(LamentConfiguration_Cosmetic_OnKillerDownedSurvivorHoldingLamentConfiguration, survivorDowned) == 0x000008, "Member 'LamentConfiguration_Cosmetic_OnKillerDownedSurvivorHoldingLamentConfiguration::survivorDowned' has a wrong offset!");

// Function TheK25.LamentConfiguration.Multicast_CorrectLamentConfigurationPosition
// 0x000C (0x000C - 0x0000)
struct LamentConfiguration_Multicast_CorrectLamentConfigurationPosition final
{
public:
	struct FVector                                newPosition;                                       // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_Multicast_CorrectLamentConfigurationPosition) == 0x000004, "Wrong alignment on LamentConfiguration_Multicast_CorrectLamentConfigurationPosition");
static_assert(sizeof(LamentConfiguration_Multicast_CorrectLamentConfigurationPosition) == 0x00000C, "Wrong size on LamentConfiguration_Multicast_CorrectLamentConfigurationPosition");
static_assert(offsetof(LamentConfiguration_Multicast_CorrectLamentConfigurationPosition, newPosition) == 0x000000, "Member 'LamentConfiguration_Multicast_CorrectLamentConfigurationPosition::newPosition' has a wrong offset!");

// Function TheK25.LamentConfiguration.Multicast_DownedSurvivorHoldingLamentConfiguration
// 0x0008 (0x0008 - 0x0000)
struct LamentConfiguration_Multicast_DownedSurvivorHoldingLamentConfiguration final
{
public:
	class ACamperPlayer*                          survivor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_Multicast_DownedSurvivorHoldingLamentConfiguration) == 0x000008, "Wrong alignment on LamentConfiguration_Multicast_DownedSurvivorHoldingLamentConfiguration");
static_assert(sizeof(LamentConfiguration_Multicast_DownedSurvivorHoldingLamentConfiguration) == 0x000008, "Wrong size on LamentConfiguration_Multicast_DownedSurvivorHoldingLamentConfiguration");
static_assert(offsetof(LamentConfiguration_Multicast_DownedSurvivorHoldingLamentConfiguration, survivor) == 0x000000, "Member 'LamentConfiguration_Multicast_DownedSurvivorHoldingLamentConfiguration::survivor' has a wrong offset!");

// Function TheK25.LamentConfiguration.Multicast_TriggerKillerPickUpSFX
// 0x0010 (0x0010 - 0x0000)
struct LamentConfiguration_Multicast_TriggerKillerPickUpSFX final
{
public:
	TArray<class ACamperPlayer*>                  affectedSurvivors;                                 // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_Multicast_TriggerKillerPickUpSFX) == 0x000008, "Wrong alignment on LamentConfiguration_Multicast_TriggerKillerPickUpSFX");
static_assert(sizeof(LamentConfiguration_Multicast_TriggerKillerPickUpSFX) == 0x000010, "Wrong size on LamentConfiguration_Multicast_TriggerKillerPickUpSFX");
static_assert(offsetof(LamentConfiguration_Multicast_TriggerKillerPickUpSFX, affectedSurvivors) == 0x000000, "Member 'LamentConfiguration_Multicast_TriggerKillerPickUpSFX::affectedSurvivors' has a wrong offset!");

// Function TheK25.LamentConfiguration.OnCamperEscaped
// 0x0038 (0x0038 - 0x0000)
struct LamentConfiguration_OnCamperEscaped final
{
public:
	struct FGameplayTag                           gameEventType;                                     // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         gameEventData;                                     // 0x0010(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_OnCamperEscaped) == 0x000008, "Wrong alignment on LamentConfiguration_OnCamperEscaped");
static_assert(sizeof(LamentConfiguration_OnCamperEscaped) == 0x000038, "Wrong size on LamentConfiguration_OnCamperEscaped");
static_assert(offsetof(LamentConfiguration_OnCamperEscaped, gameEventType) == 0x000000, "Member 'LamentConfiguration_OnCamperEscaped::gameEventType' has a wrong offset!");
static_assert(offsetof(LamentConfiguration_OnCamperEscaped, gameEventData) == 0x000010, "Member 'LamentConfiguration_OnCamperEscaped::gameEventData' has a wrong offset!");

// Function TheK25.LamentConfiguration.OnRep_SurvivorHeldHostage
// 0x0008 (0x0008 - 0x0000)
struct LamentConfiguration_OnRep_SurvivorHeldHostage final
{
public:
	class ACamperPlayer*                          oldSurvivorHeldHostage;                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_OnRep_SurvivorHeldHostage) == 0x000008, "Wrong alignment on LamentConfiguration_OnRep_SurvivorHeldHostage");
static_assert(sizeof(LamentConfiguration_OnRep_SurvivorHeldHostage) == 0x000008, "Wrong size on LamentConfiguration_OnRep_SurvivorHeldHostage");
static_assert(offsetof(LamentConfiguration_OnRep_SurvivorHeldHostage, oldSurvivorHeldHostage) == 0x000000, "Member 'LamentConfiguration_OnRep_SurvivorHeldHostage::oldSurvivorHeldHostage' has a wrong offset!");

// Function TheK25.LamentConfiguration.TriggerKillerPickUpSFX
// 0x0010 (0x0010 - 0x0000)
struct LamentConfiguration_TriggerKillerPickUpSFX final
{
public:
	TArray<class ACamperPlayer*>                  affectedSurvivors;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_TriggerKillerPickUpSFX) == 0x000008, "Wrong alignment on LamentConfiguration_TriggerKillerPickUpSFX");
static_assert(sizeof(LamentConfiguration_TriggerKillerPickUpSFX) == 0x000010, "Wrong size on LamentConfiguration_TriggerKillerPickUpSFX");
static_assert(offsetof(LamentConfiguration_TriggerKillerPickUpSFX, affectedSurvivors) == 0x000000, "Member 'LamentConfiguration_TriggerKillerPickUpSFX::affectedSurvivors' has a wrong offset!");

// Function TheK25.LamentConfiguration.GetChainHuntProgressPercentage
// 0x0004 (0x0004 - 0x0000)
struct LamentConfiguration_GetChainHuntProgressPercentage final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_GetChainHuntProgressPercentage) == 0x000004, "Wrong alignment on LamentConfiguration_GetChainHuntProgressPercentage");
static_assert(sizeof(LamentConfiguration_GetChainHuntProgressPercentage) == 0x000004, "Wrong size on LamentConfiguration_GetChainHuntProgressPercentage");
static_assert(offsetof(LamentConfiguration_GetChainHuntProgressPercentage, ReturnValue) == 0x000000, "Member 'LamentConfiguration_GetChainHuntProgressPercentage::ReturnValue' has a wrong offset!");

// Function TheK25.ChainAttachedGateBlockerEffect.OnSurvivorDamageStateChanged
// 0x0002 (0x0002 - 0x0000)
struct ChainAttachedGateBlockerEffect_OnSurvivorDamageStateChanged final
{
public:
	ECamperDamageState                            oldState;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECamperDamageState                            newState;                                          // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChainAttachedGateBlockerEffect_OnSurvivorDamageStateChanged) == 0x000001, "Wrong alignment on ChainAttachedGateBlockerEffect_OnSurvivorDamageStateChanged");
static_assert(sizeof(ChainAttachedGateBlockerEffect_OnSurvivorDamageStateChanged) == 0x000002, "Wrong size on ChainAttachedGateBlockerEffect_OnSurvivorDamageStateChanged");
static_assert(offsetof(ChainAttachedGateBlockerEffect_OnSurvivorDamageStateChanged, oldState) == 0x000000, "Member 'ChainAttachedGateBlockerEffect_OnSurvivorDamageStateChanged::oldState' has a wrong offset!");
static_assert(offsetof(ChainAttachedGateBlockerEffect_OnSurvivorDamageStateChanged, newState) == 0x000001, "Member 'ChainAttachedGateBlockerEffect_OnSurvivorDamageStateChanged::newState' has a wrong offset!");

// Function TheK25.K25AttackSubAnimInstance.OnAttackStart
// 0x0001 (0x0001 - 0x0000)
struct K25AttackSubAnimInstance_OnAttackStart final
{
public:
	EAttackType                                   attackType;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25AttackSubAnimInstance_OnAttackStart) == 0x000001, "Wrong alignment on K25AttackSubAnimInstance_OnAttackStart");
static_assert(sizeof(K25AttackSubAnimInstance_OnAttackStart) == 0x000001, "Wrong size on K25AttackSubAnimInstance_OnAttackStart");
static_assert(offsetof(K25AttackSubAnimInstance_OnAttackStart, attackType) == 0x000000, "Member 'K25AttackSubAnimInstance_OnAttackStart::attackType' has a wrong offset!");

// Function TheK25.K25Chain.Cosmetic_OnChainAttachedToSurvivor
// 0x0001 (0x0001 - 0x0000)
struct K25Chain_Cosmetic_OnChainAttachedToSurvivor final
{
public:
	bool                                          wasReachingSurvivorAnchorPoint;                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Chain_Cosmetic_OnChainAttachedToSurvivor) == 0x000001, "Wrong alignment on K25Chain_Cosmetic_OnChainAttachedToSurvivor");
static_assert(sizeof(K25Chain_Cosmetic_OnChainAttachedToSurvivor) == 0x000001, "Wrong size on K25Chain_Cosmetic_OnChainAttachedToSurvivor");
static_assert(offsetof(K25Chain_Cosmetic_OnChainAttachedToSurvivor, wasReachingSurvivorAnchorPoint) == 0x000000, "Member 'K25Chain_Cosmetic_OnChainAttachedToSurvivor::wasReachingSurvivorAnchorPoint' has a wrong offset!");

// Function TheK25.K25Chain.Cosmetic_OnChainDetachedFromSurvivor
// 0x0001 (0x0001 - 0x0000)
struct K25Chain_Cosmetic_OnChainDetachedFromSurvivor final
{
public:
	EK25ChainDetachmentReason                     detachmentReason;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Chain_Cosmetic_OnChainDetachedFromSurvivor) == 0x000001, "Wrong alignment on K25Chain_Cosmetic_OnChainDetachedFromSurvivor");
static_assert(sizeof(K25Chain_Cosmetic_OnChainDetachedFromSurvivor) == 0x000001, "Wrong size on K25Chain_Cosmetic_OnChainDetachedFromSurvivor");
static_assert(offsetof(K25Chain_Cosmetic_OnChainDetachedFromSurvivor, detachmentReason) == 0x000000, "Member 'K25Chain_Cosmetic_OnChainDetachedFromSurvivor::detachmentReason' has a wrong offset!");

// Function TheK25.K25Chain.Cosmetic_OnSurvivorStoppedRemovingChainSFX
// 0x0001 (0x0001 - 0x0000)
struct K25Chain_Cosmetic_OnSurvivorStoppedRemovingChainSFX final
{
public:
	bool                                          hasRemovedChainDueToInteraction;                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Chain_Cosmetic_OnSurvivorStoppedRemovingChainSFX) == 0x000001, "Wrong alignment on K25Chain_Cosmetic_OnSurvivorStoppedRemovingChainSFX");
static_assert(sizeof(K25Chain_Cosmetic_OnSurvivorStoppedRemovingChainSFX) == 0x000001, "Wrong size on K25Chain_Cosmetic_OnSurvivorStoppedRemovingChainSFX");
static_assert(offsetof(K25Chain_Cosmetic_OnSurvivorStoppedRemovingChainSFX, hasRemovedChainDueToInteraction) == 0x000000, "Member 'K25Chain_Cosmetic_OnSurvivorStoppedRemovingChainSFX::hasRemovedChainDueToInteraction' has a wrong offset!");

// Function TheK25.K25Chain.SetInstancedMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct K25Chain_SetInstancedMeshComponent final
{
public:
	class UInstancedStaticMeshComponent*          instancedMesh;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Chain_SetInstancedMeshComponent) == 0x000008, "Wrong alignment on K25Chain_SetInstancedMeshComponent");
static_assert(sizeof(K25Chain_SetInstancedMeshComponent) == 0x000008, "Wrong size on K25Chain_SetInstancedMeshComponent");
static_assert(offsetof(K25Chain_SetInstancedMeshComponent, instancedMesh) == 0x000000, "Member 'K25Chain_SetInstancedMeshComponent::instancedMesh' has a wrong offset!");

// Function TheK25.K25Chain.SetSplineComponent
// 0x0008 (0x0008 - 0x0000)
struct K25Chain_SetSplineComponent final
{
public:
	class USplineComponent*                       component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Chain_SetSplineComponent) == 0x000008, "Wrong alignment on K25Chain_SetSplineComponent");
static_assert(sizeof(K25Chain_SetSplineComponent) == 0x000008, "Wrong size on K25Chain_SetSplineComponent");
static_assert(offsetof(K25Chain_SetSplineComponent, component) == 0x000000, "Member 'K25Chain_SetSplineComponent::component' has a wrong offset!");

// Function TheK25.K25Chain.GetChainEndLocation
// 0x000C (0x000C - 0x0000)
struct K25Chain_GetChainEndLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Chain_GetChainEndLocation) == 0x000004, "Wrong alignment on K25Chain_GetChainEndLocation");
static_assert(sizeof(K25Chain_GetChainEndLocation) == 0x00000C, "Wrong size on K25Chain_GetChainEndLocation");
static_assert(offsetof(K25Chain_GetChainEndLocation, ReturnValue) == 0x000000, "Member 'K25Chain_GetChainEndLocation::ReturnValue' has a wrong offset!");

// Function TheK25.K25Chain.GetChainStartLocation
// 0x000C (0x000C - 0x0000)
struct K25Chain_GetChainStartLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Chain_GetChainStartLocation) == 0x000004, "Wrong alignment on K25Chain_GetChainStartLocation");
static_assert(sizeof(K25Chain_GetChainStartLocation) == 0x00000C, "Wrong size on K25Chain_GetChainStartLocation");
static_assert(offsetof(K25Chain_GetChainStartLocation, ReturnValue) == 0x000000, "Member 'K25Chain_GetChainStartLocation::ReturnValue' has a wrong offset!");

// Function TheK25.K25Chain.GetSurvivorChainAttachmentAnchor
// 0x0008 (0x0008 - 0x0000)
struct K25Chain_GetSurvivorChainAttachmentAnchor final
{
public:
	class AK25SurvivorChainAttachmentAnchor*      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Chain_GetSurvivorChainAttachmentAnchor) == 0x000008, "Wrong alignment on K25Chain_GetSurvivorChainAttachmentAnchor");
static_assert(sizeof(K25Chain_GetSurvivorChainAttachmentAnchor) == 0x000008, "Wrong size on K25Chain_GetSurvivorChainAttachmentAnchor");
static_assert(offsetof(K25Chain_GetSurvivorChainAttachmentAnchor, ReturnValue) == 0x000000, "Member 'K25Chain_GetSurvivorChainAttachmentAnchor::ReturnValue' has a wrong offset!");

// Function TheK25.K25Chain.IsAttachedToControlledProjectile
// 0x0001 (0x0001 - 0x0000)
struct K25Chain_IsAttachedToControlledProjectile final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Chain_IsAttachedToControlledProjectile) == 0x000001, "Wrong alignment on K25Chain_IsAttachedToControlledProjectile");
static_assert(sizeof(K25Chain_IsAttachedToControlledProjectile) == 0x000001, "Wrong size on K25Chain_IsAttachedToControlledProjectile");
static_assert(offsetof(K25Chain_IsAttachedToControlledProjectile, ReturnValue) == 0x000000, "Member 'K25Chain_IsAttachedToControlledProjectile::ReturnValue' has a wrong offset!");

// Function TheK25.K25ChainAttachmentReplicationComponent.Multicast_AttachChainToAnchor
// 0x0018 (0x0018 - 0x0000)
struct K25ChainAttachmentReplicationComponent_Multicast_AttachChainToAnchor final
{
public:
	class UK25SurvivorChainAttachmentComponent*   chainAttachementComponent;                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AK25Chain*                              chainToAttach;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AK25SurvivorChainAttachmentAnchor*      anchorPoint;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25ChainAttachmentReplicationComponent_Multicast_AttachChainToAnchor) == 0x000008, "Wrong alignment on K25ChainAttachmentReplicationComponent_Multicast_AttachChainToAnchor");
static_assert(sizeof(K25ChainAttachmentReplicationComponent_Multicast_AttachChainToAnchor) == 0x000018, "Wrong size on K25ChainAttachmentReplicationComponent_Multicast_AttachChainToAnchor");
static_assert(offsetof(K25ChainAttachmentReplicationComponent_Multicast_AttachChainToAnchor, chainAttachementComponent) == 0x000000, "Member 'K25ChainAttachmentReplicationComponent_Multicast_AttachChainToAnchor::chainAttachementComponent' has a wrong offset!");
static_assert(offsetof(K25ChainAttachmentReplicationComponent_Multicast_AttachChainToAnchor, chainToAttach) == 0x000008, "Member 'K25ChainAttachmentReplicationComponent_Multicast_AttachChainToAnchor::chainToAttach' has a wrong offset!");
static_assert(offsetof(K25ChainAttachmentReplicationComponent_Multicast_AttachChainToAnchor, anchorPoint) == 0x000010, "Member 'K25ChainAttachmentReplicationComponent_Multicast_AttachChainToAnchor::anchorPoint' has a wrong offset!");

// Function TheK25.K25ChainAttachmentReplicationComponent.Multicast_DetachChains
// 0x0030 (0x0030 - 0x0000)
struct K25ChainAttachmentReplicationComponent_Multicast_DetachChains final
{
public:
	class UK25SurvivorChainAttachmentComponent*   chainAttachementComponent;                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AK25Chain*>                      chainsToDetach;                                    // 0x0008(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	EK25ChainDetachmentReason                     detachmentReason;                                  // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AK25Chain*>                      chainsAttached;                                    // 0x0020(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25ChainAttachmentReplicationComponent_Multicast_DetachChains) == 0x000008, "Wrong alignment on K25ChainAttachmentReplicationComponent_Multicast_DetachChains");
static_assert(sizeof(K25ChainAttachmentReplicationComponent_Multicast_DetachChains) == 0x000030, "Wrong size on K25ChainAttachmentReplicationComponent_Multicast_DetachChains");
static_assert(offsetof(K25ChainAttachmentReplicationComponent_Multicast_DetachChains, chainAttachementComponent) == 0x000000, "Member 'K25ChainAttachmentReplicationComponent_Multicast_DetachChains::chainAttachementComponent' has a wrong offset!");
static_assert(offsetof(K25ChainAttachmentReplicationComponent_Multicast_DetachChains, chainsToDetach) == 0x000008, "Member 'K25ChainAttachmentReplicationComponent_Multicast_DetachChains::chainsToDetach' has a wrong offset!");
static_assert(offsetof(K25ChainAttachmentReplicationComponent_Multicast_DetachChains, detachmentReason) == 0x000018, "Member 'K25ChainAttachmentReplicationComponent_Multicast_DetachChains::detachmentReason' has a wrong offset!");
static_assert(offsetof(K25ChainAttachmentReplicationComponent_Multicast_DetachChains, chainsAttached) == 0x000020, "Member 'K25ChainAttachmentReplicationComponent_Multicast_DetachChains::chainsAttached' has a wrong offset!");

// Function TheK25.K25ChainAttachmentReplicationComponent.Multicast_LaunchInstantHitChainTowardsSurvivor
// 0x0020 (0x0020 - 0x0000)
struct K25ChainAttachmentReplicationComponent_Multicast_LaunchInstantHitChainTowardsSurvivor final
{
public:
	class AK25Chain*                              newChainToAttach;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AK25SurvivorChainAttachmentAnchor*      targetAnchor;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                startPosition;                                     // 0x0010(0x000C)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K25ChainAttachmentReplicationComponent_Multicast_LaunchInstantHitChainTowardsSurvivor) == 0x000008, "Wrong alignment on K25ChainAttachmentReplicationComponent_Multicast_LaunchInstantHitChainTowardsSurvivor");
static_assert(sizeof(K25ChainAttachmentReplicationComponent_Multicast_LaunchInstantHitChainTowardsSurvivor) == 0x000020, "Wrong size on K25ChainAttachmentReplicationComponent_Multicast_LaunchInstantHitChainTowardsSurvivor");
static_assert(offsetof(K25ChainAttachmentReplicationComponent_Multicast_LaunchInstantHitChainTowardsSurvivor, newChainToAttach) == 0x000000, "Member 'K25ChainAttachmentReplicationComponent_Multicast_LaunchInstantHitChainTowardsSurvivor::newChainToAttach' has a wrong offset!");
static_assert(offsetof(K25ChainAttachmentReplicationComponent_Multicast_LaunchInstantHitChainTowardsSurvivor, targetAnchor) == 0x000008, "Member 'K25ChainAttachmentReplicationComponent_Multicast_LaunchInstantHitChainTowardsSurvivor::targetAnchor' has a wrong offset!");
static_assert(offsetof(K25ChainAttachmentReplicationComponent_Multicast_LaunchInstantHitChainTowardsSurvivor, startPosition) == 0x000010, "Member 'K25ChainAttachmentReplicationComponent_Multicast_LaunchInstantHitChainTowardsSurvivor::startPosition' has a wrong offset!");

// Function TheK25.K25ChainAttachmentReplicationComponent.Multicast_StartChainReelback
// 0x0008 (0x0008 - 0x0000)
struct K25ChainAttachmentReplicationComponent_Multicast_StartChainReelback final
{
public:
	class AK25Chain*                              chainToAttach;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25ChainAttachmentReplicationComponent_Multicast_StartChainReelback) == 0x000008, "Wrong alignment on K25ChainAttachmentReplicationComponent_Multicast_StartChainReelback");
static_assert(sizeof(K25ChainAttachmentReplicationComponent_Multicast_StartChainReelback) == 0x000008, "Wrong size on K25ChainAttachmentReplicationComponent_Multicast_StartChainReelback");
static_assert(offsetof(K25ChainAttachmentReplicationComponent_Multicast_StartChainReelback, chainToAttach) == 0x000000, "Member 'K25ChainAttachmentReplicationComponent_Multicast_StartChainReelback::chainToAttach' has a wrong offset!");

// Function TheK25.K25ChainHuntEffectsComponent.Cosmetic_ActivateChainHuntEffects
// 0x0001 (0x0001 - 0x0000)
struct K25ChainHuntEffectsComponent_Cosmetic_ActivateChainHuntEffects final
{
public:
	bool                                          hasChainHuntStarted;                               // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25ChainHuntEffectsComponent_Cosmetic_ActivateChainHuntEffects) == 0x000001, "Wrong alignment on K25ChainHuntEffectsComponent_Cosmetic_ActivateChainHuntEffects");
static_assert(sizeof(K25ChainHuntEffectsComponent_Cosmetic_ActivateChainHuntEffects) == 0x000001, "Wrong size on K25ChainHuntEffectsComponent_Cosmetic_ActivateChainHuntEffects");
static_assert(offsetof(K25ChainHuntEffectsComponent_Cosmetic_ActivateChainHuntEffects, hasChainHuntStarted) == 0x000000, "Member 'K25ChainHuntEffectsComponent_Cosmetic_ActivateChainHuntEffects::hasChainHuntStarted' has a wrong offset!");

// Function TheK25.K25ChainHuntEffectsComponent.GetOwningPlayer
// 0x0008 (0x0008 - 0x0000)
struct K25ChainHuntEffectsComponent_GetOwningPlayer final
{
public:
	class ADBDPlayer*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25ChainHuntEffectsComponent_GetOwningPlayer) == 0x000008, "Wrong alignment on K25ChainHuntEffectsComponent_GetOwningPlayer");
static_assert(sizeof(K25ChainHuntEffectsComponent_GetOwningPlayer) == 0x000008, "Wrong size on K25ChainHuntEffectsComponent_GetOwningPlayer");
static_assert(offsetof(K25ChainHuntEffectsComponent_GetOwningPlayer, ReturnValue) == 0x000000, "Member 'K25ChainHuntEffectsComponent_GetOwningPlayer::ReturnValue' has a wrong offset!");

// Function TheK25.K25ChainLocomotionSurvivorAnimInstance.OnChainAttached
// 0x0010 (0x0010 - 0x0000)
struct K25ChainLocomotionSurvivorAnimInstance_OnChainAttached final
{
public:
	class AK25Chain*                              chain;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AK25SurvivorChainAttachmentAnchor*      chainAttachmentAnchor;                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25ChainLocomotionSurvivorAnimInstance_OnChainAttached) == 0x000008, "Wrong alignment on K25ChainLocomotionSurvivorAnimInstance_OnChainAttached");
static_assert(sizeof(K25ChainLocomotionSurvivorAnimInstance_OnChainAttached) == 0x000010, "Wrong size on K25ChainLocomotionSurvivorAnimInstance_OnChainAttached");
static_assert(offsetof(K25ChainLocomotionSurvivorAnimInstance_OnChainAttached, chain) == 0x000000, "Member 'K25ChainLocomotionSurvivorAnimInstance_OnChainAttached::chain' has a wrong offset!");
static_assert(offsetof(K25ChainLocomotionSurvivorAnimInstance_OnChainAttached, chainAttachmentAnchor) == 0x000008, "Member 'K25ChainLocomotionSurvivorAnimInstance_OnChainAttached::chainAttachmentAnchor' has a wrong offset!");

// Function TheK25.K25ChainLocomotionSurvivorAnimInstance.OnChainDetached
// 0x0018 (0x0018 - 0x0000)
struct K25ChainLocomotionSurvivorAnimInstance_OnChainDetached final
{
public:
	class AK25Chain*                              chain;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AK25SurvivorChainAttachmentAnchor*      chainAttachmentAnchor;                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EK25ChainDetachmentReason                     detachmentReason;                                  // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K25ChainLocomotionSurvivorAnimInstance_OnChainDetached) == 0x000008, "Wrong alignment on K25ChainLocomotionSurvivorAnimInstance_OnChainDetached");
static_assert(sizeof(K25ChainLocomotionSurvivorAnimInstance_OnChainDetached) == 0x000018, "Wrong size on K25ChainLocomotionSurvivorAnimInstance_OnChainDetached");
static_assert(offsetof(K25ChainLocomotionSurvivorAnimInstance_OnChainDetached, chain) == 0x000000, "Member 'K25ChainLocomotionSurvivorAnimInstance_OnChainDetached::chain' has a wrong offset!");
static_assert(offsetof(K25ChainLocomotionSurvivorAnimInstance_OnChainDetached, chainAttachmentAnchor) == 0x000008, "Member 'K25ChainLocomotionSurvivorAnimInstance_OnChainDetached::chainAttachmentAnchor' has a wrong offset!");
static_assert(offsetof(K25ChainLocomotionSurvivorAnimInstance_OnChainDetached, detachmentReason) == 0x000010, "Member 'K25ChainLocomotionSurvivorAnimInstance_OnChainDetached::detachmentReason' has a wrong offset!");

// Function TheK25.K25ChainStrikeBaseState.GetK25Gateway
// 0x0008 (0x0008 - 0x0000)
struct K25ChainStrikeBaseState_GetK25Gateway final
{
public:
	class AK25Gateway*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25ChainStrikeBaseState_GetK25Gateway) == 0x000008, "Wrong alignment on K25ChainStrikeBaseState_GetK25Gateway");
static_assert(sizeof(K25ChainStrikeBaseState_GetK25Gateway) == 0x000008, "Wrong size on K25ChainStrikeBaseState_GetK25Gateway");
static_assert(offsetof(K25ChainStrikeBaseState_GetK25Gateway, ReturnValue) == 0x000000, "Member 'K25ChainStrikeBaseState_GetK25Gateway::ReturnValue' has a wrong offset!");

// Function TheK25.K25ChainStrikeBaseState.GetK25Power
// 0x0008 (0x0008 - 0x0000)
struct K25ChainStrikeBaseState_GetK25Power final
{
public:
	class AK25Power*                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25ChainStrikeBaseState_GetK25Power) == 0x000008, "Wrong alignment on K25ChainStrikeBaseState_GetK25Power");
static_assert(sizeof(K25ChainStrikeBaseState_GetK25Power) == 0x000008, "Wrong size on K25ChainStrikeBaseState_GetK25Power");
static_assert(offsetof(K25ChainStrikeBaseState_GetK25Power, ReturnValue) == 0x000000, "Member 'K25ChainStrikeBaseState_GetK25Power::ReturnValue' has a wrong offset!");

// Function TheK25.K25ChainStrikeBaseState.GetPlayerOwner
// 0x0008 (0x0008 - 0x0000)
struct K25ChainStrikeBaseState_GetPlayerOwner final
{
public:
	class ADBDPlayer*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25ChainStrikeBaseState_GetPlayerOwner) == 0x000008, "Wrong alignment on K25ChainStrikeBaseState_GetPlayerOwner");
static_assert(sizeof(K25ChainStrikeBaseState_GetPlayerOwner) == 0x000008, "Wrong size on K25ChainStrikeBaseState_GetPlayerOwner");
static_assert(offsetof(K25ChainStrikeBaseState_GetPlayerOwner, ReturnValue) == 0x000000, "Member 'K25ChainStrikeBaseState_GetPlayerOwner::ReturnValue' has a wrong offset!");

// Function TheK25.K25ChainStrikeInteraction.Cosmetic_ResetAllVignetteValues
// 0x0008 (0x0008 - 0x0000)
struct K25ChainStrikeInteraction_Cosmetic_ResetAllVignetteValues final
{
public:
	class ASlasherPlayer*                         killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25ChainStrikeInteraction_Cosmetic_ResetAllVignetteValues) == 0x000008, "Wrong alignment on K25ChainStrikeInteraction_Cosmetic_ResetAllVignetteValues");
static_assert(sizeof(K25ChainStrikeInteraction_Cosmetic_ResetAllVignetteValues) == 0x000008, "Wrong size on K25ChainStrikeInteraction_Cosmetic_ResetAllVignetteValues");
static_assert(offsetof(K25ChainStrikeInteraction_Cosmetic_ResetAllVignetteValues, killer) == 0x000000, "Member 'K25ChainStrikeInteraction_Cosmetic_ResetAllVignetteValues::killer' has a wrong offset!");

// Function TheK25.K25ChainStrikeInteraction.Cosmetic_TriggerGatewayPossessionEffects
// 0x0004 (0x0004 - 0x0000)
struct K25ChainStrikeInteraction_Cosmetic_TriggerGatewayPossessionEffects final
{
public:
	float                                         transitionTime;                                    // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25ChainStrikeInteraction_Cosmetic_TriggerGatewayPossessionEffects) == 0x000004, "Wrong alignment on K25ChainStrikeInteraction_Cosmetic_TriggerGatewayPossessionEffects");
static_assert(sizeof(K25ChainStrikeInteraction_Cosmetic_TriggerGatewayPossessionEffects) == 0x000004, "Wrong size on K25ChainStrikeInteraction_Cosmetic_TriggerGatewayPossessionEffects");
static_assert(offsetof(K25ChainStrikeInteraction_Cosmetic_TriggerGatewayPossessionEffects, transitionTime) == 0x000000, "Member 'K25ChainStrikeInteraction_Cosmetic_TriggerGatewayPossessionEffects::transitionTime' has a wrong offset!");

// Function TheK25.K25ChainStrikeInteraction.Cosmetic_TriggerKillerRepossessionFadeInEffects
// 0x0010 (0x0010 - 0x0000)
struct K25ChainStrikeInteraction_Cosmetic_TriggerKillerRepossessionFadeInEffects final
{
public:
	class ASlasherPlayer*                         killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          hasHitSurvivor;                                    // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          preventAudioTriggers;                              // 0x0009(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K25ChainStrikeInteraction_Cosmetic_TriggerKillerRepossessionFadeInEffects) == 0x000008, "Wrong alignment on K25ChainStrikeInteraction_Cosmetic_TriggerKillerRepossessionFadeInEffects");
static_assert(sizeof(K25ChainStrikeInteraction_Cosmetic_TriggerKillerRepossessionFadeInEffects) == 0x000010, "Wrong size on K25ChainStrikeInteraction_Cosmetic_TriggerKillerRepossessionFadeInEffects");
static_assert(offsetof(K25ChainStrikeInteraction_Cosmetic_TriggerKillerRepossessionFadeInEffects, killer) == 0x000000, "Member 'K25ChainStrikeInteraction_Cosmetic_TriggerKillerRepossessionFadeInEffects::killer' has a wrong offset!");
static_assert(offsetof(K25ChainStrikeInteraction_Cosmetic_TriggerKillerRepossessionFadeInEffects, hasHitSurvivor) == 0x000008, "Member 'K25ChainStrikeInteraction_Cosmetic_TriggerKillerRepossessionFadeInEffects::hasHitSurvivor' has a wrong offset!");
static_assert(offsetof(K25ChainStrikeInteraction_Cosmetic_TriggerKillerRepossessionFadeInEffects, preventAudioTriggers) == 0x000009, "Member 'K25ChainStrikeInteraction_Cosmetic_TriggerKillerRepossessionFadeInEffects::preventAudioTriggers' has a wrong offset!");

// Function TheK25.K25ChainStrikeInteraction.Cosmetic_TriggerKillerRepossessionFadeOutEffects
// 0x0010 (0x0010 - 0x0000)
struct K25ChainStrikeInteraction_Cosmetic_TriggerKillerRepossessionFadeOutEffects final
{
public:
	class ASlasherPlayer*                         killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          preventAudioTriggers;                              // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K25ChainStrikeInteraction_Cosmetic_TriggerKillerRepossessionFadeOutEffects) == 0x000008, "Wrong alignment on K25ChainStrikeInteraction_Cosmetic_TriggerKillerRepossessionFadeOutEffects");
static_assert(sizeof(K25ChainStrikeInteraction_Cosmetic_TriggerKillerRepossessionFadeOutEffects) == 0x000010, "Wrong size on K25ChainStrikeInteraction_Cosmetic_TriggerKillerRepossessionFadeOutEffects");
static_assert(offsetof(K25ChainStrikeInteraction_Cosmetic_TriggerKillerRepossessionFadeOutEffects, killer) == 0x000000, "Member 'K25ChainStrikeInteraction_Cosmetic_TriggerKillerRepossessionFadeOutEffects::killer' has a wrong offset!");
static_assert(offsetof(K25ChainStrikeInteraction_Cosmetic_TriggerKillerRepossessionFadeOutEffects, preventAudioTriggers) == 0x000008, "Member 'K25ChainStrikeInteraction_Cosmetic_TriggerKillerRepossessionFadeOutEffects::preventAudioTriggers' has a wrong offset!");

// Function TheK25.K25ChainStrikeInteraction.Multicast_AddStateTagToPlayer
// 0x000C (0x000C - 0x0000)
struct K25ChainStrikeInteraction_Multicast_AddStateTagToPlayer final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25ChainStrikeInteraction_Multicast_AddStateTagToPlayer) == 0x000004, "Wrong alignment on K25ChainStrikeInteraction_Multicast_AddStateTagToPlayer");
static_assert(sizeof(K25ChainStrikeInteraction_Multicast_AddStateTagToPlayer) == 0x00000C, "Wrong size on K25ChainStrikeInteraction_Multicast_AddStateTagToPlayer");
static_assert(offsetof(K25ChainStrikeInteraction_Multicast_AddStateTagToPlayer, tag) == 0x000000, "Member 'K25ChainStrikeInteraction_Multicast_AddStateTagToPlayer::tag' has a wrong offset!");

// Function TheK25.K25ChainStrikeInteraction.Multicast_RemoveStateTagFromPlayer
// 0x000C (0x000C - 0x0000)
struct K25ChainStrikeInteraction_Multicast_RemoveStateTagFromPlayer final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25ChainStrikeInteraction_Multicast_RemoveStateTagFromPlayer) == 0x000004, "Wrong alignment on K25ChainStrikeInteraction_Multicast_RemoveStateTagFromPlayer");
static_assert(sizeof(K25ChainStrikeInteraction_Multicast_RemoveStateTagFromPlayer) == 0x00000C, "Wrong size on K25ChainStrikeInteraction_Multicast_RemoveStateTagFromPlayer");
static_assert(offsetof(K25ChainStrikeInteraction_Multicast_RemoveStateTagFromPlayer, tag) == 0x000000, "Member 'K25ChainStrikeInteraction_Multicast_RemoveStateTagFromPlayer::tag' has a wrong offset!");

// Function TheK25.K25ChainStrikeInteraction.Multicast_SetFallbackEndReason
// 0x0001 (0x0001 - 0x0000)
struct K25ChainStrikeInteraction_Multicast_SetFallbackEndReason final
{
public:
	EChainStrikeEndReason                         chainStrikeEndReason;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25ChainStrikeInteraction_Multicast_SetFallbackEndReason) == 0x000001, "Wrong alignment on K25ChainStrikeInteraction_Multicast_SetFallbackEndReason");
static_assert(sizeof(K25ChainStrikeInteraction_Multicast_SetFallbackEndReason) == 0x000001, "Wrong size on K25ChainStrikeInteraction_Multicast_SetFallbackEndReason");
static_assert(offsetof(K25ChainStrikeInteraction_Multicast_SetFallbackEndReason, chainStrikeEndReason) == 0x000000, "Member 'K25ChainStrikeInteraction_Multicast_SetFallbackEndReason::chainStrikeEndReason' has a wrong offset!");

// Function TheK25.K25ChainStrikeInteraction.Server_AddStateTagToPlayer
// 0x000C (0x000C - 0x0000)
struct K25ChainStrikeInteraction_Server_AddStateTagToPlayer final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25ChainStrikeInteraction_Server_AddStateTagToPlayer) == 0x000004, "Wrong alignment on K25ChainStrikeInteraction_Server_AddStateTagToPlayer");
static_assert(sizeof(K25ChainStrikeInteraction_Server_AddStateTagToPlayer) == 0x00000C, "Wrong size on K25ChainStrikeInteraction_Server_AddStateTagToPlayer");
static_assert(offsetof(K25ChainStrikeInteraction_Server_AddStateTagToPlayer, tag) == 0x000000, "Member 'K25ChainStrikeInteraction_Server_AddStateTagToPlayer::tag' has a wrong offset!");

// Function TheK25.K25ChainStrikeInteraction.Server_RemoveStateTagFromPlayer
// 0x000C (0x000C - 0x0000)
struct K25ChainStrikeInteraction_Server_RemoveStateTagFromPlayer final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25ChainStrikeInteraction_Server_RemoveStateTagFromPlayer) == 0x000004, "Wrong alignment on K25ChainStrikeInteraction_Server_RemoveStateTagFromPlayer");
static_assert(sizeof(K25ChainStrikeInteraction_Server_RemoveStateTagFromPlayer) == 0x00000C, "Wrong size on K25ChainStrikeInteraction_Server_RemoveStateTagFromPlayer");
static_assert(offsetof(K25ChainStrikeInteraction_Server_RemoveStateTagFromPlayer, tag) == 0x000000, "Member 'K25ChainStrikeInteraction_Server_RemoveStateTagFromPlayer::tag' has a wrong offset!");

// Function TheK25.K25ChainStrikeInteraction.Server_SetFallbackEndReason
// 0x0001 (0x0001 - 0x0000)
struct K25ChainStrikeInteraction_Server_SetFallbackEndReason final
{
public:
	EChainStrikeEndReason                         chainStrikeEndReason;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
