#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheK28

#include "Basic.hpp"

#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "DBDCompetence_classes.hpp"
#include "Engine_classes.hpp"
#include "AnimationUtilities_structs.hpp"
#include "DBDBots_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DBDAnimation_classes.hpp"
#include "Competence_classes.hpp"
#include "TheK28_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "DataTableUtilities_structs.hpp"
#include "DBDInteraction_classes.hpp"
#include "StatSystem_structs.hpp"
#include "GameplayTagUtilities_structs.hpp"
#include "DBDCosmetic_classes.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK
{

// Class TheK28.Addon_K28Power_04
// 0x0000 (0x02B8 - 0x02B8)
class UAddon_K28Power_04 final : public UItemAddon
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K28Power_04">();
	}
	static class UAddon_K28Power_04* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K28Power_04>();
	}
};
static_assert(alignof(UAddon_K28Power_04) == 0x000008, "Wrong alignment on UAddon_K28Power_04");
static_assert(sizeof(UAddon_K28Power_04) == 0x0002B8, "Wrong size on UAddon_K28Power_04");

// Class TheK28.Addon_K28Power_15
// 0x0018 (0x02E0 - 0x02C8)
class UAddon_K28Power_15 final : public UOnEventBaseAddon
{
public:
	TArray<TSubclassOf<class UStatusEffect>>      _survivorImposedEffectClasses;                     // 0x02C8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	float                                         _statusEffectTime;                                 // 0x02D8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K28Power_15">();
	}
	static class UAddon_K28Power_15* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K28Power_15>();
	}
};
static_assert(alignof(UAddon_K28Power_15) == 0x000008, "Wrong alignment on UAddon_K28Power_15");
static_assert(sizeof(UAddon_K28Power_15) == 0x0002E0, "Wrong size on UAddon_K28Power_15");
static_assert(offsetof(UAddon_K28Power_15, _survivorImposedEffectClasses) == 0x0002C8, "Member 'UAddon_K28Power_15::_survivorImposedEffectClasses' has a wrong offset!");
static_assert(offsetof(UAddon_K28Power_15, _statusEffectTime) == 0x0002D8, "Member 'UAddon_K28Power_15::_statusEffectTime' has a wrong offset!");

// Class TheK28.Addon_K28Power_16
// 0x0000 (0x02C8 - 0x02C8)
class UAddon_K28Power_16 final : public UOnEventBaseAddon
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K28Power_16">();
	}
	static class UAddon_K28Power_16* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K28Power_16>();
	}
};
static_assert(alignof(UAddon_K28Power_16) == 0x000008, "Wrong alignment on UAddon_K28Power_16");
static_assert(sizeof(UAddon_K28Power_16) == 0x0002C8, "Wrong size on UAddon_K28Power_16");

// Class TheK28.Addon_K28Power_17
// 0x0010 (0x02D8 - 0x02C8)
class UAddon_K28Power_17 final : public UOnEventBaseAddon
{
public:
	TSubclassOf<class UStatusEffect>              _survivorImposedEffectClass;                       // 0x02C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _statusEffectDuration;                             // 0x02D0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnIntroComplete();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K28Power_17">();
	}
	static class UAddon_K28Power_17* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K28Power_17>();
	}
};
static_assert(alignof(UAddon_K28Power_17) == 0x000008, "Wrong alignment on UAddon_K28Power_17");
static_assert(sizeof(UAddon_K28Power_17) == 0x0002D8, "Wrong size on UAddon_K28Power_17");
static_assert(offsetof(UAddon_K28Power_17, _survivorImposedEffectClass) == 0x0002C8, "Member 'UAddon_K28Power_17::_survivorImposedEffectClass' has a wrong offset!");
static_assert(offsetof(UAddon_K28Power_17, _statusEffectDuration) == 0x0002D0, "Member 'UAddon_K28Power_17::_statusEffectDuration' has a wrong offset!");

// Class TheK28.Addon_K28Power_18
// 0x0038 (0x0300 - 0x02C8)
class UAddon_K28Power_18 final : public UOnEventBaseAddon
{
public:
	TSubclassOf<class UStatusEffect>              _survivorImposedEffectClass;                       // 0x02C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _survivorStatusEffectTime;                         // 0x02D0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _lockersToSlamRange;                               // 0x02D4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FAnimationMontageDescriptor            _montage;                                          // 0x02D8(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F8[0x8];                                      // 0x02F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Multicast_TriggerLockerAnimationOnAllLockers(const TArray<class ALocker*>& lockers);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K28Power_18">();
	}
	static class UAddon_K28Power_18* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K28Power_18>();
	}
};
static_assert(alignof(UAddon_K28Power_18) == 0x000008, "Wrong alignment on UAddon_K28Power_18");
static_assert(sizeof(UAddon_K28Power_18) == 0x000300, "Wrong size on UAddon_K28Power_18");
static_assert(offsetof(UAddon_K28Power_18, _survivorImposedEffectClass) == 0x0002C8, "Member 'UAddon_K28Power_18::_survivorImposedEffectClass' has a wrong offset!");
static_assert(offsetof(UAddon_K28Power_18, _survivorStatusEffectTime) == 0x0002D0, "Member 'UAddon_K28Power_18::_survivorStatusEffectTime' has a wrong offset!");
static_assert(offsetof(UAddon_K28Power_18, _lockersToSlamRange) == 0x0002D4, "Member 'UAddon_K28Power_18::_lockersToSlamRange' has a wrong offset!");
static_assert(offsetof(UAddon_K28Power_18, _montage) == 0x0002D8, "Member 'UAddon_K28Power_18::_montage' has a wrong offset!");

// Class TheK28.Addon_K28Power_19
// 0x0020 (0x02E8 - 0x02C8)
class UAddon_K28Power_19 final : public UOnEventBaseAddon
{
public:
	uint8                                         Pad_2C8[0x10];                                     // 0x02C8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _blockingRadius;                                   // 0x02D8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _blockDuration;                                    // 0x02DC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2E0[0x8];                                      // 0x02E0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K28Power_19">();
	}
	static class UAddon_K28Power_19* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K28Power_19>();
	}
};
static_assert(alignof(UAddon_K28Power_19) == 0x000008, "Wrong alignment on UAddon_K28Power_19");
static_assert(sizeof(UAddon_K28Power_19) == 0x0002E8, "Wrong size on UAddon_K28Power_19");
static_assert(offsetof(UAddon_K28Power_19, _blockingRadius) == 0x0002D8, "Member 'UAddon_K28Power_19::_blockingRadius' has a wrong offset!");
static_assert(offsetof(UAddon_K28Power_19, _blockDuration) == 0x0002DC, "Member 'UAddon_K28Power_19::_blockDuration' has a wrong offset!");

// Class TheK28.Addon_K28Power_20
// 0x0090 (0x0348 - 0x02B8)
class UAddon_K28Power_20 final : public UItemAddon
{
public:
	TSubclassOf<class UStatusEffect>              _survivorImposedEffectClass;                       // 0x02B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _effectDuration;                                   // 0x02C0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C4[0x84];                                     // 0x02C4(0x0084)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnLevelReadyToPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K28Power_20">();
	}
	static class UAddon_K28Power_20* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K28Power_20>();
	}
};
static_assert(alignof(UAddon_K28Power_20) == 0x000008, "Wrong alignment on UAddon_K28Power_20");
static_assert(sizeof(UAddon_K28Power_20) == 0x000348, "Wrong size on UAddon_K28Power_20");
static_assert(offsetof(UAddon_K28Power_20, _survivorImposedEffectClass) == 0x0002B8, "Member 'UAddon_K28Power_20::_survivorImposedEffectClass' has a wrong offset!");
static_assert(offsetof(UAddon_K28Power_20, _effectDuration) == 0x0002C0, "Member 'UAddon_K28Power_20::_effectDuration' has a wrong offset!");

// Class TheK28.AISkill_FindInteractable_Lockbar
// 0x0118 (0x0240 - 0x0128)
class UAISkill_FindInteractable_Lockbar final : public UAISkill_FindInteractable
{
public:
	float                                         LockerCenterHeightDiffFromActorLocation;           // 0x0128(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    LockbarMaxDistanceFromCamper;                      // 0x012C(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    LockbarMaxDistanceFromCamperTolerance;             // 0x013C(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    MinLockbarWeight;                                  // 0x014C(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    MaxLockbarWeight;                                  // 0x015C(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    HighLockbarWeightLastSeconds;                      // 0x016C(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    MinDistanceToReachMaxLockbarWeight;                // 0x017C(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    MaxDistanceToReachMinLockbarWeight;                // 0x018C(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_19C[0xA4];                                     // 0x019C(0x00A4)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_FindInteractable_Lockbar">();
	}
	static class UAISkill_FindInteractable_Lockbar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_FindInteractable_Lockbar>();
	}
};
static_assert(alignof(UAISkill_FindInteractable_Lockbar) == 0x000008, "Wrong alignment on UAISkill_FindInteractable_Lockbar");
static_assert(sizeof(UAISkill_FindInteractable_Lockbar) == 0x000240, "Wrong size on UAISkill_FindInteractable_Lockbar");
static_assert(offsetof(UAISkill_FindInteractable_Lockbar, LockerCenterHeightDiffFromActorLocation) == 0x000128, "Member 'UAISkill_FindInteractable_Lockbar::LockerCenterHeightDiffFromActorLocation' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_Lockbar, LockbarMaxDistanceFromCamper) == 0x00012C, "Member 'UAISkill_FindInteractable_Lockbar::LockbarMaxDistanceFromCamper' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_Lockbar, LockbarMaxDistanceFromCamperTolerance) == 0x00013C, "Member 'UAISkill_FindInteractable_Lockbar::LockbarMaxDistanceFromCamperTolerance' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_Lockbar, MinLockbarWeight) == 0x00014C, "Member 'UAISkill_FindInteractable_Lockbar::MinLockbarWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_Lockbar, MaxLockbarWeight) == 0x00015C, "Member 'UAISkill_FindInteractable_Lockbar::MaxLockbarWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_Lockbar, HighLockbarWeightLastSeconds) == 0x00016C, "Member 'UAISkill_FindInteractable_Lockbar::HighLockbarWeightLastSeconds' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_Lockbar, MinDistanceToReachMaxLockbarWeight) == 0x00017C, "Member 'UAISkill_FindInteractable_Lockbar::MinDistanceToReachMaxLockbarWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_Lockbar, MaxDistanceToReachMinLockbarWeight) == 0x00018C, "Member 'UAISkill_FindInteractable_Lockbar::MaxDistanceToReachMinLockbarWeight' has a wrong offset!");

// Class TheK28.BTService_FindObject_K28Remnant
// 0x0008 (0x00C8 - 0x00C0)
class UBTService_FindObject_K28Remnant final : public UBTService_FindObject
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTService_FindObject_K28Remnant">();
	}
	static class UBTService_FindObject_K28Remnant* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTService_FindObject_K28Remnant>();
	}
};
static_assert(alignof(UBTService_FindObject_K28Remnant) == 0x000008, "Wrong alignment on UBTService_FindObject_K28Remnant");
static_assert(sizeof(UBTService_FindObject_K28Remnant) == 0x0000C8, "Wrong size on UBTService_FindObject_K28Remnant");

// Class TheK28.K28TeleportTarget
// 0x0000 (0x0000 - 0x0000)
class IK28TeleportTarget final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28TeleportTarget">();
	}
	static class IK28TeleportTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<IK28TeleportTarget>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IK28TeleportTarget) == 0x000001, "Wrong alignment on IK28TeleportTarget");
static_assert(sizeof(IK28TeleportTarget) == 0x000001, "Wrong size on IK28TeleportTarget");

// Class TheK28.IsInRangeOfK28UsedLocker
// 0x0038 (0x0128 - 0x00F0)
class UIsInRangeOfK28UsedLocker final : public URangeBasedCondition
{
public:
	uint8                                         Pad_F0[0x38];                                      // 0x00F0(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IsInRangeOfK28UsedLocker">();
	}
	static class UIsInRangeOfK28UsedLocker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIsInRangeOfK28UsedLocker>();
	}
};
static_assert(alignof(UIsInRangeOfK28UsedLocker) == 0x000008, "Wrong alignment on UIsInRangeOfK28UsedLocker");
static_assert(sizeof(UIsInRangeOfK28UsedLocker) == 0x000128, "Wrong size on UIsInRangeOfK28UsedLocker");

// Class TheK28.K28AnimInstance
// 0x0040 (0x0640 - 0x0600)
class UK28AnimInstance final : public UKillerAnimInstance
{
public:
	bool                                          _isInLocker;                                       // 0x0600(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInChase;                                        // 0x0601(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isChargingTeleportation;                          // 0x0602(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _hasTeleportationPowerCharged;                     // 0x0603(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _hasTeleportationBeenCancelled;                    // 0x0604(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _hideHandsInFPV;                                   // 0x0605(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_606[0x2];                                      // 0x0606(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCustomizationAnimationSelector> _customizationAnimationSelectorClass;         // 0x0608(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCustomizationAnimationSelector*        _customizationAnimationSelector;                   // 0x0610(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_618[0x28];                                     // 0x0618(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnCustomizationAnimationMappingIDChanged(int32 animationMappingIndex);

	int32 GetAnimationMappingIndex() const;
	TArray<class FName> GetCustomAnimationTags() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28AnimInstance">();
	}
	static class UK28AnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28AnimInstance>();
	}
};
static_assert(alignof(UK28AnimInstance) == 0x000010, "Wrong alignment on UK28AnimInstance");
static_assert(sizeof(UK28AnimInstance) == 0x000640, "Wrong size on UK28AnimInstance");
static_assert(offsetof(UK28AnimInstance, _isInLocker) == 0x000600, "Member 'UK28AnimInstance::_isInLocker' has a wrong offset!");
static_assert(offsetof(UK28AnimInstance, _isInChase) == 0x000601, "Member 'UK28AnimInstance::_isInChase' has a wrong offset!");
static_assert(offsetof(UK28AnimInstance, _isChargingTeleportation) == 0x000602, "Member 'UK28AnimInstance::_isChargingTeleportation' has a wrong offset!");
static_assert(offsetof(UK28AnimInstance, _hasTeleportationPowerCharged) == 0x000603, "Member 'UK28AnimInstance::_hasTeleportationPowerCharged' has a wrong offset!");
static_assert(offsetof(UK28AnimInstance, _hasTeleportationBeenCancelled) == 0x000604, "Member 'UK28AnimInstance::_hasTeleportationBeenCancelled' has a wrong offset!");
static_assert(offsetof(UK28AnimInstance, _hideHandsInFPV) == 0x000605, "Member 'UK28AnimInstance::_hideHandsInFPV' has a wrong offset!");
static_assert(offsetof(UK28AnimInstance, _customizationAnimationSelectorClass) == 0x000608, "Member 'UK28AnimInstance::_customizationAnimationSelectorClass' has a wrong offset!");
static_assert(offsetof(UK28AnimInstance, _customizationAnimationSelector) == 0x000610, "Member 'UK28AnimInstance::_customizationAnimationSelector' has a wrong offset!");

// Class TheK28.K28CheatComponent
// 0x0000 (0x00B8 - 0x00B8)
class UK28CheatComponent final : public UActorComponent
{
public:
	void DBD_K28BreakAllLocks();
	void DBD_K28DebugCosmetics(bool noCooldown);
	void DBD_K28DisplayLockerClusters(float secondsToDisplayDebugElements);
	void DBD_K28LockAllLockbars();
	void DBD_K28SetPowerNoCooldown(bool noCooldown);
	void DBD_K28TriggerNextNightCycle();
	void DBD_K28UnlockAllLockbars();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28CheatComponent">();
	}
	static class UK28CheatComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28CheatComponent>();
	}
};
static_assert(alignof(UK28CheatComponent) == 0x000008, "Wrong alignment on UK28CheatComponent");
static_assert(sizeof(UK28CheatComponent) == 0x0000B8, "Wrong size on UK28CheatComponent");

// Class TheK28.K28DayNightComponent
// 0x0530 (0x05E8 - 0x00B8)
class UK28DayNightComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x48];                                      // 0x00B8(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UK28KillerComponent>        _killerK28ComponentClass;                          // 0x0100(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UK28SurvivorComponent>      _survivorK28ComponentClass;                        // 0x0108(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _chargesRequiredForNightCharge;                    // 0x0110(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _transitionToNightDuration;                        // 0x0138(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _transitiionToDayDuration;                         // 0x0160(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _chargesRequiredForNightDischarge;                 // 0x0188(0x0080)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _killerInjuresSurvivorChargeAmount;                // 0x0208(0x0080)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _killerHookSurvivorChargeAmount;                   // 0x0288(0x0080)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _killerTeleportsToRemnantChargeAmount;             // 0x0308(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _defaultNightChargeTime;                           // 0x0330(0x0080)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _injuredSurvivorsChargeTime;                       // 0x03B0(0x0080)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _killerHidingInLockerChargeTime;                   // 0x0430(0x0080)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _defaultNightTimeDischargeRate;                    // 0x04B0(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _survivorInLockerDischargeRate;                    // 0x04D8(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _nighttimeNearingActivationThresholdPercent;       // 0x0500(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _nightCycleNearingEndThresholdPercent;             // 0x0528(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EK28NightCycleState                           _currentNightCycleState;                           // 0x0550(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_551[0x1F];                                     // 0x0551(0x001F)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         _authority_numberInjuredSurvivors;                 // 0x0570(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _maxChargeAmount;                                  // 0x0574(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _currentChargeAmount;                              // 0x0578(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_57C[0x35];                                     // 0x057C(0x0035)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _nighttimeNearingActivationThresholdReached;       // 0x05B1(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _hasReachedNightCycleNearEndThreshold;             // 0x05B2(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5B3[0x35];                                     // 0x05B3(0x0035)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnIntroCompleted();
	void Authority_OnSurvivorDamageStateChanged(ECamperDamageState previousDamageState, ECamperDamageState newDamageState);
	void Cosmetic_OnIsInLastTwentySecondsOfNightCycle(class UAkComponent* akComponent);
	void Cosmetic_OnNightCycleChanged(class UAkComponent* akComponent, EK28NightCycleState newNightCycleState);
	void OnRep_CurrentDayNightCycle();
	void OnRep_HasReachedNightCycleNearEndThreshold();
	void OnRep_NighttimeNearingActivation();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28DayNightComponent">();
	}
	static class UK28DayNightComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28DayNightComponent>();
	}
};
static_assert(alignof(UK28DayNightComponent) == 0x000008, "Wrong alignment on UK28DayNightComponent");
static_assert(sizeof(UK28DayNightComponent) == 0x0005E8, "Wrong size on UK28DayNightComponent");
static_assert(offsetof(UK28DayNightComponent, _killerK28ComponentClass) == 0x000100, "Member 'UK28DayNightComponent::_killerK28ComponentClass' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _survivorK28ComponentClass) == 0x000108, "Member 'UK28DayNightComponent::_survivorK28ComponentClass' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _chargesRequiredForNightCharge) == 0x000110, "Member 'UK28DayNightComponent::_chargesRequiredForNightCharge' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _transitionToNightDuration) == 0x000138, "Member 'UK28DayNightComponent::_transitionToNightDuration' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _transitiionToDayDuration) == 0x000160, "Member 'UK28DayNightComponent::_transitiionToDayDuration' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _chargesRequiredForNightDischarge) == 0x000188, "Member 'UK28DayNightComponent::_chargesRequiredForNightDischarge' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _killerInjuresSurvivorChargeAmount) == 0x000208, "Member 'UK28DayNightComponent::_killerInjuresSurvivorChargeAmount' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _killerHookSurvivorChargeAmount) == 0x000288, "Member 'UK28DayNightComponent::_killerHookSurvivorChargeAmount' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _killerTeleportsToRemnantChargeAmount) == 0x000308, "Member 'UK28DayNightComponent::_killerTeleportsToRemnantChargeAmount' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _defaultNightChargeTime) == 0x000330, "Member 'UK28DayNightComponent::_defaultNightChargeTime' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _injuredSurvivorsChargeTime) == 0x0003B0, "Member 'UK28DayNightComponent::_injuredSurvivorsChargeTime' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _killerHidingInLockerChargeTime) == 0x000430, "Member 'UK28DayNightComponent::_killerHidingInLockerChargeTime' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _defaultNightTimeDischargeRate) == 0x0004B0, "Member 'UK28DayNightComponent::_defaultNightTimeDischargeRate' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _survivorInLockerDischargeRate) == 0x0004D8, "Member 'UK28DayNightComponent::_survivorInLockerDischargeRate' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _nighttimeNearingActivationThresholdPercent) == 0x000500, "Member 'UK28DayNightComponent::_nighttimeNearingActivationThresholdPercent' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _nightCycleNearingEndThresholdPercent) == 0x000528, "Member 'UK28DayNightComponent::_nightCycleNearingEndThresholdPercent' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _currentNightCycleState) == 0x000550, "Member 'UK28DayNightComponent::_currentNightCycleState' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _authority_numberInjuredSurvivors) == 0x000570, "Member 'UK28DayNightComponent::_authority_numberInjuredSurvivors' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _maxChargeAmount) == 0x000574, "Member 'UK28DayNightComponent::_maxChargeAmount' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _currentChargeAmount) == 0x000578, "Member 'UK28DayNightComponent::_currentChargeAmount' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _nighttimeNearingActivationThresholdReached) == 0x0005B1, "Member 'UK28DayNightComponent::_nighttimeNearingActivationThresholdReached' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _hasReachedNightCycleNearEndThreshold) == 0x0005B2, "Member 'UK28DayNightComponent::_hasReachedNightCycleNearEndThreshold' has a wrong offset!");

// Class TheK28.K28FXInterface
// 0x0000 (0x0000 - 0x0000)
class IK28FXInterface final
{
public:
	void Cosmetic_OnChargeTeleportCancelled();
	void Cosmetic_OnChargeTeleportComplete();
	void Cosmetic_OnChargeTeleportStart();
	void Cosmetic_OnHideKiller();
	void Cosmetic_OnIsKillingSurvivorWithMoriStateChanged(bool isKillingSurvivorWithMori);
	void Cosmetic_OnKillerEnterLocker();
	void Cosmetic_OnLocallyObservedChanged();
	void Cosmetic_OnLockerTeleportTargetHighlighted();
	void Cosmetic_OnShowKiller(bool isInstantShow);
	void Cosmetic_OnTeleportationToLockerEnd();
	void Cosmetic_OnTeleportationToLockerStart(float teleportationDuration, bool isKillerAlreadyHidingInLocker);
	void Cosmetic_OnTeleportCooldownEnded();
	void Cosmetic_SetBlackMaterialOnKiller(bool blackMaterialApplied);
	void Cosmetic_SetDebugCosmetics(bool isDebugCosmeticsActive);
	void Cosmetic_TriggerFadeIn();
	void Cosmetic_TriggerFadeOut();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28FXInterface">();
	}
	static class IK28FXInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IK28FXInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IK28FXInterface) == 0x000001, "Wrong alignment on IK28FXInterface");
static_assert(sizeof(IK28FXInterface) == 0x000001, "Wrong size on IK28FXInterface");

// Class TheK28.K28IsNightCycleState
// 0x0010 (0x00F8 - 0x00E8)
class UK28IsNightCycleState final : public UEventDrivenModifierCondition
{
public:
	EK28NightCycleState                           _nightCycleState;                                  // 0x00E8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E9[0xF];                                       // 0x00E9(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnLevelReadyToPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28IsNightCycleState">();
	}
	static class UK28IsNightCycleState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28IsNightCycleState>();
	}
};
static_assert(alignof(UK28IsNightCycleState) == 0x000008, "Wrong alignment on UK28IsNightCycleState");
static_assert(sizeof(UK28IsNightCycleState) == 0x0000F8, "Wrong size on UK28IsNightCycleState");
static_assert(offsetof(UK28IsNightCycleState, _nightCycleState) == 0x0000E8, "Member 'UK28IsNightCycleState::_nightCycleState' has a wrong offset!");

// Class TheK28.K28PlayerComponent
// 0x00B8 (0x0170 - 0x00B8)
class UK28PlayerComponent : public UActorComponent
{
public:
	TWeakObjectPtr<class UK28DayNightComponent>   _dayNightComponent;                                // 0x00B8(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _nightEffectMinimumDistance;                       // 0x00C0(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _nightEffectMaximumDistance;                       // 0x00E8(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_110[0x60];                                     // 0x0110(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_DayNightComponent();
	void OnSurvivorInRangeChanged(const bool inRange, class ACamperPlayer* player);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28PlayerComponent">();
	}
	static class UK28PlayerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28PlayerComponent>();
	}
};
static_assert(alignof(UK28PlayerComponent) == 0x000008, "Wrong alignment on UK28PlayerComponent");
static_assert(sizeof(UK28PlayerComponent) == 0x000170, "Wrong size on UK28PlayerComponent");
static_assert(offsetof(UK28PlayerComponent, _dayNightComponent) == 0x0000B8, "Member 'UK28PlayerComponent::_dayNightComponent' has a wrong offset!");
static_assert(offsetof(UK28PlayerComponent, _nightEffectMinimumDistance) == 0x0000C0, "Member 'UK28PlayerComponent::_nightEffectMinimumDistance' has a wrong offset!");
static_assert(offsetof(UK28PlayerComponent, _nightEffectMaximumDistance) == 0x0000E8, "Member 'UK28PlayerComponent::_nightEffectMaximumDistance' has a wrong offset!");

// Class TheK28.K28KillerComponent
// 0x0008 (0x0178 - 0x0170)
class UK28KillerComponent final : public UK28PlayerComponent
{
public:
	uint8                                         Pad_170[0x8];                                      // 0x0170(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_OnNightCycleStateChanged(class ASlasherPlayer* killer, EK28NightCycleState dayNightCycleState);
	void Cosmetic_OnNighttimeNearingActivation(class ASlasherPlayer* killer);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28KillerComponent">();
	}
	static class UK28KillerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28KillerComponent>();
	}
};
static_assert(alignof(UK28KillerComponent) == 0x000008, "Wrong alignment on UK28KillerComponent");
static_assert(sizeof(UK28KillerComponent) == 0x000178, "Wrong size on UK28KillerComponent");

// Class TheK28.K28KillerEnterLockerInteraction
// 0x0030 (0x0680 - 0x0650)
class UK28KillerEnterLockerInteraction final : public UBaseLockerInteraction
{
public:
	float                                         _hideKillerTimePercentage;                         // 0x0648(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_64C[0x34];                                     // 0x064C(0x0034)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsKillerAllowedToEnterLocker(const class ADBDPlayer* player) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28KillerEnterLockerInteraction">();
	}
	static class UK28KillerEnterLockerInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28KillerEnterLockerInteraction>();
	}
};
static_assert(alignof(UK28KillerEnterLockerInteraction) == 0x000010, "Wrong alignment on UK28KillerEnterLockerInteraction");
static_assert(sizeof(UK28KillerEnterLockerInteraction) == 0x000680, "Wrong size on UK28KillerEnterLockerInteraction");
static_assert(offsetof(UK28KillerEnterLockerInteraction, _hideKillerTimePercentage) == 0x000648, "Member 'UK28KillerEnterLockerInteraction::_hideKillerTimePercentage' has a wrong offset!");

// Class TheK28.K28KillerExitLockerInteraction
// 0x00B0 (0x0700 - 0x0650)
class UK28KillerExitLockerInteraction : public UBaseLockerInteraction
{
public:
	EK28ExitLockerCameraBehaviour                 _cameraBehaviour;                                  // 0x0648(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _timeSearchLockerInteractionBlocked;               // 0x0650(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _minDotProductFadeOutThreshold;                    // 0x0678(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _rotationMaxTime;                                  // 0x067C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _fadeOutTime;                                      // 0x0680(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _fovChangeTime;                                    // 0x0684(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _fovChangeTeleportationCurve;                      // 0x0688(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_690[0x70];                                     // 0x0690(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28KillerExitLockerInteraction">();
	}
	static class UK28KillerExitLockerInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28KillerExitLockerInteraction>();
	}
};
static_assert(alignof(UK28KillerExitLockerInteraction) == 0x000010, "Wrong alignment on UK28KillerExitLockerInteraction");
static_assert(sizeof(UK28KillerExitLockerInteraction) == 0x000700, "Wrong size on UK28KillerExitLockerInteraction");
static_assert(offsetof(UK28KillerExitLockerInteraction, _cameraBehaviour) == 0x000648, "Member 'UK28KillerExitLockerInteraction::_cameraBehaviour' has a wrong offset!");
static_assert(offsetof(UK28KillerExitLockerInteraction, _timeSearchLockerInteractionBlocked) == 0x000650, "Member 'UK28KillerExitLockerInteraction::_timeSearchLockerInteractionBlocked' has a wrong offset!");
static_assert(offsetof(UK28KillerExitLockerInteraction, _minDotProductFadeOutThreshold) == 0x000678, "Member 'UK28KillerExitLockerInteraction::_minDotProductFadeOutThreshold' has a wrong offset!");
static_assert(offsetof(UK28KillerExitLockerInteraction, _rotationMaxTime) == 0x00067C, "Member 'UK28KillerExitLockerInteraction::_rotationMaxTime' has a wrong offset!");
static_assert(offsetof(UK28KillerExitLockerInteraction, _fadeOutTime) == 0x000680, "Member 'UK28KillerExitLockerInteraction::_fadeOutTime' has a wrong offset!");
static_assert(offsetof(UK28KillerExitLockerInteraction, _fovChangeTime) == 0x000684, "Member 'UK28KillerExitLockerInteraction::_fovChangeTime' has a wrong offset!");
static_assert(offsetof(UK28KillerExitLockerInteraction, _fovChangeTeleportationCurve) == 0x000688, "Member 'UK28KillerExitLockerInteraction::_fovChangeTeleportationCurve' has a wrong offset!");

// Class TheK28.K28KillerExitLockedLockerInteraction
// 0x0050 (0x0750 - 0x0700)
class UK28KillerExitLockedLockerInteraction final : public UK28KillerExitLockerInteraction
{
public:
	float                                         _lockbarBreakTimePercentage;                       // 0x0700(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _minInteractionTime;                               // 0x0704(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_708[0x48];                                     // 0x0708(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28KillerExitLockedLockerInteraction">();
	}
	static class UK28KillerExitLockedLockerInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28KillerExitLockedLockerInteraction>();
	}
};
static_assert(alignof(UK28KillerExitLockedLockerInteraction) == 0x000010, "Wrong alignment on UK28KillerExitLockedLockerInteraction");
static_assert(sizeof(UK28KillerExitLockedLockerInteraction) == 0x000750, "Wrong size on UK28KillerExitLockedLockerInteraction");
static_assert(offsetof(UK28KillerExitLockedLockerInteraction, _lockbarBreakTimePercentage) == 0x000700, "Member 'UK28KillerExitLockedLockerInteraction::_lockbarBreakTimePercentage' has a wrong offset!");
static_assert(offsetof(UK28KillerExitLockedLockerInteraction, _minInteractionTime) == 0x000704, "Member 'UK28KillerExitLockedLockerInteraction::_minInteractionTime' has a wrong offset!");

// Class TheK28.K28KillerExitLockerWithSurvivorInteraction
// 0x00A0 (0x07A0 - 0x0700)
class UK28KillerExitLockerWithSurvivorInteraction final : public UK28KillerExitLockerInteraction
{
public:
	float                                         _waitTimeBeforeSettingIntoCarryState;              // 0x0700(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_704[0xC];                                      // 0x0704(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimationMontageDescriptor            _montageFromTeleportation;                         // 0x0710(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FAnimationMontageDescriptor            _montageFromAbduction;                             // 0x0730(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_750[0x50];                                     // 0x0750(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28KillerExitLockerWithSurvivorInteraction">();
	}
	static class UK28KillerExitLockerWithSurvivorInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28KillerExitLockerWithSurvivorInteraction>();
	}
};
static_assert(alignof(UK28KillerExitLockerWithSurvivorInteraction) == 0x000010, "Wrong alignment on UK28KillerExitLockerWithSurvivorInteraction");
static_assert(sizeof(UK28KillerExitLockerWithSurvivorInteraction) == 0x0007A0, "Wrong size on UK28KillerExitLockerWithSurvivorInteraction");
static_assert(offsetof(UK28KillerExitLockerWithSurvivorInteraction, _waitTimeBeforeSettingIntoCarryState) == 0x000700, "Member 'UK28KillerExitLockerWithSurvivorInteraction::_waitTimeBeforeSettingIntoCarryState' has a wrong offset!");
static_assert(offsetof(UK28KillerExitLockerWithSurvivorInteraction, _montageFromTeleportation) == 0x000710, "Member 'UK28KillerExitLockerWithSurvivorInteraction::_montageFromTeleportation' has a wrong offset!");
static_assert(offsetof(UK28KillerExitLockerWithSurvivorInteraction, _montageFromAbduction) == 0x000730, "Member 'UK28KillerExitLockerWithSurvivorInteraction::_montageFromAbduction' has a wrong offset!");

// Class TheK28.K28KillerInstinctEffect
// 0x00D8 (0x0428 - 0x0350)
class UK28KillerInstinctEffect final : public UStatusEffect
{
public:
	struct FTunableStat                           _secondsToLinger;                                  // 0x0350(0x0080)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _maxDistanceToApplyRemnantTeleportKillerInstinct;  // 0x03D0(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _lingeringEffectClass;                             // 0x03F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStatusEffect*                          _lingeringEffect;                                  // 0x0400(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_408[0x20];                                     // 0x0408(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnKillerInstinctApplicableChanged(bool active);
	void Authority_OnLevelReadyToPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28KillerInstinctEffect">();
	}
	static class UK28KillerInstinctEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28KillerInstinctEffect>();
	}
};
static_assert(alignof(UK28KillerInstinctEffect) == 0x000008, "Wrong alignment on UK28KillerInstinctEffect");
static_assert(sizeof(UK28KillerInstinctEffect) == 0x000428, "Wrong size on UK28KillerInstinctEffect");
static_assert(offsetof(UK28KillerInstinctEffect, _secondsToLinger) == 0x000350, "Member 'UK28KillerInstinctEffect::_secondsToLinger' has a wrong offset!");
static_assert(offsetof(UK28KillerInstinctEffect, _maxDistanceToApplyRemnantTeleportKillerInstinct) == 0x0003D0, "Member 'UK28KillerInstinctEffect::_maxDistanceToApplyRemnantTeleportKillerInstinct' has a wrong offset!");
static_assert(offsetof(UK28KillerInstinctEffect, _lingeringEffectClass) == 0x0003F8, "Member 'UK28KillerInstinctEffect::_lingeringEffectClass' has a wrong offset!");
static_assert(offsetof(UK28KillerInstinctEffect, _lingeringEffect) == 0x000400, "Member 'UK28KillerInstinctEffect::_lingeringEffect' has a wrong offset!");

// Class TheK28.K28KillerLockerComponent
// 0x0150 (0x0208 - 0x00B8)
class UK28KillerLockerComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x18];                                      // 0x00B8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _targetLockerFOV;                                  // 0x00D0(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _fovChangeTeleportationCurve;                      // 0x00F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _fovChangeTime;                                    // 0x0100(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FK28KillerLockerState                  _lockerState_replicated;                           // 0x0108(0x0010)(Net, Transient, RepNotify, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_118[0xA0];                                     // 0x0118(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AAnimationFollowerActor>    _extraArmsAnimationFollowerActorClass;             // 0x01B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AAnimationFollowerActor*                _extraArmsAnimationFollowerActor;                  // 0x01C0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C8[0x8];                                      // 0x01C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _timeBetweenAttemptTrigger;                        // 0x01D0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1D4[0x34];                                     // 0x01D4(0x0034)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPlayerInLockerChanged(class ADBDPlayer* previousPlayerInLocker, class ADBDPlayer* newPlayerInLocker);
	void OnRep_LockerState_Replicated();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28KillerLockerComponent">();
	}
	static class UK28KillerLockerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28KillerLockerComponent>();
	}
};
static_assert(alignof(UK28KillerLockerComponent) == 0x000008, "Wrong alignment on UK28KillerLockerComponent");
static_assert(sizeof(UK28KillerLockerComponent) == 0x000208, "Wrong size on UK28KillerLockerComponent");
static_assert(offsetof(UK28KillerLockerComponent, _targetLockerFOV) == 0x0000D0, "Member 'UK28KillerLockerComponent::_targetLockerFOV' has a wrong offset!");
static_assert(offsetof(UK28KillerLockerComponent, _fovChangeTeleportationCurve) == 0x0000F8, "Member 'UK28KillerLockerComponent::_fovChangeTeleportationCurve' has a wrong offset!");
static_assert(offsetof(UK28KillerLockerComponent, _fovChangeTime) == 0x000100, "Member 'UK28KillerLockerComponent::_fovChangeTime' has a wrong offset!");
static_assert(offsetof(UK28KillerLockerComponent, _lockerState_replicated) == 0x000108, "Member 'UK28KillerLockerComponent::_lockerState_replicated' has a wrong offset!");
static_assert(offsetof(UK28KillerLockerComponent, _extraArmsAnimationFollowerActorClass) == 0x0001B8, "Member 'UK28KillerLockerComponent::_extraArmsAnimationFollowerActorClass' has a wrong offset!");
static_assert(offsetof(UK28KillerLockerComponent, _extraArmsAnimationFollowerActor) == 0x0001C0, "Member 'UK28KillerLockerComponent::_extraArmsAnimationFollowerActor' has a wrong offset!");
static_assert(offsetof(UK28KillerLockerComponent, _timeBetweenAttemptTrigger) == 0x0001D0, "Member 'UK28KillerLockerComponent::_timeBetweenAttemptTrigger' has a wrong offset!");

// Class TheK28.K28KillerPlayerViewComponent
// 0x0028 (0x00E0 - 0x00B8)
class UK28KillerPlayerViewComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x28];                                      // 0x00B8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28KillerPlayerViewComponent">();
	}
	static class UK28KillerPlayerViewComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28KillerPlayerViewComponent>();
	}
};
static_assert(alignof(UK28KillerPlayerViewComponent) == 0x000008, "Wrong alignment on UK28KillerPlayerViewComponent");
static_assert(sizeof(UK28KillerPlayerViewComponent) == 0x0000E0, "Wrong size on UK28KillerPlayerViewComponent");

// Class TheK28.K28KillerTeleportationComponent
// 0x0230 (0x02E8 - 0x00B8)
class UK28KillerTeleportationComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x10];                                      // 0x00B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTunableStat                           _teleportationSpeed_DayCycle;                      // 0x00C8(0x0080)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _teleportationSpeed_NightCycle;                    // 0x0148(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _teleportationTimeForSurvivorGrab;                 // 0x0170(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FAnimationMontageDescriptor            _survivorPanicInLockerAnimationMontageDescriptor;  // 0x0198(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1B8[0x10];                                     // 0x01B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTagStateBool                          _isTeleporting;                                    // 0x01C8(0x0030)(Net, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1F8[0x8];                                      // 0x01F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            _defaultTeleportationCurve;                        // 0x0200(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _grabTeleportationCurve;                           // 0x0208(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_210[0xC8];                                     // 0x0210(0x00C8)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         _actorsHiddenDuringTeleport;                       // 0x02D8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	void Local_OnTeleportCollisionOverlapBegin(class UPrimitiveComponent* overlappedComponent, class AActor* otherActor, class UPrimitiveComponent* otherComp, int32 otherBodyIndex, bool bFromSweep, const struct FHitResult& sweepResult);
	void Local_OnTeleportCollisionOverlapEnd(class UPrimitiveComponent* overlappedComponent, class AActor* otherActor, class UPrimitiveComponent* otherComp, int32 otherBodyIndex);
	void Multicast_TeleportToLockerEnd(class UK28LockerComponent* lockerTeleportedTo, class ACamperPlayer* survivorInLocker);
	void Multicast_TeleportToLockerStart(const struct FK28SecondaryCameraMovementData& cameraMovementData, class UK28LockerComponent* lockerBeingTeleportedTo, class ACamperPlayer* survivorToGrab);
	void OnLevelReadyToPlay();
	void OnPlayerFinishedEnteringLocker(class ADBDPlayer* playerThatWasInLocker, class ADBDPlayer* playerNowInLocker);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28KillerTeleportationComponent">();
	}
	static class UK28KillerTeleportationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28KillerTeleportationComponent>();
	}
};
static_assert(alignof(UK28KillerTeleportationComponent) == 0x000008, "Wrong alignment on UK28KillerTeleportationComponent");
static_assert(sizeof(UK28KillerTeleportationComponent) == 0x0002E8, "Wrong size on UK28KillerTeleportationComponent");
static_assert(offsetof(UK28KillerTeleportationComponent, _teleportationSpeed_DayCycle) == 0x0000C8, "Member 'UK28KillerTeleportationComponent::_teleportationSpeed_DayCycle' has a wrong offset!");
static_assert(offsetof(UK28KillerTeleportationComponent, _teleportationSpeed_NightCycle) == 0x000148, "Member 'UK28KillerTeleportationComponent::_teleportationSpeed_NightCycle' has a wrong offset!");
static_assert(offsetof(UK28KillerTeleportationComponent, _teleportationTimeForSurvivorGrab) == 0x000170, "Member 'UK28KillerTeleportationComponent::_teleportationTimeForSurvivorGrab' has a wrong offset!");
static_assert(offsetof(UK28KillerTeleportationComponent, _survivorPanicInLockerAnimationMontageDescriptor) == 0x000198, "Member 'UK28KillerTeleportationComponent::_survivorPanicInLockerAnimationMontageDescriptor' has a wrong offset!");
static_assert(offsetof(UK28KillerTeleportationComponent, _isTeleporting) == 0x0001C8, "Member 'UK28KillerTeleportationComponent::_isTeleporting' has a wrong offset!");
static_assert(offsetof(UK28KillerTeleportationComponent, _defaultTeleportationCurve) == 0x000200, "Member 'UK28KillerTeleportationComponent::_defaultTeleportationCurve' has a wrong offset!");
static_assert(offsetof(UK28KillerTeleportationComponent, _grabTeleportationCurve) == 0x000208, "Member 'UK28KillerTeleportationComponent::_grabTeleportationCurve' has a wrong offset!");
static_assert(offsetof(UK28KillerTeleportationComponent, _actorsHiddenDuringTeleport) == 0x0002D8, "Member 'UK28KillerTeleportationComponent::_actorsHiddenDuringTeleport' has a wrong offset!");

