#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ThePig

#include "Basic.hpp"


namespace SDK::Params
{

// Function ThePig.AttachReverseBearTrap.GetCamper
// 0x0008 (0x0008 - 0x0000)
struct AttachReverseBearTrap_GetCamper final
{
public:
	class ACamperPlayer*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AttachReverseBearTrap_GetCamper) == 0x000008, "Wrong alignment on AttachReverseBearTrap_GetCamper");
static_assert(sizeof(AttachReverseBearTrap_GetCamper) == 0x000008, "Wrong size on AttachReverseBearTrap_GetCamper");
static_assert(offsetof(AttachReverseBearTrap_GetCamper, ReturnValue) == 0x000000, "Member 'AttachReverseBearTrap_GetCamper::ReturnValue' has a wrong offset!");

// Function ThePig.RemoveReverseBearTrapChargeable.BP_OnFinishWithDetach
// 0x0008 (0x0008 - 0x0000)
struct RemoveReverseBearTrapChargeable_BP_OnFinishWithDetach final
{
public:
	class ACamperPlayer*                          searchingPlayer;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RemoveReverseBearTrapChargeable_BP_OnFinishWithDetach) == 0x000008, "Wrong alignment on RemoveReverseBearTrapChargeable_BP_OnFinishWithDetach");
static_assert(sizeof(RemoveReverseBearTrapChargeable_BP_OnFinishWithDetach) == 0x000008, "Wrong size on RemoveReverseBearTrapChargeable_BP_OnFinishWithDetach");
static_assert(offsetof(RemoveReverseBearTrapChargeable_BP_OnFinishWithDetach, searchingPlayer) == 0x000000, "Member 'RemoveReverseBearTrapChargeable_BP_OnFinishWithDetach::searchingPlayer' has a wrong offset!");

// Function ThePig.RemoveReverseBearTrapChargeable.BP_OnFinishWithoutDetach
// 0x0008 (0x0008 - 0x0000)
struct RemoveReverseBearTrapChargeable_BP_OnFinishWithoutDetach final
{
public:
	class ACamperPlayer*                          searchingPlayer;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RemoveReverseBearTrapChargeable_BP_OnFinishWithoutDetach) == 0x000008, "Wrong alignment on RemoveReverseBearTrapChargeable_BP_OnFinishWithoutDetach");
static_assert(sizeof(RemoveReverseBearTrapChargeable_BP_OnFinishWithoutDetach) == 0x000008, "Wrong size on RemoveReverseBearTrapChargeable_BP_OnFinishWithoutDetach");
static_assert(offsetof(RemoveReverseBearTrapChargeable_BP_OnFinishWithoutDetach, searchingPlayer) == 0x000000, "Member 'RemoveReverseBearTrapChargeable_BP_OnFinishWithoutDetach::searchingPlayer' has a wrong offset!");

// Function ThePig.RemoveReverseBearTrapChargeable.HasSuccessfullyRemoved
// 0x0001 (0x0001 - 0x0000)
struct RemoveReverseBearTrapChargeable_HasSuccessfullyRemoved final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RemoveReverseBearTrapChargeable_HasSuccessfullyRemoved) == 0x000001, "Wrong alignment on RemoveReverseBearTrapChargeable_HasSuccessfullyRemoved");
static_assert(sizeof(RemoveReverseBearTrapChargeable_HasSuccessfullyRemoved) == 0x000001, "Wrong size on RemoveReverseBearTrapChargeable_HasSuccessfullyRemoved");
static_assert(offsetof(RemoveReverseBearTrapChargeable_HasSuccessfullyRemoved, ReturnValue) == 0x000000, "Member 'RemoveReverseBearTrapChargeable_HasSuccessfullyRemoved::ReturnValue' has a wrong offset!");

}

