#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheTwins

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "DBDCompetence_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "DataTableUtilities_structs.hpp"
#include "DBDGameplay_classes.hpp"
#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "DBDInteraction_classes.hpp"
#include "StatSystem_structs.hpp"
#include "DBDBots_classes.hpp"
#include "SystemUtilities_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "DBDAnimation_classes.hpp"
#include "TheTwins_structs.hpp"
#include "Competence_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "DBDAttack_classes.hpp"


namespace SDK
{

// Class TheTwins.Addon_K22Power_10
// 0x0000 (0x02C8 - 0x02C8)
class UAddon_K22Power_10 final : public UOnEventBaseAddon
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K22Power_10">();
	}
	static class UAddon_K22Power_10* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K22Power_10>();
	}
};
static_assert(alignof(UAddon_K22Power_10) == 0x000008, "Wrong alignment on UAddon_K22Power_10");
static_assert(sizeof(UAddon_K22Power_10) == 0x0002C8, "Wrong size on UAddon_K22Power_10");

// Class TheTwins.Addon_K22Power_11
// 0x0008 (0x02D0 - 0x02C8)
class UAddon_K22Power_11 final : public USpawnEffectsOnAllSurvivorsBaseAddon
{
public:
	float                                         _increaseRemoveTwinTime;                           // 0x02C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K22Power_11">();
	}
	static class UAddon_K22Power_11* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K22Power_11>();
	}
};
static_assert(alignof(UAddon_K22Power_11) == 0x000008, "Wrong alignment on UAddon_K22Power_11");
static_assert(sizeof(UAddon_K22Power_11) == 0x0002D0, "Wrong size on UAddon_K22Power_11");
static_assert(offsetof(UAddon_K22Power_11, _increaseRemoveTwinTime) == 0x0002C8, "Member 'UAddon_K22Power_11::_increaseRemoveTwinTime' has a wrong offset!");

// Class TheTwins.Addon_K22Power_14
// 0x0008 (0x02D0 - 0x02C8)
class UAddon_K22Power_14 final : public UOnEventBaseAddon
{
public:
	float                                         _brokenDuration;                                   // 0x02C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K22Power_14">();
	}
	static class UAddon_K22Power_14* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K22Power_14>();
	}
};
static_assert(alignof(UAddon_K22Power_14) == 0x000008, "Wrong alignment on UAddon_K22Power_14");
static_assert(sizeof(UAddon_K22Power_14) == 0x0002D0, "Wrong size on UAddon_K22Power_14");
static_assert(offsetof(UAddon_K22Power_14, _brokenDuration) == 0x0002C8, "Member 'UAddon_K22Power_14::_brokenDuration' has a wrong offset!");

// Class TheTwins.Addon_K22Power_16
// 0x0000 (0x02C8 - 0x02C8)
class UAddon_K22Power_16 final : public UOnEventBaseAddon
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K22Power_16">();
	}
	static class UAddon_K22Power_16* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K22Power_16>();
	}
};
static_assert(alignof(UAddon_K22Power_16) == 0x000008, "Wrong alignment on UAddon_K22Power_16");
static_assert(sizeof(UAddon_K22Power_16) == 0x0002C8, "Wrong size on UAddon_K22Power_16");

// Class TheTwins.Addon_K22Power_17
// 0x0030 (0x02F8 - 0x02C8)
class UAddon_K22Power_17 final : public USpawnEffectsOnAllSurvivorsBaseAddon
{
public:
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _lingerDuration;                                   // 0x02D0(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Authority_OnTwinSet(class AConjoinedTwin* twin);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K22Power_17">();
	}
	static class UAddon_K22Power_17* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K22Power_17>();
	}
};
static_assert(alignof(UAddon_K22Power_17) == 0x000008, "Wrong alignment on UAddon_K22Power_17");
static_assert(sizeof(UAddon_K22Power_17) == 0x0002F8, "Wrong size on UAddon_K22Power_17");
static_assert(offsetof(UAddon_K22Power_17, _lingerDuration) == 0x0002D0, "Member 'UAddon_K22Power_17::_lingerDuration' has a wrong offset!");

// Class TheTwins.Addon_K22Power_18
// 0x0008 (0x02D0 - 0x02C8)
class UAddon_K22Power_18 final : public UOnEventBaseAddon
{
public:
	float                                         _auraRevealedDuration;                             // 0x02C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K22Power_18">();
	}
	static class UAddon_K22Power_18* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K22Power_18>();
	}
};
static_assert(alignof(UAddon_K22Power_18) == 0x000008, "Wrong alignment on UAddon_K22Power_18");
static_assert(sizeof(UAddon_K22Power_18) == 0x0002D0, "Wrong size on UAddon_K22Power_18");
static_assert(offsetof(UAddon_K22Power_18, _auraRevealedDuration) == 0x0002C8, "Member 'UAddon_K22Power_18::_auraRevealedDuration' has a wrong offset!");

// Class TheTwins.Addon_K22Power_19
// 0x0010 (0x02D8 - 0x02C8)
class UAddon_K22Power_19 final : public UOnEventBaseAddon
{
public:
	float                                         _undetectableDuration;                             // 0x02C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _undetectableEffectClass;                          // 0x02D0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K22Power_19">();
	}
	static class UAddon_K22Power_19* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K22Power_19>();
	}
};
static_assert(alignof(UAddon_K22Power_19) == 0x000008, "Wrong alignment on UAddon_K22Power_19");
static_assert(sizeof(UAddon_K22Power_19) == 0x0002D8, "Wrong size on UAddon_K22Power_19");
static_assert(offsetof(UAddon_K22Power_19, _undetectableDuration) == 0x0002C8, "Member 'UAddon_K22Power_19::_undetectableDuration' has a wrong offset!");
static_assert(offsetof(UAddon_K22Power_19, _undetectableEffectClass) == 0x0002D0, "Member 'UAddon_K22Power_19::_undetectableEffectClass' has a wrong offset!");

// Class TheTwins.Addon_K22Power_20
// 0x0008 (0x02D0 - 0x02C8)
class UAddon_K22Power_20 final : public UOnEventBaseAddon
{
public:
	float                                         _exposedDuration;                                  // 0x02C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K22Power_20">();
	}
	static class UAddon_K22Power_20* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K22Power_20>();
	}
};
static_assert(alignof(UAddon_K22Power_20) == 0x000008, "Wrong alignment on UAddon_K22Power_20");
static_assert(sizeof(UAddon_K22Power_20) == 0x0002D0, "Wrong size on UAddon_K22Power_20");
static_assert(offsetof(UAddon_K22Power_20, _exposedDuration) == 0x0002C8, "Member 'UAddon_K22Power_20::_exposedDuration' has a wrong offset!");

// Class TheTwins.Addon_K22Power_8
// 0x0008 (0x02D0 - 0x02C8)
class UAddon_K22Power_8 final : public USpawnEffectsOnAllSurvivorsBaseAddon
{
public:
	float                                         _increaseDestroyTwinTime;                          // 0x02C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K22Power_8">();
	}
	static class UAddon_K22Power_8* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K22Power_8>();
	}
};
static_assert(alignof(UAddon_K22Power_8) == 0x000008, "Wrong alignment on UAddon_K22Power_8");
static_assert(sizeof(UAddon_K22Power_8) == 0x0002D0, "Wrong size on UAddon_K22Power_8");
static_assert(offsetof(UAddon_K22Power_8, _increaseDestroyTwinTime) == 0x0002C8, "Member 'UAddon_K22Power_8::_increaseDestroyTwinTime' has a wrong offset!");

// Class TheTwins.Addon_K22Power_9
// 0x0008 (0x02D0 - 0x02C8)
class UAddon_K22Power_9 final : public UOnEventBaseAddon
{
public:
	float                                         _blindnessDuration;                                // 0x02C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K22Power_9">();
	}
	static class UAddon_K22Power_9* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K22Power_9>();
	}
};
static_assert(alignof(UAddon_K22Power_9) == 0x000008, "Wrong alignment on UAddon_K22Power_9");
static_assert(sizeof(UAddon_K22Power_9) == 0x0002D0, "Wrong size on UAddon_K22Power_9");
static_assert(offsetof(UAddon_K22Power_9, _blindnessDuration) == 0x0002C8, "Member 'UAddon_K22Power_9::_blindnessDuration' has a wrong offset!");

// Class TheTwins.AISkill_FindInteractable_CrushTwin
// 0x0068 (0x0190 - 0x0128)
class UAISkill_FindInteractable_CrushTwin final : public UAISkill_FindInteractable
{
public:
	uint8                                         Pad_128[0xC];                                      // 0x0128(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAITunableParameter                    _crushVictorGoalWeight;                            // 0x0134(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FAITunableParameter                    _recoveringTimeEstimationErrorMin;                 // 0x0144(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FAITunableParameter                    _recoveringTimeEstimationErrorMax;                 // 0x0154(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _destroyTwinMaxCharge;                             // 0x0168(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_FindInteractable_CrushTwin">();
	}
	static class UAISkill_FindInteractable_CrushTwin* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_FindInteractable_CrushTwin>();
	}
};
static_assert(alignof(UAISkill_FindInteractable_CrushTwin) == 0x000008, "Wrong alignment on UAISkill_FindInteractable_CrushTwin");
static_assert(sizeof(UAISkill_FindInteractable_CrushTwin) == 0x000190, "Wrong size on UAISkill_FindInteractable_CrushTwin");
static_assert(offsetof(UAISkill_FindInteractable_CrushTwin, _crushVictorGoalWeight) == 0x000134, "Member 'UAISkill_FindInteractable_CrushTwin::_crushVictorGoalWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_CrushTwin, _recoveringTimeEstimationErrorMin) == 0x000144, "Member 'UAISkill_FindInteractable_CrushTwin::_recoveringTimeEstimationErrorMin' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_CrushTwin, _recoveringTimeEstimationErrorMax) == 0x000154, "Member 'UAISkill_FindInteractable_CrushTwin::_recoveringTimeEstimationErrorMax' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_CrushTwin, _destroyTwinMaxCharge) == 0x000168, "Member 'UAISkill_FindInteractable_CrushTwin::_destroyTwinMaxCharge' has a wrong offset!");

// Class TheTwins.AISkill_Interaction_RemoveTwin
// 0x0028 (0x01A8 - 0x0180)
class UAISkill_Interaction_RemoveTwin final : public UAISkill_Interaction
{
public:
	struct FDBDTunableRowHandle                   _removeTwinMaxCharge;                              // 0x0180(0x0028)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_Interaction_RemoveTwin">();
	}
	static class UAISkill_Interaction_RemoveTwin* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_Interaction_RemoveTwin>();
	}
};
static_assert(alignof(UAISkill_Interaction_RemoveTwin) == 0x000008, "Wrong alignment on UAISkill_Interaction_RemoveTwin");
static_assert(sizeof(UAISkill_Interaction_RemoveTwin) == 0x0001A8, "Wrong size on UAISkill_Interaction_RemoveTwin");
static_assert(offsetof(UAISkill_Interaction_RemoveTwin, _removeTwinMaxCharge) == 0x000180, "Member 'UAISkill_Interaction_RemoveTwin::_removeTwinMaxCharge' has a wrong offset!");

// Class TheTwins.Appraisal
// 0x0018 (0x03E0 - 0x03C8)
class UAppraisal final : public UPerk
{
public:
	float                                         _chestSearchSpeedMultiplier[0x3];                  // 0x03C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3D4[0xC];                                      // 0x03D4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Appraisal">();
	}
	static class UAppraisal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppraisal>();
	}
};
static_assert(alignof(UAppraisal) == 0x000008, "Wrong alignment on UAppraisal");
static_assert(sizeof(UAppraisal) == 0x0003E0, "Wrong size on UAppraisal");
static_assert(offsetof(UAppraisal, _chestSearchSpeedMultiplier) == 0x0003C8, "Member 'UAppraisal::_chestSearchSpeedMultiplier' has a wrong offset!");

// Class TheTwins.PossessPlayer
// 0x0030 (0x0770 - 0x0740)
class UPossessPlayer : public UChargeableInteractionDefinition
{
public:
	struct FDBDTunableRowHandle                   _possessThePlayerMaxCharge;                        // 0x0740(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_768[0x8];                                      // 0x0768(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_OnPossessCancelled(class ADBDPlayer* player);
	void Cosmetic_OnPossessStart(class ADBDPlayer* player);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PossessPlayer">();
	}
	static class UPossessPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPossessPlayer>();
	}
};
static_assert(alignof(UPossessPlayer) == 0x000010, "Wrong alignment on UPossessPlayer");
static_assert(sizeof(UPossessPlayer) == 0x000770, "Wrong size on UPossessPlayer");
static_assert(offsetof(UPossessPlayer, _possessThePlayerMaxCharge) == 0x000740, "Member 'UPossessPlayer::_possessThePlayerMaxCharge' has a wrong offset!");

// Class TheTwins.PossessTheConjoinedTwin
// 0x0060 (0x07D0 - 0x0770)
class UPossessTheConjoinedTwin : public UPossessPlayer
{
public:
	uint8                                         Pad_770[0x60];                                     // 0x0770(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPowerCollected(class ADBDPlayer* collector);
	void OnTwinSet(class AConjoinedTwin* twin);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PossessTheConjoinedTwin">();
	}
	static class UPossessTheConjoinedTwin* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPossessTheConjoinedTwin>();
	}
};
static_assert(alignof(UPossessTheConjoinedTwin) == 0x000010, "Wrong alignment on UPossessTheConjoinedTwin");
static_assert(sizeof(UPossessTheConjoinedTwin) == 0x0007D0, "Wrong size on UPossessTheConjoinedTwin");

// Class TheTwins.AutoPossessTheConjoinedTwin
// 0x0000 (0x07D0 - 0x07D0)
class UAutoPossessTheConjoinedTwin final : public UPossessTheConjoinedTwin
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AutoPossessTheConjoinedTwin">();
	}
	static class UAutoPossessTheConjoinedTwin* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutoPossessTheConjoinedTwin>();
	}
};
static_assert(alignof(UAutoPossessTheConjoinedTwin) == 0x000010, "Wrong alignment on UAutoPossessTheConjoinedTwin");
static_assert(sizeof(UAutoPossessTheConjoinedTwin) == 0x0007D0, "Wrong size on UAutoPossessTheConjoinedTwin");

// Class TheTwins.BaseTwinInspectLocker
// 0x0030 (0x0680 - 0x0650)
class UBaseTwinInspectLocker : public UBaseLockerInteraction
{
public:
	struct FDBDTunableRowHandle                   _inspectInteractionTime;                           // 0x0648(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_670[0x10];                                     // 0x0670(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseTwinInspectLocker">();
	}
	static class UBaseTwinInspectLocker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseTwinInspectLocker>();
	}
};
static_assert(alignof(UBaseTwinInspectLocker) == 0x000010, "Wrong alignment on UBaseTwinInspectLocker");
static_assert(sizeof(UBaseTwinInspectLocker) == 0x000680, "Wrong size on UBaseTwinInspectLocker");
static_assert(offsetof(UBaseTwinInspectLocker, _inspectInteractionTime) == 0x000648, "Member 'UBaseTwinInspectLocker::_inspectInteractionTime' has a wrong offset!");

// Class TheTwins.BeingPossessedInteraction
// 0x0090 (0x07D0 - 0x0740)
#pragma pack(push, 0x1)
class alignas(0x10) UBeingPossessedInteraction : public UChargeableInteractionDefinition
{
public:
	struct FTunableStat                           _beingPossessedMaxCharge;                          // 0x0740(0x0080)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7C0[0x8];                                      // 0x07C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnLevelReadyToPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BeingPossessedInteraction">();
	}
	static class UBeingPossessedInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBeingPossessedInteraction>();
	}
};
#pragma pack(pop)
static_assert(alignof(UBeingPossessedInteraction) == 0x000010, "Wrong alignment on UBeingPossessedInteraction");
static_assert(sizeof(UBeingPossessedInteraction) == 0x0007D0, "Wrong size on UBeingPossessedInteraction");
static_assert(offsetof(UBeingPossessedInteraction, _beingPossessedMaxCharge) == 0x000740, "Member 'UBeingPossessedInteraction::_beingPossessedMaxCharge' has a wrong offset!");

// Class TheTwins.BrotherBlindFlashlightableLightingStrategy
// 0x0010 (0x0050 - 0x0040)
class UBrotherBlindFlashlightableLightingStrategy final : public UBlindFlashlightableLightingStrategy
{
public:
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BrotherBlindFlashlightableLightingStrategy">();
	}
	static class UBrotherBlindFlashlightableLightingStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBrotherBlindFlashlightableLightingStrategy>();
	}
};
static_assert(alignof(UBrotherBlindFlashlightableLightingStrategy) == 0x000008, "Wrong alignment on UBrotherBlindFlashlightableLightingStrategy");
static_assert(sizeof(UBrotherBlindFlashlightableLightingStrategy) == 0x000050, "Wrong size on UBrotherBlindFlashlightableLightingStrategy");

// Class TheTwins.ChargeTwinJumpInteraction
// 0x0150 (0x0890 - 0x0740)
class UChargeTwinJumpInteraction final : public UChargeableInteractionDefinition
{
public:
	uint8                                         Pad_740[0x48];                                     // 0x0740(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _chargeJumpMaxCharge;                              // 0x0788(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _interactionViewPitchMax;                          // 0x07B0(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _interactionViewPitchMin;                          // 0x07D8(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_800[0x28];                                     // 0x0800(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _cancelCooldownTime;                               // 0x0828(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_850[0x40];                                     // 0x0850(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_OnJumpReadyChanged(class ADBDPlayer* twin, const bool ready);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChargeTwinJumpInteraction">();
	}
	static class UChargeTwinJumpInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChargeTwinJumpInteraction>();
	}
};
static_assert(alignof(UChargeTwinJumpInteraction) == 0x000010, "Wrong alignment on UChargeTwinJumpInteraction");
static_assert(sizeof(UChargeTwinJumpInteraction) == 0x000890, "Wrong size on UChargeTwinJumpInteraction");
static_assert(offsetof(UChargeTwinJumpInteraction, _chargeJumpMaxCharge) == 0x000788, "Member 'UChargeTwinJumpInteraction::_chargeJumpMaxCharge' has a wrong offset!");
static_assert(offsetof(UChargeTwinJumpInteraction, _interactionViewPitchMax) == 0x0007B0, "Member 'UChargeTwinJumpInteraction::_interactionViewPitchMax' has a wrong offset!");
static_assert(offsetof(UChargeTwinJumpInteraction, _interactionViewPitchMin) == 0x0007D8, "Member 'UChargeTwinJumpInteraction::_interactionViewPitchMin' has a wrong offset!");
static_assert(offsetof(UChargeTwinJumpInteraction, _cancelCooldownTime) == 0x000828, "Member 'UChargeTwinJumpInteraction::_cancelCooldownTime' has a wrong offset!");

// Class TheTwins.ConjoinedTwin
// 0x01F0 (0x1350 - 0x1160)
class AConjoinedTwin final : public ADBDPlayer
{
public:
	class URangeToActorsTrackerComponent*         _restrictedPossessionAreaTracker;                  // 0x1158(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTwinOutlineUpdateStrategy*             _twinOutlineUpdateStrategy;                        // 0x1160(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAkComponent*                           _twinLullabyAudioComponent;                        // 0x1168(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UKillerBlindingFXComponent*             _twinBlindingFX;                                   // 0x1170(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TwinNoiseRange;                                    // 0x1178(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_117C[0x4];                                     // 0x117C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizedAudioComponent*              _customizedAudio;                                  // 0x1180(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDBDAttackerComponent*                  _attackerComponent;                                // 0x1188(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _maxWalkSpeed;                                     // 0x1190(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHitValidatorComponent*                 _hitValidator;                                     // 0x11B8(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHitValidatorConfigurator*              _hitValidationConfigurator;                        // 0x11C0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _gravityScale;                                     // 0x11C8(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimationMontageSlave*                 _animationFollower;                                // 0x11F0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_11F8[0x20];                                    // 0x11F8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _revealDurationOnAttached;                         // 0x1218(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTwinFirstPersonViewComponent*          _firstPersonViewComponent;                         // 0x1240(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFlashlightableComponent*               _eyesFlashlightable;                               // 0x1248(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBlindFlashlightTargetFXComponent*      _blindFlashlightTargetFXComponent;                 // 0x1250(0x0008)(Edit, ExportObject, ZeroConstructor, Transient, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFirecrackerEffectHandlerComponent*     _firecrackerEffectHandlerComponent;                // 0x1258(0x0008)(Edit, ExportObject, ZeroConstructor, Transient, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1260[0x8];                                     // 0x1260(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFastTimer                             _flashlightBlindEvasionScoreTimer;                 // 0x1268(0x0030)(Transient, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _flashlightEvasionScoreCooldown;                   // 0x1298(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _twinsBloodhoundEffect;                            // 0x12C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _twinsRevealKillerAuraEffect;                      // 0x12C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _twinsDormantKillerInstinctEffect;                 // 0x12D0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _twinsRevealAuraOnAttachedToSurvivorEffect;        // 0x12D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _twinsRevealAuraOnRecallReadyEffect;               // 0x12E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _timeDeafenedOnTriggerEffect;                      // 0x12E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTwinPossessNegationEffectComponent*    _twinPossessNegationEffectComponent;               // 0x12F0(0x0008)(Edit, ExportObject, ZeroConstructor, Transient, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_12F8[0x58];                                    // 0x12F8(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnFirecrackerInRangeBegin(const struct FFirecrackerEffectData& effectData);
	void Cosmetic_OnOnGroundUncontrolledChanged(bool onGroundAndUncontrolled);
	void OnFinishedPlayingEvent(const struct FGameplayTag& gameEventType, const struct FGameEventData& gameEventData);
	void Server_SendAttackInput(bool pressed);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConjoinedTwin">();
	}
	static class AConjoinedTwin* GetDefaultObj()
	{
		return GetDefaultObjImpl<AConjoinedTwin>();
	}
};
static_assert(alignof(AConjoinedTwin) == 0x000010, "Wrong alignment on AConjoinedTwin");
static_assert(sizeof(AConjoinedTwin) == 0x001350, "Wrong size on AConjoinedTwin");
static_assert(offsetof(AConjoinedTwin, _restrictedPossessionAreaTracker) == 0x001158, "Member 'AConjoinedTwin::_restrictedPossessionAreaTracker' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _twinOutlineUpdateStrategy) == 0x001160, "Member 'AConjoinedTwin::_twinOutlineUpdateStrategy' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _twinLullabyAudioComponent) == 0x001168, "Member 'AConjoinedTwin::_twinLullabyAudioComponent' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _twinBlindingFX) == 0x001170, "Member 'AConjoinedTwin::_twinBlindingFX' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, TwinNoiseRange) == 0x001178, "Member 'AConjoinedTwin::TwinNoiseRange' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _customizedAudio) == 0x001180, "Member 'AConjoinedTwin::_customizedAudio' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _attackerComponent) == 0x001188, "Member 'AConjoinedTwin::_attackerComponent' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _maxWalkSpeed) == 0x001190, "Member 'AConjoinedTwin::_maxWalkSpeed' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _hitValidator) == 0x0011B8, "Member 'AConjoinedTwin::_hitValidator' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _hitValidationConfigurator) == 0x0011C0, "Member 'AConjoinedTwin::_hitValidationConfigurator' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _gravityScale) == 0x0011C8, "Member 'AConjoinedTwin::_gravityScale' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _animationFollower) == 0x0011F0, "Member 'AConjoinedTwin::_animationFollower' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _revealDurationOnAttached) == 0x001218, "Member 'AConjoinedTwin::_revealDurationOnAttached' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _firstPersonViewComponent) == 0x001240, "Member 'AConjoinedTwin::_firstPersonViewComponent' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _eyesFlashlightable) == 0x001248, "Member 'AConjoinedTwin::_eyesFlashlightable' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _blindFlashlightTargetFXComponent) == 0x001250, "Member 'AConjoinedTwin::_blindFlashlightTargetFXComponent' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _firecrackerEffectHandlerComponent) == 0x001258, "Member 'AConjoinedTwin::_firecrackerEffectHandlerComponent' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _flashlightBlindEvasionScoreTimer) == 0x001268, "Member 'AConjoinedTwin::_flashlightBlindEvasionScoreTimer' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _flashlightEvasionScoreCooldown) == 0x001298, "Member 'AConjoinedTwin::_flashlightEvasionScoreCooldown' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _twinsBloodhoundEffect) == 0x0012C0, "Member 'AConjoinedTwin::_twinsBloodhoundEffect' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _twinsRevealKillerAuraEffect) == 0x0012C8, "Member 'AConjoinedTwin::_twinsRevealKillerAuraEffect' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _twinsDormantKillerInstinctEffect) == 0x0012D0, "Member 'AConjoinedTwin::_twinsDormantKillerInstinctEffect' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _twinsRevealAuraOnAttachedToSurvivorEffect) == 0x0012D8, "Member 'AConjoinedTwin::_twinsRevealAuraOnAttachedToSurvivorEffect' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _twinsRevealAuraOnRecallReadyEffect) == 0x0012E0, "Member 'AConjoinedTwin::_twinsRevealAuraOnRecallReadyEffect' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _timeDeafenedOnTriggerEffect) == 0x0012E8, "Member 'AConjoinedTwin::_timeDeafenedOnTriggerEffect' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _twinPossessNegationEffectComponent) == 0x0012F0, "Member 'AConjoinedTwin::_twinPossessNegationEffectComponent' has a wrong offset!");

// Class TheTwins.ConjoinedTwinAnimInstance
// 0x00C0 (0x0600 - 0x0540)
class UConjoinedTwinAnimInstance final : public UPlayerAnimInstance
{
public:
	class AConjoinedTwin*                         _owningConjoinedTwin;                              // 0x0540(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _firstPersonView;                                  // 0x0548(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_549[0x3];                                      // 0x0549(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _forwardVelocity;                                  // 0x054C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _lateralVelocity;                                  // 0x0550(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EInteractionAnimation                         _interactionType;                                  // 0x0554(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInAir;                                          // 0x0555(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isIdle;                                           // 0x0556(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_557[0x1];                                      // 0x0557(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _idleTime;                                         // 0x0558(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isAttacking;                                      // 0x055C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_55D[0x3];                                      // 0x055D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UDBDAttackerComponent*                  _attackerComponent;                                // 0x0560(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTwinAttachmentComponent*               _twinAttachmentComponent;                          // 0x0568(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTwinLockerBlockerComponent*            _twinLockerBlockerComponent;                       // 0x0570(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _animYaw;                                          // 0x0578(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _animPitch;                                        // 0x057C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isSpectator;                                      // 0x0580(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_581[0x3];                                      // 0x0581(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _animDirection;                                    // 0x0584(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _animSpeed;                                        // 0x0588(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isAttachedToSister;                               // 0x058C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isAttachedToSurvivor;                             // 0x058D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isAttachedToFemaleSurvivor;                       // 0x058E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isChargingTwinJump;                               // 0x058F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isPossessing;                                     // 0x0590(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isWakingUpFromPossess;                            // 0x0591(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isDormant;                                        // 0x0592(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isBeingAutoPossessedAfterRelease;                 // 0x0593(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isAttachedToLocker;                               // 0x0594(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAttackSubstate                               _attackState;                                      // 0x0595(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_596[0x6A];                                     // 0x0596(0x006A)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	const class AConjoinedTwin* GetOwningConjoinedTwin() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConjoinedTwinAnimInstance">();
	}
	static class UConjoinedTwinAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConjoinedTwinAnimInstance>();
	}
};
static_assert(alignof(UConjoinedTwinAnimInstance) == 0x000010, "Wrong alignment on UConjoinedTwinAnimInstance");
static_assert(sizeof(UConjoinedTwinAnimInstance) == 0x000600, "Wrong size on UConjoinedTwinAnimInstance");
static_assert(offsetof(UConjoinedTwinAnimInstance, _owningConjoinedTwin) == 0x000540, "Member 'UConjoinedTwinAnimInstance::_owningConjoinedTwin' has a wrong offset!");
static_assert(offsetof(UConjoinedTwinAnimInstance, _firstPersonView) == 0x000548, "Member 'UConjoinedTwinAnimInstance::_firstPersonView' has a wrong offset!");
static_assert(offsetof(UConjoinedTwinAnimInstance, _forwardVelocity) == 0x00054C, "Member 'UConjoinedTwinAnimInstance::_forwardVelocity' has a wrong offset!");
static_assert(offsetof(UConjoinedTwinAnimInstance, _lateralVelocity) == 0x000550, "Member 'UConjoinedTwinAnimInstance::_lateralVelocity' has a wrong offset!");
static_assert(offsetof(UConjoinedTwinAnimInstance, _interactionType) == 0x000554, "Member 'UConjoinedTwinAnimInstance::_interactionType' has a wrong offset!");
static_assert(offsetof(UConjoinedTwinAnimInstance, _isInAir) == 0x000555, "Member 'UConjoinedTwinAnimInstance::_isInAir' has a wrong offset!");
static_assert(offsetof(UConjoinedTwinAnimInstance, _isIdle) == 0x000556, "Member 'UConjoinedTwinAnimInstance::_isIdle' has a wrong offset!");
static_assert(offsetof(UConjoinedTwinAnimInstance, _idleTime) == 0x000558, "Member 'UConjoinedTwinAnimInstance::_idleTime' has a wrong offset!");
static_assert(offsetof(UConjoinedTwinAnimInstance, _isAttacking) == 0x00055C, "Member 'UConjoinedTwinAnimInstance::_isAttacking' has a wrong offset!");
static_assert(offsetof(UConjoinedTwinAnimInstance, _attackerComponent) == 0x000560, "Member 'UConjoinedTwinAnimInstance::_attackerComponent' has a wrong offset!");
static_assert(offsetof(UConjoinedTwinAnimInstance, _twinAttachmentComponent) == 0x000568, "Member 'UConjoinedTwinAnimInstance::_twinAttachmentComponent' has a wrong offset!");
static_assert(offsetof(UConjoinedTwinAnimInstance, _twinLockerBlockerComponent) == 0x000570, "Member 'UConjoinedTwinAnimInstance::_twinLockerBlockerComponent' has a wrong offset!");
static_assert(offsetof(UConjoinedTwinAnimInstance, _animYaw) == 0x000578, "Member 'UConjoinedTwinAnimInstance::_animYaw' has a wrong offset!");
static_assert(offsetof(UConjoinedTwinAnimInstance, _animPitch) == 0x00057C, "Member 'UConjoinedTwinAnimInstance::_animPitch' has a wrong offset!");
static_assert(offsetof(UConjoinedTwinAnimInstance, _isSpectator) == 0x000580, "Member 'UConjoinedTwinAnimInstance::_isSpectator' has a wrong offset!");
static_assert(offsetof(UConjoinedTwinAnimInstance, _animDirection) == 0x000584, "Member 'UConjoinedTwinAnimInstance::_animDirection' has a wrong offset!");
static_assert(offsetof(UConjoinedTwinAnimInstance, _animSpeed) == 0x000588, "Member 'UConjoinedTwinAnimInstance::_animSpeed' has a wrong offset!");
static_assert(offsetof(UConjoinedTwinAnimInstance, _isAttachedToSister) == 0x00058C, "Member 'UConjoinedTwinAnimInstance::_isAttachedToSister' has a wrong offset!");
static_assert(offsetof(UConjoinedTwinAnimInstance, _isAttachedToSurvivor) == 0x00058D, "Member 'UConjoinedTwinAnimInstance::_isAttachedToSurvivor' has a wrong offset!");
static_assert(offsetof(UConjoinedTwinAnimInstance, _isAttachedToFemaleSurvivor) == 0x00058E, "Member 'UConjoinedTwinAnimInstance::_isAttachedToFemaleSurvivor' has a wrong offset!");
static_assert(offsetof(UConjoinedTwinAnimInstance, _isChargingTwinJump) == 0x00058F, "Member 'UConjoinedTwinAnimInstance::_isChargingTwinJump' has a wrong offset!");
static_assert(offsetof(UConjoinedTwinAnimInstance, _isPossessing) == 0x000590, "Member 'UConjoinedTwinAnimInstance::_isPossessing' has a wrong offset!");
static_assert(offsetof(UConjoinedTwinAnimInstance, _isWakingUpFromPossess) == 0x000591, "Member 'UConjoinedTwinAnimInstance::_isWakingUpFromPossess' has a wrong offset!");
static_assert(offsetof(UConjoinedTwinAnimInstance, _isDormant) == 0x000592, "Member 'UConjoinedTwinAnimInstance::_isDormant' has a wrong offset!");
static_assert(offsetof(UConjoinedTwinAnimInstance, _isBeingAutoPossessedAfterRelease) == 0x000593, "Member 'UConjoinedTwinAnimInstance::_isBeingAutoPossessedAfterRelease' has a wrong offset!");
static_assert(offsetof(UConjoinedTwinAnimInstance, _isAttachedToLocker) == 0x000594, "Member 'UConjoinedTwinAnimInstance::_isAttachedToLocker' has a wrong offset!");
static_assert(offsetof(UConjoinedTwinAnimInstance, _attackState) == 0x000595, "Member 'UConjoinedTwinAnimInstance::_attackState' has a wrong offset!");

// Class TheTwins.ConjoinedTwinInteractable
// 0x0028 (0x0370 - 0x0348)
class AConjoinedTwinInteractable final : public APlayerInteractable
{
public:
	class UChargeableComponent*                   _possessKillerChargeable;                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UChargeableComponent*                   _twinBeingPossessedChargeable;                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UChargeableComponent*                   _chargeTwinJumpChargeable;                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UChargeableComponent*                   _removeTwinChargeable;                             // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UChargeableComponent*                   _destroyTwinChargeable;                            // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConjoinedTwinInteractable">();
	}
	static class AConjoinedTwinInteractable* GetDefaultObj()
	{
		return GetDefaultObjImpl<AConjoinedTwinInteractable>();
	}
};
static_assert(alignof(AConjoinedTwinInteractable) == 0x000008, "Wrong alignment on AConjoinedTwinInteractable");
static_assert(sizeof(AConjoinedTwinInteractable) == 0x000370, "Wrong size on AConjoinedTwinInteractable");
static_assert(offsetof(AConjoinedTwinInteractable, _possessKillerChargeable) == 0x000348, "Member 'AConjoinedTwinInteractable::_possessKillerChargeable' has a wrong offset!");
static_assert(offsetof(AConjoinedTwinInteractable, _twinBeingPossessedChargeable) == 0x000350, "Member 'AConjoinedTwinInteractable::_twinBeingPossessedChargeable' has a wrong offset!");
static_assert(offsetof(AConjoinedTwinInteractable, _chargeTwinJumpChargeable) == 0x000358, "Member 'AConjoinedTwinInteractable::_chargeTwinJumpChargeable' has a wrong offset!");
static_assert(offsetof(AConjoinedTwinInteractable, _removeTwinChargeable) == 0x000360, "Member 'AConjoinedTwinInteractable::_removeTwinChargeable' has a wrong offset!");
static_assert(offsetof(AConjoinedTwinInteractable, _destroyTwinChargeable) == 0x000368, "Member 'AConjoinedTwinInteractable::_destroyTwinChargeable' has a wrong offset!");

// Class TheTwins.ConjoinedTwinStateMachine
// 0x0000 (0x0130 - 0x0130)
class UConjoinedTwinStateMachine final : public UPlayerStateMachine
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConjoinedTwinStateMachine">();
	}
	static class UConjoinedTwinStateMachine* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConjoinedTwinStateMachine>();
	}
};
static_assert(alignof(UConjoinedTwinStateMachine) == 0x000010, "Wrong alignment on UConjoinedTwinStateMachine");
static_assert(sizeof(UConjoinedTwinStateMachine) == 0x000130, "Wrong size on UConjoinedTwinStateMachine");

// Class TheTwins.CoupDeGrace
// 0x0020 (0x03E8 - 0x03C8)
class UCoupDeGrace final : public UPerk
{
public:
	float                                         _lungeAttackAddDurationMultiplier[0x3];            // 0x03C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGenerator*>                     _completedGenerators;                              // 0x03D8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CoupDeGrace">();
	}
	static class UCoupDeGrace* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCoupDeGrace>();
	}
};
static_assert(alignof(UCoupDeGrace) == 0x000008, "Wrong alignment on UCoupDeGrace");
static_assert(sizeof(UCoupDeGrace) == 0x0003E8, "Wrong size on UCoupDeGrace");
static_assert(offsetof(UCoupDeGrace, _lungeAttackAddDurationMultiplier) == 0x0003C8, "Member 'UCoupDeGrace::_lungeAttackAddDurationMultiplier' has a wrong offset!");
static_assert(offsetof(UCoupDeGrace, _completedGenerators) == 0x0003D8, "Member 'UCoupDeGrace::_completedGenerators' has a wrong offset!");

// Class TheTwins.Deception
// 0x0038 (0x0400 - 0x03C8)
class UDeception final : public UPerk
{
public:
	float                                         _noScratchMarksDuration[0x3];                      // 0x03C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _perkCooldownDuration[0x3];                        // 0x03D4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStatusEffect*                          _statusEffect;                                     // 0x03E0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UManualIconStrategy*                    _iconStrategy;                                     // 0x03F0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3F8[0x8];                                      // 0x03F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnOwningPlayerFakedEnteringLockerCosmetic();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Deception">();
	}
	static class UDeception* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeception>();
	}
};
static_assert(alignof(UDeception) == 0x000008, "Wrong alignment on UDeception");
static_assert(sizeof(UDeception) == 0x000400, "Wrong size on UDeception");
static_assert(offsetof(UDeception, _noScratchMarksDuration) == 0x0003C8, "Member 'UDeception::_noScratchMarksDuration' has a wrong offset!");
static_assert(offsetof(UDeception, _perkCooldownDuration) == 0x0003D4, "Member 'UDeception::_perkCooldownDuration' has a wrong offset!");
static_assert(offsetof(UDeception, _statusEffect) == 0x0003E0, "Member 'UDeception::_statusEffect' has a wrong offset!");
static_assert(offsetof(UDeception, _iconStrategy) == 0x0003F0, "Member 'UDeception::_iconStrategy' has a wrong offset!");

// Class TheTwins.DestroyTwin
// 0x0070 (0x07B0 - 0x0740)
class UDestroyTwin final : public UChargeableInteractionDefinition
{
public:
	uint8                                         Pad_740[0x40];                                     // 0x0740(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _destroyTwinMaxCharge;                             // 0x0780(0x0028)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7A8[0x8];                                      // 0x07A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DestroyTwin">();
	}
	static class UDestroyTwin* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDestroyTwin>();
	}
};
static_assert(alignof(UDestroyTwin) == 0x000010, "Wrong alignment on UDestroyTwin");
static_assert(sizeof(UDestroyTwin) == 0x0007B0, "Wrong size on UDestroyTwin");
static_assert(offsetof(UDestroyTwin, _destroyTwinMaxCharge) == 0x000780, "Member 'UDestroyTwin::_destroyTwinMaxCharge' has a wrong offset!");

// Class TheTwins.Hoarder
// 0x0050 (0x0418 - 0x03C8)
class UHoarder final : public UPerk
{
public:
	uint8                                         Pad_3C8[0x8];                                      // 0x03C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ASearchable*>                    _chests;                                           // 0x03D0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	float                                         _camperInteractItemPickupRevealRange[0x3];         // 0x03E0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         _extraChestsSpawned[0x3];                          // 0x03EC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _bubbleIndicatorLifetime[0x3];                     // 0x03F8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _showUniqueChestVisualPerState;                    // 0x0404(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_405[0x13];                                     // 0x0405(0x0013)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Local_ThrowBubbleIndicator(const EPerkInteractionObjectType camperInteractionType, const class AActor* objectActor, const class ACamperPlayer* interactingCamperPlayer);

	float GetBubbleIndicatorLifetime() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Hoarder">();
	}
	static class UHoarder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoarder>();
	}
};
static_assert(alignof(UHoarder) == 0x000008, "Wrong alignment on UHoarder");
static_assert(sizeof(UHoarder) == 0x000418, "Wrong size on UHoarder");
static_assert(offsetof(UHoarder, _chests) == 0x0003D0, "Member 'UHoarder::_chests' has a wrong offset!");
static_assert(offsetof(UHoarder, _camperInteractItemPickupRevealRange) == 0x0003E0, "Member 'UHoarder::_camperInteractItemPickupRevealRange' has a wrong offset!");
