#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheTwins

#include "Basic.hpp"

#include "AnimationUtilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "TheTwins_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TheTwins.Addon_K22Power_17.Authority_OnTwinSet
// 0x0008 (0x0008 - 0x0000)
struct Addon_K22Power_17_Authority_OnTwinSet final
{
public:
	class AConjoinedTwin*                         twin;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Addon_K22Power_17_Authority_OnTwinSet) == 0x000008, "Wrong alignment on Addon_K22Power_17_Authority_OnTwinSet");
static_assert(sizeof(Addon_K22Power_17_Authority_OnTwinSet) == 0x000008, "Wrong size on Addon_K22Power_17_Authority_OnTwinSet");
static_assert(offsetof(Addon_K22Power_17_Authority_OnTwinSet, twin) == 0x000000, "Member 'Addon_K22Power_17_Authority_OnTwinSet::twin' has a wrong offset!");

// Function TheTwins.PossessPlayer.Cosmetic_OnPossessCancelled
// 0x0008 (0x0008 - 0x0000)
struct PossessPlayer_Cosmetic_OnPossessCancelled final
{
public:
	class ADBDPlayer*                             player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PossessPlayer_Cosmetic_OnPossessCancelled) == 0x000008, "Wrong alignment on PossessPlayer_Cosmetic_OnPossessCancelled");
static_assert(sizeof(PossessPlayer_Cosmetic_OnPossessCancelled) == 0x000008, "Wrong size on PossessPlayer_Cosmetic_OnPossessCancelled");
static_assert(offsetof(PossessPlayer_Cosmetic_OnPossessCancelled, player) == 0x000000, "Member 'PossessPlayer_Cosmetic_OnPossessCancelled::player' has a wrong offset!");

// Function TheTwins.PossessPlayer.Cosmetic_OnPossessStart
// 0x0008 (0x0008 - 0x0000)
struct PossessPlayer_Cosmetic_OnPossessStart final
{
public:
	class ADBDPlayer*                             player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PossessPlayer_Cosmetic_OnPossessStart) == 0x000008, "Wrong alignment on PossessPlayer_Cosmetic_OnPossessStart");
static_assert(sizeof(PossessPlayer_Cosmetic_OnPossessStart) == 0x000008, "Wrong size on PossessPlayer_Cosmetic_OnPossessStart");
static_assert(offsetof(PossessPlayer_Cosmetic_OnPossessStart, player) == 0x000000, "Member 'PossessPlayer_Cosmetic_OnPossessStart::player' has a wrong offset!");

// Function TheTwins.PossessTheConjoinedTwin.OnPowerCollected
// 0x0008 (0x0008 - 0x0000)
struct PossessTheConjoinedTwin_OnPowerCollected final
{
public:
	class ADBDPlayer*                             collector;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PossessTheConjoinedTwin_OnPowerCollected) == 0x000008, "Wrong alignment on PossessTheConjoinedTwin_OnPowerCollected");
static_assert(sizeof(PossessTheConjoinedTwin_OnPowerCollected) == 0x000008, "Wrong size on PossessTheConjoinedTwin_OnPowerCollected");
static_assert(offsetof(PossessTheConjoinedTwin_OnPowerCollected, collector) == 0x000000, "Member 'PossessTheConjoinedTwin_OnPowerCollected::collector' has a wrong offset!");

// Function TheTwins.PossessTheConjoinedTwin.OnTwinSet
// 0x0008 (0x0008 - 0x0000)
struct PossessTheConjoinedTwin_OnTwinSet final
{
public:
	class AConjoinedTwin*                         twin;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PossessTheConjoinedTwin_OnTwinSet) == 0x000008, "Wrong alignment on PossessTheConjoinedTwin_OnTwinSet");
static_assert(sizeof(PossessTheConjoinedTwin_OnTwinSet) == 0x000008, "Wrong size on PossessTheConjoinedTwin_OnTwinSet");
static_assert(offsetof(PossessTheConjoinedTwin_OnTwinSet, twin) == 0x000000, "Member 'PossessTheConjoinedTwin_OnTwinSet::twin' has a wrong offset!");

// Function TheTwins.ChargeTwinJumpInteraction.Cosmetic_OnJumpReadyChanged
// 0x0010 (0x0010 - 0x0000)
struct ChargeTwinJumpInteraction_Cosmetic_OnJumpReadyChanged final
{
public:
	class ADBDPlayer*                             twin;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ready;                                             // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChargeTwinJumpInteraction_Cosmetic_OnJumpReadyChanged) == 0x000008, "Wrong alignment on ChargeTwinJumpInteraction_Cosmetic_OnJumpReadyChanged");
static_assert(sizeof(ChargeTwinJumpInteraction_Cosmetic_OnJumpReadyChanged) == 0x000010, "Wrong size on ChargeTwinJumpInteraction_Cosmetic_OnJumpReadyChanged");
static_assert(offsetof(ChargeTwinJumpInteraction_Cosmetic_OnJumpReadyChanged, twin) == 0x000000, "Member 'ChargeTwinJumpInteraction_Cosmetic_OnJumpReadyChanged::twin' has a wrong offset!");
static_assert(offsetof(ChargeTwinJumpInteraction_Cosmetic_OnJumpReadyChanged, ready) == 0x000008, "Member 'ChargeTwinJumpInteraction_Cosmetic_OnJumpReadyChanged::ready' has a wrong offset!");

// Function TheTwins.ConjoinedTwin.Authority_OnFirecrackerInRangeBegin
// 0x0010 (0x0010 - 0x0000)
struct ConjoinedTwin_Authority_OnFirecrackerInRangeBegin final
{
public:
	struct FFirecrackerEffectData                 effectData;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConjoinedTwin_Authority_OnFirecrackerInRangeBegin) == 0x000008, "Wrong alignment on ConjoinedTwin_Authority_OnFirecrackerInRangeBegin");
static_assert(sizeof(ConjoinedTwin_Authority_OnFirecrackerInRangeBegin) == 0x000010, "Wrong size on ConjoinedTwin_Authority_OnFirecrackerInRangeBegin");
static_assert(offsetof(ConjoinedTwin_Authority_OnFirecrackerInRangeBegin, effectData) == 0x000000, "Member 'ConjoinedTwin_Authority_OnFirecrackerInRangeBegin::effectData' has a wrong offset!");

// Function TheTwins.ConjoinedTwin.Cosmetic_OnOnGroundUncontrolledChanged
// 0x0001 (0x0001 - 0x0000)
struct ConjoinedTwin_Cosmetic_OnOnGroundUncontrolledChanged final
{
public:
	bool                                          onGroundAndUncontrolled;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConjoinedTwin_Cosmetic_OnOnGroundUncontrolledChanged) == 0x000001, "Wrong alignment on ConjoinedTwin_Cosmetic_OnOnGroundUncontrolledChanged");
static_assert(sizeof(ConjoinedTwin_Cosmetic_OnOnGroundUncontrolledChanged) == 0x000001, "Wrong size on ConjoinedTwin_Cosmetic_OnOnGroundUncontrolledChanged");
static_assert(offsetof(ConjoinedTwin_Cosmetic_OnOnGroundUncontrolledChanged, onGroundAndUncontrolled) == 0x000000, "Member 'ConjoinedTwin_Cosmetic_OnOnGroundUncontrolledChanged::onGroundAndUncontrolled' has a wrong offset!");

// Function TheTwins.ConjoinedTwin.OnFinishedPlayingEvent
// 0x0038 (0x0038 - 0x0000)
struct ConjoinedTwin_OnFinishedPlayingEvent final
{
public:
	struct FGameplayTag                           gameEventType;                                     // 0x0000(0x000C)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         gameEventData;                                     // 0x0010(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConjoinedTwin_OnFinishedPlayingEvent) == 0x000008, "Wrong alignment on ConjoinedTwin_OnFinishedPlayingEvent");
static_assert(sizeof(ConjoinedTwin_OnFinishedPlayingEvent) == 0x000038, "Wrong size on ConjoinedTwin_OnFinishedPlayingEvent");
static_assert(offsetof(ConjoinedTwin_OnFinishedPlayingEvent, gameEventType) == 0x000000, "Member 'ConjoinedTwin_OnFinishedPlayingEvent::gameEventType' has a wrong offset!");
static_assert(offsetof(ConjoinedTwin_OnFinishedPlayingEvent, gameEventData) == 0x000010, "Member 'ConjoinedTwin_OnFinishedPlayingEvent::gameEventData' has a wrong offset!");

// Function TheTwins.ConjoinedTwin.Server_SendAttackInput
// 0x0001 (0x0001 - 0x0000)
struct ConjoinedTwin_Server_SendAttackInput final
{
public:
	bool                                          pressed;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConjoinedTwin_Server_SendAttackInput) == 0x000001, "Wrong alignment on ConjoinedTwin_Server_SendAttackInput");
static_assert(sizeof(ConjoinedTwin_Server_SendAttackInput) == 0x000001, "Wrong size on ConjoinedTwin_Server_SendAttackInput");
static_assert(offsetof(ConjoinedTwin_Server_SendAttackInput, pressed) == 0x000000, "Member 'ConjoinedTwin_Server_SendAttackInput::pressed' has a wrong offset!");

// Function TheTwins.ConjoinedTwinAnimInstance.GetOwningConjoinedTwin
// 0x0008 (0x0008 - 0x0000)
struct ConjoinedTwinAnimInstance_GetOwningConjoinedTwin final
{
public:
	const class AConjoinedTwin*                   ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConjoinedTwinAnimInstance_GetOwningConjoinedTwin) == 0x000008, "Wrong alignment on ConjoinedTwinAnimInstance_GetOwningConjoinedTwin");
static_assert(sizeof(ConjoinedTwinAnimInstance_GetOwningConjoinedTwin) == 0x000008, "Wrong size on ConjoinedTwinAnimInstance_GetOwningConjoinedTwin");
static_assert(offsetof(ConjoinedTwinAnimInstance_GetOwningConjoinedTwin, ReturnValue) == 0x000000, "Member 'ConjoinedTwinAnimInstance_GetOwningConjoinedTwin::ReturnValue' has a wrong offset!");

// Function TheTwins.Hoarder.Local_ThrowBubbleIndicator
// 0x0018 (0x0018 - 0x0000)
struct Hoarder_Local_ThrowBubbleIndicator final
{
public:
	EPerkInteractionObjectType                    camperInteractionType;                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class AActor*                           objectActor;                                       // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class ACamperPlayer*                    interactingCamperPlayer;                           // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Hoarder_Local_ThrowBubbleIndicator) == 0x000008, "Wrong alignment on Hoarder_Local_ThrowBubbleIndicator");
static_assert(sizeof(Hoarder_Local_ThrowBubbleIndicator) == 0x000018, "Wrong size on Hoarder_Local_ThrowBubbleIndicator");
static_assert(offsetof(Hoarder_Local_ThrowBubbleIndicator, camperInteractionType) == 0x000000, "Member 'Hoarder_Local_ThrowBubbleIndicator::camperInteractionType' has a wrong offset!");
static_assert(offsetof(Hoarder_Local_ThrowBubbleIndicator, objectActor) == 0x000008, "Member 'Hoarder_Local_ThrowBubbleIndicator::objectActor' has a wrong offset!");
static_assert(offsetof(Hoarder_Local_ThrowBubbleIndicator, interactingCamperPlayer) == 0x000010, "Member 'Hoarder_Local_ThrowBubbleIndicator::interactingCamperPlayer' has a wrong offset!");

// Function TheTwins.Hoarder.GetBubbleIndicatorLifetime
// 0x0004 (0x0004 - 0x0000)
struct Hoarder_GetBubbleIndicatorLifetime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Hoarder_GetBubbleIndicatorLifetime) == 0x000004, "Wrong alignment on Hoarder_GetBubbleIndicatorLifetime");
static_assert(sizeof(Hoarder_GetBubbleIndicatorLifetime) == 0x000004, "Wrong size on Hoarder_GetBubbleIndicatorLifetime");
static_assert(offsetof(Hoarder_GetBubbleIndicatorLifetime, ReturnValue) == 0x000000, "Member 'Hoarder_GetBubbleIndicatorLifetime::ReturnValue' has a wrong offset!");

// Function TheTwins.K22Power.Authority_OnDestroyTwinChargePercentChanged
// 0x0010 (0x0010 - 0x0000)
struct K22Power_Authority_OnDestroyTwinChargePercentChanged final
{
public:
	class UChargeableComponent*                   chargeableComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         percentCompletionChange;                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         totalPercentComplete;                              // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K22Power_Authority_OnDestroyTwinChargePercentChanged) == 0x000008, "Wrong alignment on K22Power_Authority_OnDestroyTwinChargePercentChanged");
static_assert(sizeof(K22Power_Authority_OnDestroyTwinChargePercentChanged) == 0x000010, "Wrong size on K22Power_Authority_OnDestroyTwinChargePercentChanged");
static_assert(offsetof(K22Power_Authority_OnDestroyTwinChargePercentChanged, chargeableComponent) == 0x000000, "Member 'K22Power_Authority_OnDestroyTwinChargePercentChanged::chargeableComponent' has a wrong offset!");
static_assert(offsetof(K22Power_Authority_OnDestroyTwinChargePercentChanged, percentCompletionChange) == 0x000008, "Member 'K22Power_Authority_OnDestroyTwinChargePercentChanged::percentCompletionChange' has a wrong offset!");
static_assert(offsetof(K22Power_Authority_OnDestroyTwinChargePercentChanged, totalPercentComplete) == 0x00000C, "Member 'K22Power_Authority_OnDestroyTwinChargePercentChanged::totalPercentComplete' has a wrong offset!");

// Function TheTwins.K22Power.Authority_OnPossessTwinChargePercentChanged
// 0x0010 (0x0010 - 0x0000)
struct K22Power_Authority_OnPossessTwinChargePercentChanged final
{
public:
	class UChargeableComponent*                   chargeableComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         percentCompletionChange;                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         totalPercentComplete;                              // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K22Power_Authority_OnPossessTwinChargePercentChanged) == 0x000008, "Wrong alignment on K22Power_Authority_OnPossessTwinChargePercentChanged");
static_assert(sizeof(K22Power_Authority_OnPossessTwinChargePercentChanged) == 0x000010, "Wrong size on K22Power_Authority_OnPossessTwinChargePercentChanged");
static_assert(offsetof(K22Power_Authority_OnPossessTwinChargePercentChanged, chargeableComponent) == 0x000000, "Member 'K22Power_Authority_OnPossessTwinChargePercentChanged::chargeableComponent' has a wrong offset!");
static_assert(offsetof(K22Power_Authority_OnPossessTwinChargePercentChanged, percentCompletionChange) == 0x000008, "Member 'K22Power_Authority_OnPossessTwinChargePercentChanged::percentCompletionChange' has a wrong offset!");
static_assert(offsetof(K22Power_Authority_OnPossessTwinChargePercentChanged, totalPercentComplete) == 0x00000C, "Member 'K22Power_Authority_OnPossessTwinChargePercentChanged::totalPercentComplete' has a wrong offset!");

// Function TheTwins.K22Power.GetConjoinedTwin
// 0x0008 (0x0008 - 0x0000)
struct K22Power_GetConjoinedTwin final
{
public:
	class AConjoinedTwin*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K22Power_GetConjoinedTwin) == 0x000008, "Wrong alignment on K22Power_GetConjoinedTwin");
static_assert(sizeof(K22Power_GetConjoinedTwin) == 0x000008, "Wrong size on K22Power_GetConjoinedTwin");
static_assert(offsetof(K22Power_GetConjoinedTwin, ReturnValue) == 0x000000, "Member 'K22Power_GetConjoinedTwin::ReturnValue' has a wrong offset!");

// Function TheTwins.K22PowerChargePresentationItemProgressComponent.OnTwinSet
// 0x0008 (0x0008 - 0x0000)
struct K22PowerChargePresentationItemProgressComponent_OnTwinSet final
{
public:
	class AConjoinedTwin*                         twin;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K22PowerChargePresentationItemProgressComponent_OnTwinSet) == 0x000008, "Wrong alignment on K22PowerChargePresentationItemProgressComponent_OnTwinSet");
static_assert(sizeof(K22PowerChargePresentationItemProgressComponent_OnTwinSet) == 0x000008, "Wrong size on K22PowerChargePresentationItemProgressComponent_OnTwinSet");
static_assert(offsetof(K22PowerChargePresentationItemProgressComponent_OnTwinSet, twin) == 0x000000, "Member 'K22PowerChargePresentationItemProgressComponent_OnTwinSet::twin' has a wrong offset!");

// Function TheTwins.PossessionComponent.Cosmetic_OnControlledChanged
// 0x0010 (0x0010 - 0x0000)
struct PossessionComponent_Cosmetic_OnControlledChanged final
{
public:
	class ADBDPlayer*                             player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isControlled;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PossessionComponent_Cosmetic_OnControlledChanged) == 0x000008, "Wrong alignment on PossessionComponent_Cosmetic_OnControlledChanged");
static_assert(sizeof(PossessionComponent_Cosmetic_OnControlledChanged) == 0x000010, "Wrong size on PossessionComponent_Cosmetic_OnControlledChanged");
static_assert(offsetof(PossessionComponent_Cosmetic_OnControlledChanged, player) == 0x000000, "Member 'PossessionComponent_Cosmetic_OnControlledChanged::player' has a wrong offset!");
static_assert(offsetof(PossessionComponent_Cosmetic_OnControlledChanged, isControlled) == 0x000008, "Member 'PossessionComponent_Cosmetic_OnControlledChanged::isControlled' has a wrong offset!");

// Function TheTwins.PossessionComponent.CosmeticLocal_OnControlled
// 0x0008 (0x0008 - 0x0000)
struct PossessionComponent_CosmeticLocal_OnControlled final
{
public:
	class ADBDPlayer*                             player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PossessionComponent_CosmeticLocal_OnControlled) == 0x000008, "Wrong alignment on PossessionComponent_CosmeticLocal_OnControlled");
static_assert(sizeof(PossessionComponent_CosmeticLocal_OnControlled) == 0x000008, "Wrong size on PossessionComponent_CosmeticLocal_OnControlled");
static_assert(offsetof(PossessionComponent_CosmeticLocal_OnControlled, player) == 0x000000, "Member 'PossessionComponent_CosmeticLocal_OnControlled::player' has a wrong offset!");

// Function TheTwins.PossessionComponent.CosmeticLocal_OnUncontrolled
// 0x0008 (0x0008 - 0x0000)
struct PossessionComponent_CosmeticLocal_OnUncontrolled final
{
public:
	class ADBDPlayer*                             player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PossessionComponent_CosmeticLocal_OnUncontrolled) == 0x000008, "Wrong alignment on PossessionComponent_CosmeticLocal_OnUncontrolled");
static_assert(sizeof(PossessionComponent_CosmeticLocal_OnUncontrolled) == 0x000008, "Wrong size on PossessionComponent_CosmeticLocal_OnUncontrolled");
static_assert(offsetof(PossessionComponent_CosmeticLocal_OnUncontrolled, player) == 0x000000, "Member 'PossessionComponent_CosmeticLocal_OnUncontrolled::player' has a wrong offset!");

// Function TheTwins.PossessionComponent.Multicast_StartPossessionOf
// 0x0008 (0x0008 - 0x0000)
struct PossessionComponent_Multicast_StartPossessionOf final
{
public:
	class ADBDPlayer*                             playerToPossess;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PossessionComponent_Multicast_StartPossessionOf) == 0x000008, "Wrong alignment on PossessionComponent_Multicast_StartPossessionOf");
static_assert(sizeof(PossessionComponent_Multicast_StartPossessionOf) == 0x000008, "Wrong size on PossessionComponent_Multicast_StartPossessionOf");
static_assert(offsetof(PossessionComponent_Multicast_StartPossessionOf, playerToPossess) == 0x000000, "Member 'PossessionComponent_Multicast_StartPossessionOf::playerToPossess' has a wrong offset!");

// Function TheTwins.PossessionComponent.Server_StartPossessionOf
// 0x0010 (0x0010 - 0x0000)
struct PossessionComponent_Server_StartPossessionOf final
{
public:
	class ADBDPlayer*                             playerToPossess;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          shouldStartBeingPossessedInteraction;              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PossessionComponent_Server_StartPossessionOf) == 0x000008, "Wrong alignment on PossessionComponent_Server_StartPossessionOf");
static_assert(sizeof(PossessionComponent_Server_StartPossessionOf) == 0x000010, "Wrong size on PossessionComponent_Server_StartPossessionOf");
static_assert(offsetof(PossessionComponent_Server_StartPossessionOf, playerToPossess) == 0x000000, "Member 'PossessionComponent_Server_StartPossessionOf::playerToPossess' has a wrong offset!");
static_assert(offsetof(PossessionComponent_Server_StartPossessionOf, shouldStartBeingPossessedInteraction) == 0x000008, "Member 'PossessionComponent_Server_StartPossessionOf::shouldStartBeingPossessedInteraction' has a wrong offset!");

// Function TheTwins.PossessionComponent.IsDormant
// 0x0001 (0x0001 - 0x0000)
struct PossessionComponent_IsDormant final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PossessionComponent_IsDormant) == 0x000001, "Wrong alignment on PossessionComponent_IsDormant");
static_assert(sizeof(PossessionComponent_IsDormant) == 0x000001, "Wrong size on PossessionComponent_IsDormant");
static_assert(offsetof(PossessionComponent_IsDormant, ReturnValue) == 0x000000, "Member 'PossessionComponent_IsDormant::ReturnValue' has a wrong offset!");

// Function TheTwins.PossessionComponent.IsPossessed
// 0x0001 (0x0001 - 0x0000)
struct PossessionComponent_IsPossessed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PossessionComponent_IsPossessed) == 0x000001, "Wrong alignment on PossessionComponent_IsPossessed");
static_assert(sizeof(PossessionComponent_IsPossessed) == 0x000001, "Wrong size on PossessionComponent_IsPossessed");
static_assert(offsetof(PossessionComponent_IsPossessed, ReturnValue) == 0x000000, "Member 'PossessionComponent_IsPossessed::ReturnValue' has a wrong offset!");

// Function TheTwins.KillerPossessNegationEffectComponent.OnTwinSet
// 0x0008 (0x0008 - 0x0000)
struct KillerPossessNegationEffectComponent_OnTwinSet final
{
public:
	class AConjoinedTwin*                         twin;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KillerPossessNegationEffectComponent_OnTwinSet) == 0x000008, "Wrong alignment on KillerPossessNegationEffectComponent_OnTwinSet");
static_assert(sizeof(KillerPossessNegationEffectComponent_OnTwinSet) == 0x000008, "Wrong size on KillerPossessNegationEffectComponent_OnTwinSet");
static_assert(offsetof(KillerPossessNegationEffectComponent_OnTwinSet, twin) == 0x000000, "Member 'KillerPossessNegationEffectComponent_OnTwinSet::twin' has a wrong offset!");

// Function TheTwins.PushTwinOnLockerInteraction.Authority_OnPlayerInLockerChanged
// 0x0010 (0x0010 - 0x0000)
struct PushTwinOnLockerInteraction_Authority_OnPlayerInLockerChanged final
{
public:
	class ADBDPlayer*                             previousPlayerInLocker;                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ADBDPlayer*                             newPlayerInLocker;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PushTwinOnLockerInteraction_Authority_OnPlayerInLockerChanged) == 0x000008, "Wrong alignment on PushTwinOnLockerInteraction_Authority_OnPlayerInLockerChanged");
static_assert(sizeof(PushTwinOnLockerInteraction_Authority_OnPlayerInLockerChanged) == 0x000010, "Wrong size on PushTwinOnLockerInteraction_Authority_OnPlayerInLockerChanged");
static_assert(offsetof(PushTwinOnLockerInteraction_Authority_OnPlayerInLockerChanged, previousPlayerInLocker) == 0x000000, "Member 'PushTwinOnLockerInteraction_Authority_OnPlayerInLockerChanged::previousPlayerInLocker' has a wrong offset!");
static_assert(offsetof(PushTwinOnLockerInteraction_Authority_OnPlayerInLockerChanged, newPlayerInLocker) == 0x000008, "Member 'PushTwinOnLockerInteraction_Authority_OnPlayerInLockerChanged::newPlayerInLocker' has a wrong offset!");

// Function TheTwins.PushTwinOnLockerInteraction.OnTwinSet
// 0x0008 (0x0008 - 0x0000)
struct PushTwinOnLockerInteraction_OnTwinSet final
{
public:
	class AConjoinedTwin*                         twin;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PushTwinOnLockerInteraction_OnTwinSet) == 0x000008, "Wrong alignment on PushTwinOnLockerInteraction_OnTwinSet");
static_assert(sizeof(PushTwinOnLockerInteraction_OnTwinSet) == 0x000008, "Wrong size on PushTwinOnLockerInteraction_OnTwinSet");
static_assert(offsetof(PushTwinOnLockerInteraction_OnTwinSet, twin) == 0x000000, "Member 'PushTwinOnLockerInteraction_OnTwinSet::twin' has a wrong offset!");

// Function TheTwins.RecallTwin.OnTwinSet
// 0x0008 (0x0008 - 0x0000)
struct RecallTwin_OnTwinSet final
{
public:
	class AConjoinedTwin*                         twin;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RecallTwin_OnTwinSet) == 0x000008, "Wrong alignment on RecallTwin_OnTwinSet");
static_assert(sizeof(RecallTwin_OnTwinSet) == 0x000008, "Wrong size on RecallTwin_OnTwinSet");
static_assert(offsetof(RecallTwin_OnTwinSet, twin) == 0x000000, "Member 'RecallTwin_OnTwinSet::twin' has a wrong offset!");

// Function TheTwins.ReleaseConjoinedTwin.Cosmetic_OnReleaseCancelled
// 0x0010 (0x0010 - 0x0000)
struct ReleaseConjoinedTwin_Cosmetic_OnReleaseCancelled final
{
public:
	class ADBDPlayer*                             sister;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AConjoinedTwin*                         brother;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ReleaseConjoinedTwin_Cosmetic_OnReleaseCancelled) == 0x000008, "Wrong alignment on ReleaseConjoinedTwin_Cosmetic_OnReleaseCancelled");
static_assert(sizeof(ReleaseConjoinedTwin_Cosmetic_OnReleaseCancelled) == 0x000010, "Wrong size on ReleaseConjoinedTwin_Cosmetic_OnReleaseCancelled");
static_assert(offsetof(ReleaseConjoinedTwin_Cosmetic_OnReleaseCancelled, sister) == 0x000000, "Member 'ReleaseConjoinedTwin_Cosmetic_OnReleaseCancelled::sister' has a wrong offset!");
static_assert(offsetof(ReleaseConjoinedTwin_Cosmetic_OnReleaseCancelled, brother) == 0x000008, "Member 'ReleaseConjoinedTwin_Cosmetic_OnReleaseCancelled::brother' has a wrong offset!");

// Function TheTwins.ReleaseConjoinedTwin.Cosmetic_OnReleaseChargeComplete
// 0x0010 (0x0010 - 0x0000)
struct ReleaseConjoinedTwin_Cosmetic_OnReleaseChargeComplete final
{
public:
	class ADBDPlayer*                             sister;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AConjoinedTwin*                         brother;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ReleaseConjoinedTwin_Cosmetic_OnReleaseChargeComplete) == 0x000008, "Wrong alignment on ReleaseConjoinedTwin_Cosmetic_OnReleaseChargeComplete");
static_assert(sizeof(ReleaseConjoinedTwin_Cosmetic_OnReleaseChargeComplete) == 0x000010, "Wrong size on ReleaseConjoinedTwin_Cosmetic_OnReleaseChargeComplete");
static_assert(offsetof(ReleaseConjoinedTwin_Cosmetic_OnReleaseChargeComplete, sister) == 0x000000, "Member 'ReleaseConjoinedTwin_Cosmetic_OnReleaseChargeComplete::sister' has a wrong offset!");
static_assert(offsetof(ReleaseConjoinedTwin_Cosmetic_OnReleaseChargeComplete, brother) == 0x000008, "Member 'ReleaseConjoinedTwin_Cosmetic_OnReleaseChargeComplete::brother' has a wrong offset!");

// Function TheTwins.ReleaseConjoinedTwin.Cosmetic_OnReleaseTwinInteractionUpdate
// 0x0018 (0x0018 - 0x0000)
struct ReleaseConjoinedTwin_Cosmetic_OnReleaseTwinInteractionUpdate final
{
public:
	class ADBDPlayer*                             sister;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AConjoinedTwin*                         brother;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         deltaTime;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ReleaseConjoinedTwin_Cosmetic_OnReleaseTwinInteractionUpdate) == 0x000008, "Wrong alignment on ReleaseConjoinedTwin_Cosmetic_OnReleaseTwinInteractionUpdate");
static_assert(sizeof(ReleaseConjoinedTwin_Cosmetic_OnReleaseTwinInteractionUpdate) == 0x000018, "Wrong size on ReleaseConjoinedTwin_Cosmetic_OnReleaseTwinInteractionUpdate");
static_assert(offsetof(ReleaseConjoinedTwin_Cosmetic_OnReleaseTwinInteractionUpdate, sister) == 0x000000, "Member 'ReleaseConjoinedTwin_Cosmetic_OnReleaseTwinInteractionUpdate::sister' has a wrong offset!");
static_assert(offsetof(ReleaseConjoinedTwin_Cosmetic_OnReleaseTwinInteractionUpdate, brother) == 0x000008, "Member 'ReleaseConjoinedTwin_Cosmetic_OnReleaseTwinInteractionUpdate::brother' has a wrong offset!");
static_assert(offsetof(ReleaseConjoinedTwin_Cosmetic_OnReleaseTwinInteractionUpdate, deltaTime) == 0x000010, "Member 'ReleaseConjoinedTwin_Cosmetic_OnReleaseTwinInteractionUpdate::deltaTime' has a wrong offset!");

// Function TheTwins.ReleaseConjoinedTwin.Cosmetic_OnReleaseTwinInteractionUpdateStart
// 0x0010 (0x0010 - 0x0000)
struct ReleaseConjoinedTwin_Cosmetic_OnReleaseTwinInteractionUpdateStart final
{
public:
	class ADBDPlayer*                             sister;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AConjoinedTwin*                         brother;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ReleaseConjoinedTwin_Cosmetic_OnReleaseTwinInteractionUpdateStart) == 0x000008, "Wrong alignment on ReleaseConjoinedTwin_Cosmetic_OnReleaseTwinInteractionUpdateStart");
static_assert(sizeof(ReleaseConjoinedTwin_Cosmetic_OnReleaseTwinInteractionUpdateStart) == 0x000010, "Wrong size on ReleaseConjoinedTwin_Cosmetic_OnReleaseTwinInteractionUpdateStart");
static_assert(offsetof(ReleaseConjoinedTwin_Cosmetic_OnReleaseTwinInteractionUpdateStart, sister) == 0x000000, "Member 'ReleaseConjoinedTwin_Cosmetic_OnReleaseTwinInteractionUpdateStart::sister' has a wrong offset!");
static_assert(offsetof(ReleaseConjoinedTwin_Cosmetic_OnReleaseTwinInteractionUpdateStart, brother) == 0x000008, "Member 'ReleaseConjoinedTwin_Cosmetic_OnReleaseTwinInteractionUpdateStart::brother' has a wrong offset!");

// Function TheTwins.ReleaseConjoinedTwin.OnKillerStunned
// 0x0038 (0x0038 - 0x0000)
struct ReleaseConjoinedTwin_OnKillerStunned final
{
public:
	struct FGameplayTag                           gameEventType;                                     // 0x0000(0x000C)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         gameEventData;                                     // 0x0010(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ReleaseConjoinedTwin_OnKillerStunned) == 0x000008, "Wrong alignment on ReleaseConjoinedTwin_OnKillerStunned");
static_assert(sizeof(ReleaseConjoinedTwin_OnKillerStunned) == 0x000038, "Wrong size on ReleaseConjoinedTwin_OnKillerStunned");
static_assert(offsetof(ReleaseConjoinedTwin_OnKillerStunned, gameEventType) == 0x000000, "Member 'ReleaseConjoinedTwin_OnKillerStunned::gameEventType' has a wrong offset!");
static_assert(offsetof(ReleaseConjoinedTwin_OnKillerStunned, gameEventData) == 0x000010, "Member 'ReleaseConjoinedTwin_OnKillerStunned::gameEventData' has a wrong offset!");

// Function TheTwins.ReleaseConjoinedTwin.OnPowerCollected
// 0x0008 (0x0008 - 0x0000)
struct ReleaseConjoinedTwin_OnPowerCollected final
{
public:
	class ADBDPlayer*                             collector;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ReleaseConjoinedTwin_OnPowerCollected) == 0x000008, "Wrong alignment on ReleaseConjoinedTwin_OnPowerCollected");
static_assert(sizeof(ReleaseConjoinedTwin_OnPowerCollected) == 0x000008, "Wrong size on ReleaseConjoinedTwin_OnPowerCollected");
static_assert(offsetof(ReleaseConjoinedTwin_OnPowerCollected, collector) == 0x000000, "Member 'ReleaseConjoinedTwin_OnPowerCollected::collector' has a wrong offset!");

// Function TheTwins.ReleaseConjoinedTwin.OnTwinSet
// 0x0008 (0x0008 - 0x0000)
struct ReleaseConjoinedTwin_OnTwinSet final
{
public:
	class AConjoinedTwin*                         twin;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ReleaseConjoinedTwin_OnTwinSet) == 0x000008, "Wrong alignment on ReleaseConjoinedTwin_OnTwinSet");
static_assert(sizeof(ReleaseConjoinedTwin_OnTwinSet) == 0x000008, "Wrong size on ReleaseConjoinedTwin_OnTwinSet");
static_assert(offsetof(ReleaseConjoinedTwin_OnTwinSet, twin) == 0x000000, "Member 'ReleaseConjoinedTwin_OnTwinSet::twin' has a wrong offset!");

// Function TheTwins.RemoveTwin.OnRemoveMontageEnd
// 0x0030 (0x0030 - 0x0000)
struct RemoveTwin_OnRemoveMontageEnd final
{
public:
	struct FAnimationMontageDescriptor            montage;                                           // 0x0000(0x0020)(ConstParm, Parm, NativeAccessSpecifierPublic)
	bool                                          interrupted;                                       // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             destroyingPlayer;                                  // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RemoveTwin_OnRemoveMontageEnd) == 0x000008, "Wrong alignment on RemoveTwin_OnRemoveMontageEnd");
static_assert(sizeof(RemoveTwin_OnRemoveMontageEnd) == 0x000030, "Wrong size on RemoveTwin_OnRemoveMontageEnd");
static_assert(offsetof(RemoveTwin_OnRemoveMontageEnd, montage) == 0x000000, "Member 'RemoveTwin_OnRemoveMontageEnd::montage' has a wrong offset!");
static_assert(offsetof(RemoveTwin_OnRemoveMontageEnd, interrupted) == 0x000020, "Member 'RemoveTwin_OnRemoveMontageEnd::interrupted' has a wrong offset!");
static_assert(offsetof(RemoveTwin_OnRemoveMontageEnd, destroyingPlayer) == 0x000028, "Member 'RemoveTwin_OnRemoveMontageEnd::destroyingPlayer' has a wrong offset!");

// Function TheTwins.SisterBlindFlashlightableLightingStrategy.OnTwinSet
// 0x0008 (0x0008 - 0x0000)
struct SisterBlindFlashlightableLightingStrategy_OnTwinSet final
{
public:
	class AConjoinedTwin*                         twin;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SisterBlindFlashlightableLightingStrategy_OnTwinSet) == 0x000008, "Wrong alignment on SisterBlindFlashlightableLightingStrategy_OnTwinSet");
static_assert(sizeof(SisterBlindFlashlightableLightingStrategy_OnTwinSet) == 0x000008, "Wrong size on SisterBlindFlashlightableLightingStrategy_OnTwinSet");
static_assert(offsetof(SisterBlindFlashlightableLightingStrategy_OnTwinSet, twin) == 0x000000, "Member 'SisterBlindFlashlightableLightingStrategy_OnTwinSet::twin' has a wrong offset!");

// Function TheTwins.TheTwinsCheatComponent.Multicast_TrySendThePlayerBackInKiller
// 0x0008 (0x0008 - 0x0000)
struct TheTwinsCheatComponent_Multicast_TrySendThePlayerBackInKiller final
{
public:
	class UTwinPossessionComponent*               twinPossessionComponent;                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TheTwinsCheatComponent_Multicast_TrySendThePlayerBackInKiller) == 0x000008, "Wrong alignment on TheTwinsCheatComponent_Multicast_TrySendThePlayerBackInKiller");
static_assert(sizeof(TheTwinsCheatComponent_Multicast_TrySendThePlayerBackInKiller) == 0x000008, "Wrong size on TheTwinsCheatComponent_Multicast_TrySendThePlayerBackInKiller");
static_assert(offsetof(TheTwinsCheatComponent_Multicast_TrySendThePlayerBackInKiller, twinPossessionComponent) == 0x000000, "Member 'TheTwinsCheatComponent_Multicast_TrySendThePlayerBackInKiller::twinPossessionComponent' has a wrong offset!");

// Function TheTwins.TwinAOELingeringStatusEffect.Authority_OnInRangeChanged
// 0x0001 (0x0001 - 0x0000)
struct TwinAOELingeringStatusEffect_Authority_OnInRangeChanged final
{
public:
	bool                                          inRange;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TwinAOELingeringStatusEffect_Authority_OnInRangeChanged) == 0x000001, "Wrong alignment on TwinAOELingeringStatusEffect_Authority_OnInRangeChanged");
static_assert(sizeof(TwinAOELingeringStatusEffect_Authority_OnInRangeChanged) == 0x000001, "Wrong size on TwinAOELingeringStatusEffect_Authority_OnInRangeChanged");
static_assert(offsetof(TwinAOELingeringStatusEffect_Authority_OnInRangeChanged, inRange) == 0x000000, "Member 'TwinAOELingeringStatusEffect_Authority_OnInRangeChanged::inRange' has a wrong offset!");

// Function TheTwins.TwinAttachmentComponent.Authority_OnRemoveTwinChargePercentChanged
// 0x0010 (0x0010 - 0x0000)
struct TwinAttachmentComponent_Authority_OnRemoveTwinChargePercentChanged final
{
public:
	class UChargeableComponent*                   chargeableComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         percentCompletionChange;                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         totalPercentComplete;                              // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TwinAttachmentComponent_Authority_OnRemoveTwinChargePercentChanged) == 0x000008, "Wrong alignment on TwinAttachmentComponent_Authority_OnRemoveTwinChargePercentChanged");
static_assert(sizeof(TwinAttachmentComponent_Authority_OnRemoveTwinChargePercentChanged) == 0x000010, "Wrong size on TwinAttachmentComponent_Authority_OnRemoveTwinChargePercentChanged");
static_assert(offsetof(TwinAttachmentComponent_Authority_OnRemoveTwinChargePercentChanged, chargeableComponent) == 0x000000, "Member 'TwinAttachmentComponent_Authority_OnRemoveTwinChargePercentChanged::chargeableComponent' has a wrong offset!");
static_assert(offsetof(TwinAttachmentComponent_Authority_OnRemoveTwinChargePercentChanged, percentCompletionChange) == 0x000008, "Member 'TwinAttachmentComponent_Authority_OnRemoveTwinChargePercentChanged::percentCompletionChange' has a wrong offset!");
static_assert(offsetof(TwinAttachmentComponent_Authority_OnRemoveTwinChargePercentChanged, totalPercentComplete) == 0x00000C, "Member 'TwinAttachmentComponent_Authority_OnRemoveTwinChargePercentChanged::totalPercentComplete' has a wrong offset!");

// Function TheTwins.TwinAttachmentComponent.Cosmetic_OnTwinAttachedToSister
// 0x0018 (0x0018 - 0x0000)
struct TwinAttachmentComponent_Cosmetic_OnTwinAttachedToSister final
{
public:
	class ADBDPlayer*                             sister;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ADBDPlayer*                             brother;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isFirstAttachment;                                 // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TwinAttachmentComponent_Cosmetic_OnTwinAttachedToSister) == 0x000008, "Wrong alignment on TwinAttachmentComponent_Cosmetic_OnTwinAttachedToSister");
static_assert(sizeof(TwinAttachmentComponent_Cosmetic_OnTwinAttachedToSister) == 0x000018, "Wrong size on TwinAttachmentComponent_Cosmetic_OnTwinAttachedToSister");
static_assert(offsetof(TwinAttachmentComponent_Cosmetic_OnTwinAttachedToSister, sister) == 0x000000, "Member 'TwinAttachmentComponent_Cosmetic_OnTwinAttachedToSister::sister' has a wrong offset!");
static_assert(offsetof(TwinAttachmentComponent_Cosmetic_OnTwinAttachedToSister, brother) == 0x000008, "Member 'TwinAttachmentComponent_Cosmetic_OnTwinAttachedToSister::brother' has a wrong offset!");
static_assert(offsetof(TwinAttachmentComponent_Cosmetic_OnTwinAttachedToSister, isFirstAttachment) == 0x000010, "Member 'TwinAttachmentComponent_Cosmetic_OnTwinAttachedToSister::isFirstAttachment' has a wrong offset!");

// Function TheTwins.TwinAttachmentComponent.Cosmetic_OnTwinAttachedToSurvivor
// 0x0010 (0x0010 - 0x0000)
struct TwinAttachmentComponent_Cosmetic_OnTwinAttachedToSurvivor final
{
public:
	class ADBDPlayer*                             survivor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ADBDPlayer*                             brother;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TwinAttachmentComponent_Cosmetic_OnTwinAttachedToSurvivor) == 0x000008, "Wrong alignment on TwinAttachmentComponent_Cosmetic_OnTwinAttachedToSurvivor");
static_assert(sizeof(TwinAttachmentComponent_Cosmetic_OnTwinAttachedToSurvivor) == 0x000010, "Wrong size on TwinAttachmentComponent_Cosmetic_OnTwinAttachedToSurvivor");
static_assert(offsetof(TwinAttachmentComponent_Cosmetic_OnTwinAttachedToSurvivor, survivor) == 0x000000, "Member 'TwinAttachmentComponent_Cosmetic_OnTwinAttachedToSurvivor::survivor' has a wrong offset!");
static_assert(offsetof(TwinAttachmentComponent_Cosmetic_OnTwinAttachedToSurvivor, brother) == 0x000008, "Member 'TwinAttachmentComponent_Cosmetic_OnTwinAttachedToSurvivor::brother' has a wrong offset!");

// Function TheTwins.TwinAttachmentComponent.Cosmetic_OnTwinDetachedFromSister
// 0x0010 (0x0010 - 0x0000)
struct TwinAttachmentComponent_Cosmetic_OnTwinDetachedFromSister final
{
public:
	class ADBDPlayer*                             sister;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ADBDPlayer*                             brother;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TwinAttachmentComponent_Cosmetic_OnTwinDetachedFromSister) == 0x000008, "Wrong alignment on TwinAttachmentComponent_Cosmetic_OnTwinDetachedFromSister");
static_assert(sizeof(TwinAttachmentComponent_Cosmetic_OnTwinDetachedFromSister) == 0x000010, "Wrong size on TwinAttachmentComponent_Cosmetic_OnTwinDetachedFromSister");
static_assert(offsetof(TwinAttachmentComponent_Cosmetic_OnTwinDetachedFromSister, sister) == 0x000000, "Member 'TwinAttachmentComponent_Cosmetic_OnTwinDetachedFromSister::sister' has a wrong offset!");
static_assert(offsetof(TwinAttachmentComponent_Cosmetic_OnTwinDetachedFromSister, brother) == 0x000008, "Member 'TwinAttachmentComponent_Cosmetic_OnTwinDetachedFromSister::brother' has a wrong offset!");

// Function TheTwins.TwinAttachmentComponent.Cosmetic_OnTwinDetachedFromSurvivor
// 0x0010 (0x0010 - 0x0000)
struct TwinAttachmentComponent_Cosmetic_OnTwinDetachedFromSurvivor final
{
public:
	class ADBDPlayer*                             survivor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ADBDPlayer*                             brother;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TwinAttachmentComponent_Cosmetic_OnTwinDetachedFromSurvivor) == 0x000008, "Wrong alignment on TwinAttachmentComponent_Cosmetic_OnTwinDetachedFromSurvivor");
static_assert(sizeof(TwinAttachmentComponent_Cosmetic_OnTwinDetachedFromSurvivor) == 0x000010, "Wrong size on TwinAttachmentComponent_Cosmetic_OnTwinDetachedFromSurvivor");
static_assert(offsetof(TwinAttachmentComponent_Cosmetic_OnTwinDetachedFromSurvivor, survivor) == 0x000000, "Member 'TwinAttachmentComponent_Cosmetic_OnTwinDetachedFromSurvivor::survivor' has a wrong offset!");
static_assert(offsetof(TwinAttachmentComponent_Cosmetic_OnTwinDetachedFromSurvivor, brother) == 0x000008, "Member 'TwinAttachmentComponent_Cosmetic_OnTwinDetachedFromSurvivor::brother' has a wrong offset!");

// Function TheTwins.TwinAttachmentComponent.OnAttachedSurvivorDamageStateChanged
// 0x0002 (0x0002 - 0x0000)
struct TwinAttachmentComponent_OnAttachedSurvivorDamageStateChanged final
{
public:
	ECamperDamageState                            oldState;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECamperDamageState                            newState;                                          // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TwinAttachmentComponent_OnAttachedSurvivorDamageStateChanged) == 0x000001, "Wrong alignment on TwinAttachmentComponent_OnAttachedSurvivorDamageStateChanged");
static_assert(sizeof(TwinAttachmentComponent_OnAttachedSurvivorDamageStateChanged) == 0x000002, "Wrong size on TwinAttachmentComponent_OnAttachedSurvivorDamageStateChanged");
static_assert(offsetof(TwinAttachmentComponent_OnAttachedSurvivorDamageStateChanged, oldState) == 0x000000, "Member 'TwinAttachmentComponent_OnAttachedSurvivorDamageStateChanged::oldState' has a wrong offset!");
static_assert(offsetof(TwinAttachmentComponent_OnAttachedSurvivorDamageStateChanged, newState) == 0x000001, "Member 'TwinAttachmentComponent_OnAttachedSurvivorDamageStateChanged::newState' has a wrong offset!");

// Function TheTwins.TwinAttachmentComponent.OnImmobilizedStateChanged
// 0x0002 (0x0002 - 0x0000)
struct TwinAttachmentComponent_OnImmobilizedStateChanged final
{
public:
	ECamperImmobilizeState                        oldImmobilizeState;                                // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECamperImmobilizeState                        newImmobilizeState;                                // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TwinAttachmentComponent_OnImmobilizedStateChanged) == 0x000001, "Wrong alignment on TwinAttachmentComponent_OnImmobilizedStateChanged");
static_assert(sizeof(TwinAttachmentComponent_OnImmobilizedStateChanged) == 0x000002, "Wrong size on TwinAttachmentComponent_OnImmobilizedStateChanged");
static_assert(offsetof(TwinAttachmentComponent_OnImmobilizedStateChanged, oldImmobilizeState) == 0x000000, "Member 'TwinAttachmentComponent_OnImmobilizedStateChanged::oldImmobilizeState' has a wrong offset!");
static_assert(offsetof(TwinAttachmentComponent_OnImmobilizedStateChanged, newImmobilizeState) == 0x000001, "Member 'TwinAttachmentComponent_OnImmobilizedStateChanged::newImmobilizeState' has a wrong offset!");

// Function TheTwins.TwinAttachmentComponent.OnMoriMontageEnd
// 0x0028 (0x0028 - 0x0000)
struct TwinAttachmentComponent_OnMoriMontageEnd final
{
public:
	struct FAnimationMontageDescriptor            montage;                                           // 0x0000(0x0020)(ConstParm, Parm, NativeAccessSpecifierPublic)
	bool                                          interrupted;                                       // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TwinAttachmentComponent_OnMoriMontageEnd) == 0x000008, "Wrong alignment on TwinAttachmentComponent_OnMoriMontageEnd");
static_assert(sizeof(TwinAttachmentComponent_OnMoriMontageEnd) == 0x000028, "Wrong size on TwinAttachmentComponent_OnMoriMontageEnd");
static_assert(offsetof(TwinAttachmentComponent_OnMoriMontageEnd, montage) == 0x000000, "Member 'TwinAttachmentComponent_OnMoriMontageEnd::montage' has a wrong offset!");
static_assert(offsetof(TwinAttachmentComponent_OnMoriMontageEnd, interrupted) == 0x000020, "Member 'TwinAttachmentComponent_OnMoriMontageEnd::interrupted' has a wrong offset!");

// Function TheTwins.TwinAttachmentComponent.OnRep_AttachedPlayer
// 0x0008 (0x0008 - 0x0000)
struct TwinAttachmentComponent_OnRep_AttachedPlayer final
{
public:
	class ADBDPlayer*                             oldAttachedPlayer;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TwinAttachmentComponent_OnRep_AttachedPlayer) == 0x000008, "Wrong alignment on TwinAttachmentComponent_OnRep_AttachedPlayer");
static_assert(sizeof(TwinAttachmentComponent_OnRep_AttachedPlayer) == 0x000008, "Wrong size on TwinAttachmentComponent_OnRep_AttachedPlayer");
static_assert(offsetof(TwinAttachmentComponent_OnRep_AttachedPlayer, oldAttachedPlayer) == 0x000000, "Member 'TwinAttachmentComponent_OnRep_AttachedPlayer::oldAttachedPlayer' has a wrong offset!");

// Function TheTwins.TwinAttachmentComponent.IsAttachedToSister
// 0x0001 (0x0001 - 0x0000)
struct TwinAttachmentComponent_IsAttachedToSister final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TwinAttachmentComponent_IsAttachedToSister) == 0x000001, "Wrong alignment on TwinAttachmentComponent_IsAttachedToSister");
static_assert(sizeof(TwinAttachmentComponent_IsAttachedToSister) == 0x000001, "Wrong size on TwinAttachmentComponent_IsAttachedToSister");
static_assert(offsetof(TwinAttachmentComponent_IsAttachedToSister, ReturnValue) == 0x000000, "Member 'TwinAttachmentComponent_IsAttachedToSister::ReturnValue' has a wrong offset!");

// Function TheTwins.TwinAttachmentComponent.IsAttachedToSurvivor
// 0x0001 (0x0001 - 0x0000)
struct TwinAttachmentComponent_IsAttachedToSurvivor final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TwinAttachmentComponent_IsAttachedToSurvivor) == 0x000001, "Wrong alignment on TwinAttachmentComponent_IsAttachedToSurvivor");
static_assert(sizeof(TwinAttachmentComponent_IsAttachedToSurvivor) == 0x000001, "Wrong size on TwinAttachmentComponent_IsAttachedToSurvivor");
static_assert(offsetof(TwinAttachmentComponent_IsAttachedToSurvivor, ReturnValue) == 0x000000, "Member 'TwinAttachmentComponent_IsAttachedToSurvivor::ReturnValue' has a wrong offset!");

// Function TheTwins.TwinBaseAddon.Authority_OnTwinSet
// 0x0008 (0x0008 - 0x0000)
struct TwinBaseAddon_Authority_OnTwinSet final
{
public:
	class AConjoinedTwin*                         twin;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TwinBaseAddon_Authority_OnTwinSet) == 0x000008, "Wrong alignment on TwinBaseAddon_Authority_OnTwinSet");
static_assert(sizeof(TwinBaseAddon_Authority_OnTwinSet) == 0x000008, "Wrong size on TwinBaseAddon_Authority_OnTwinSet");
static_assert(offsetof(TwinBaseAddon_Authority_OnTwinSet, twin) == 0x000000, "Member 'TwinBaseAddon_Authority_OnTwinSet::twin' has a wrong offset!");

// Function TheTwins.TwinBaseKillerInstinctEffect.Authority_OnInRangeChanged
// 0x0001 (0x0001 - 0x0000)
struct TwinBaseKillerInstinctEffect_Authority_OnInRangeChanged final
{
public:
	bool                                          inRange;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TwinBaseKillerInstinctEffect_Authority_OnInRangeChanged) == 0x000001, "Wrong alignment on TwinBaseKillerInstinctEffect_Authority_OnInRangeChanged");
static_assert(sizeof(TwinBaseKillerInstinctEffect_Authority_OnInRangeChanged) == 0x000001, "Wrong size on TwinBaseKillerInstinctEffect_Authority_OnInRangeChanged");
static_assert(offsetof(TwinBaseKillerInstinctEffect_Authority_OnInRangeChanged, inRange) == 0x000000, "Member 'TwinBaseKillerInstinctEffect_Authority_OnInRangeChanged::inRange' has a wrong offset!");

// Function TheTwins.TwinDestructionComponent.Cosmetic_OnTwinDestroyedFromKick
// 0x0008 (0x0008 - 0x0000)
struct TwinDestructionComponent_Cosmetic_OnTwinDestroyedFromKick final
{
public:
