#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TileBase01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DeadByDaylight_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TileBase01.TileBase01_C
// 0x0198 (0x04E0 - 0x0348)
class ATileBase01_C final : public ATile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Breakables;                                        // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        GeneratorDrivenObjects;                            // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Audio;                                             // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        PullObjects;                                       // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          BottomLeftSpawner;                                 // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          TopLeftSpawner;                                    // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          TopRightSpawner;                                   // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          BottomRightSpawner;                                // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        QuadrantSpawners;                                  // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          EdgeObjectBlocker;                                 // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        VaultObjects;                                      // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Crows;                                             // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        EdgeObjects;                                       // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Lockers;                                           // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        HideGrass;                                         // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Blockers;                                          // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Gameplay;                                          // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Lights;                                            // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_Effect_Mist04;                                  // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_Effect_Mist03;                                  // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_Effect_Mist02;                                  // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_Effect_Mist01;                                  // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Mist__BP_Effect_Mist_;                             // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        FX;                                                // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Deco;                                              // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          SearchableSpawner;                                 // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          SmallMeatLockerSpawner;                            // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          HatchSpawner;                                      // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow6;                                            // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTileSpawnPoint*                        InteractableSpawn01;                               // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow7;                                            // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          HexSpawner01;                                      // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTileSpawnPoint*                        SurvivorItemSpawn01;                               // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow5;                                            // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTileSpawnPoint*                        KillerItemSpawn01;                                 // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow4;                                            // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTileSpawnPoint*                        KillerSpawn01;                                     // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow2;                                            // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTileSpawnPoint*                        SurvivorSpawn04;                                   // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow1;                                            // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTileSpawnPoint*                        SurvivorSpawn03;                                   // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTileSpawnPoint*                        SurvivorSpawn02;                                   // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow3;                                            // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTileSpawnPoint*                        SurvivorSpawn01;                                   // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SpawnPoints;                                       // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Initialized;                                       // 0x04C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C9[0x3];                                      // 0x04C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TotalWeight;                                       // 0x04CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SelectedWeight;                                    // 0x04D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D4[0x4];                                      // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTileSpawnPoint*                        SelectedSpawnPoint;                                // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TileBase01(int32 EntryPoint);
	void KNY_StartSnowstorm();
	void SetGeneratorDrivenScoreEvent(const TArray<class AActor*>& Generators);
	void SetGeneratorDrivenObjects(class UTileSpawnPoint* SpawnPoint, class AActor* SpawnedObject);
	void OnLevelLoaded();
	void ReceiveTick(float DeltaSeconds);
	void SetupGeneratorDrivenElements(class AActor* GeneratorSpawnPoint, TArray<class UChildActorComponent*>& GeneratorDrivenElements);
	void SelectSpawnpoint(TArray<class UTileSpawnPoint*>& Array);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TileBase01_C">();
	}
	static class ATileBase01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATileBase01_C>();
	}
};
static_assert(alignof(ATileBase01_C) == 0x000008, "Wrong alignment on ATileBase01_C");
static_assert(sizeof(ATileBase01_C) == 0x0004E0, "Wrong size on ATileBase01_C");
static_assert(offsetof(ATileBase01_C, UberGraphFrame) == 0x000348, "Member 'ATileBase01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, Breakables) == 0x000350, "Member 'ATileBase01_C::Breakables' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, GeneratorDrivenObjects) == 0x000358, "Member 'ATileBase01_C::GeneratorDrivenObjects' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, Audio) == 0x000360, "Member 'ATileBase01_C::Audio' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, PullObjects) == 0x000368, "Member 'ATileBase01_C::PullObjects' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, BottomLeftSpawner) == 0x000370, "Member 'ATileBase01_C::BottomLeftSpawner' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, TopLeftSpawner) == 0x000378, "Member 'ATileBase01_C::TopLeftSpawner' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, TopRightSpawner) == 0x000380, "Member 'ATileBase01_C::TopRightSpawner' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, BottomRightSpawner) == 0x000388, "Member 'ATileBase01_C::BottomRightSpawner' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, QuadrantSpawners) == 0x000390, "Member 'ATileBase01_C::QuadrantSpawners' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, EdgeObjectBlocker) == 0x000398, "Member 'ATileBase01_C::EdgeObjectBlocker' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, VaultObjects) == 0x0003A0, "Member 'ATileBase01_C::VaultObjects' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, Crows) == 0x0003A8, "Member 'ATileBase01_C::Crows' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, EdgeObjects) == 0x0003B0, "Member 'ATileBase01_C::EdgeObjects' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, Lockers) == 0x0003B8, "Member 'ATileBase01_C::Lockers' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, HideGrass) == 0x0003C0, "Member 'ATileBase01_C::HideGrass' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, Blockers) == 0x0003C8, "Member 'ATileBase01_C::Blockers' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, Gameplay) == 0x0003D0, "Member 'ATileBase01_C::Gameplay' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, Lights) == 0x0003D8, "Member 'ATileBase01_C::Lights' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, BP_Effect_Mist04) == 0x0003E0, "Member 'ATileBase01_C::BP_Effect_Mist04' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, BP_Effect_Mist03) == 0x0003E8, "Member 'ATileBase01_C::BP_Effect_Mist03' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, BP_Effect_Mist02) == 0x0003F0, "Member 'ATileBase01_C::BP_Effect_Mist02' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, BP_Effect_Mist01) == 0x0003F8, "Member 'ATileBase01_C::BP_Effect_Mist01' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, Mist__BP_Effect_Mist_) == 0x000400, "Member 'ATileBase01_C::Mist__BP_Effect_Mist_' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, FX) == 0x000408, "Member 'ATileBase01_C::FX' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, Deco) == 0x000410, "Member 'ATileBase01_C::Deco' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, SearchableSpawner) == 0x000418, "Member 'ATileBase01_C::SearchableSpawner' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, SmallMeatLockerSpawner) == 0x000420, "Member 'ATileBase01_C::SmallMeatLockerSpawner' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, HatchSpawner) == 0x000428, "Member 'ATileBase01_C::HatchSpawner' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, Arrow6) == 0x000430, "Member 'ATileBase01_C::Arrow6' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, InteractableSpawn01) == 0x000438, "Member 'ATileBase01_C::InteractableSpawn01' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, Arrow7) == 0x000440, "Member 'ATileBase01_C::Arrow7' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, HexSpawner01) == 0x000448, "Member 'ATileBase01_C::HexSpawner01' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, SurvivorItemSpawn01) == 0x000450, "Member 'ATileBase01_C::SurvivorItemSpawn01' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, Arrow5) == 0x000458, "Member 'ATileBase01_C::Arrow5' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, KillerItemSpawn01) == 0x000460, "Member 'ATileBase01_C::KillerItemSpawn01' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, Arrow4) == 0x000468, "Member 'ATileBase01_C::Arrow4' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, KillerSpawn01) == 0x000470, "Member 'ATileBase01_C::KillerSpawn01' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, Arrow2) == 0x000478, "Member 'ATileBase01_C::Arrow2' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, SurvivorSpawn04) == 0x000480, "Member 'ATileBase01_C::SurvivorSpawn04' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, Arrow1) == 0x000488, "Member 'ATileBase01_C::Arrow1' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, SurvivorSpawn03) == 0x000490, "Member 'ATileBase01_C::SurvivorSpawn03' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, Arrow) == 0x000498, "Member 'ATileBase01_C::Arrow' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, SurvivorSpawn02) == 0x0004A0, "Member 'ATileBase01_C::SurvivorSpawn02' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, Arrow3) == 0x0004A8, "Member 'ATileBase01_C::Arrow3' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, SurvivorSpawn01) == 0x0004B0, "Member 'ATileBase01_C::SurvivorSpawn01' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, SpawnPoints) == 0x0004B8, "Member 'ATileBase01_C::SpawnPoints' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, Root) == 0x0004C0, "Member 'ATileBase01_C::Root' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, Initialized) == 0x0004C8, "Member 'ATileBase01_C::Initialized' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, TotalWeight) == 0x0004CC, "Member 'ATileBase01_C::TotalWeight' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, SelectedWeight) == 0x0004D0, "Member 'ATileBase01_C::SelectedWeight' has a wrong offset!");
static_assert(offsetof(ATileBase01_C, SelectedSpawnPoint) == 0x0004D8, "Member 'ATileBase01_C::SelectedSpawnPoint' has a wrong offset!");

}

