#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TileUtilities

#include "Basic.hpp"

#include "DeadByDaylight_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TileUtilities.TileUtilities_C.SelectSpawnPoint
// 0x00A0 (0x00A0 - 0x0000)
struct TileUtilities_C_SelectSpawnPoint final
{
public:
	TArray<class UTileSpawnPoint*>                SpawnPoints;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FRandomStream                          Stream;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTileSpawnPoint*                        SelectedSpawnPoint;                                // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SelectedWeight;                                    // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalWeight;                                       // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatFromStream_ReturnValue;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTileSpawnPoint*                        CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTileSpawnPoint*                        CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTileSpawnPoint*                        CallFunc_Array_Get_Item_2;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83[0x1];                                       // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TileUtilities_C_SelectSpawnPoint) == 0x000008, "Wrong alignment on TileUtilities_C_SelectSpawnPoint");
static_assert(sizeof(TileUtilities_C_SelectSpawnPoint) == 0x0000A0, "Wrong size on TileUtilities_C_SelectSpawnPoint");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, SpawnPoints) == 0x000000, "Member 'TileUtilities_C_SelectSpawnPoint::SpawnPoints' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, Stream) == 0x000010, "Member 'TileUtilities_C_SelectSpawnPoint::Stream' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, __WorldContext) == 0x000018, "Member 'TileUtilities_C_SelectSpawnPoint::__WorldContext' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, SelectedSpawnPoint) == 0x000020, "Member 'TileUtilities_C_SelectSpawnPoint::SelectedSpawnPoint' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, SelectedWeight) == 0x000028, "Member 'TileUtilities_C_SelectSpawnPoint::SelectedWeight' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, TotalWeight) == 0x00002C, "Member 'TileUtilities_C_SelectSpawnPoint::TotalWeight' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, Temp_int_Array_Index_Variable) == 0x000030, "Member 'TileUtilities_C_SelectSpawnPoint::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, CallFunc_RandomFloatFromStream_ReturnValue) == 0x000034, "Member 'TileUtilities_C_SelectSpawnPoint::CallFunc_RandomFloatFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, CallFunc_Array_Get_Item) == 0x000038, "Member 'TileUtilities_C_SelectSpawnPoint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'TileUtilities_C_SelectSpawnPoint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, CallFunc_Array_Length_ReturnValue_1) == 0x000044, "Member 'TileUtilities_C_SelectSpawnPoint::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, CallFunc_Array_Length_ReturnValue_2) == 0x000048, "Member 'TileUtilities_C_SelectSpawnPoint::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'TileUtilities_C_SelectSpawnPoint::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'TileUtilities_C_SelectSpawnPoint::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'TileUtilities_C_SelectSpawnPoint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, Temp_int_Array_Index_Variable_1) == 0x000058, "Member 'TileUtilities_C_SelectSpawnPoint::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, Temp_int_Array_Index_Variable_2) == 0x00005C, "Member 'TileUtilities_C_SelectSpawnPoint::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'TileUtilities_C_SelectSpawnPoint::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, CallFunc_Array_Get_Item_2) == 0x000068, "Member 'TileUtilities_C_SelectSpawnPoint::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'TileUtilities_C_SelectSpawnPoint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, CallFunc_IsValid_ReturnValue_1) == 0x000071, "Member 'TileUtilities_C_SelectSpawnPoint::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000072, "Member 'TileUtilities_C_SelectSpawnPoint::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000073, "Member 'TileUtilities_C_SelectSpawnPoint::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000074, "Member 'TileUtilities_C_SelectSpawnPoint::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, CallFunc_BooleanAND_ReturnValue) == 0x000078, "Member 'TileUtilities_C_SelectSpawnPoint::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, Temp_int_Loop_Counter_Variable_1) == 0x00007C, "Member 'TileUtilities_C_SelectSpawnPoint::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, Temp_bool_True_if_break_was_hit_Variable) == 0x000080, "Member 'TileUtilities_C_SelectSpawnPoint::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, CallFunc_Not_PreBool_ReturnValue) == 0x000081, "Member 'TileUtilities_C_SelectSpawnPoint::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, CallFunc_Less_IntInt_ReturnValue_1) == 0x000082, "Member 'TileUtilities_C_SelectSpawnPoint::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, CallFunc_Add_IntInt_ReturnValue_1) == 0x000084, "Member 'TileUtilities_C_SelectSpawnPoint::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000088, "Member 'TileUtilities_C_SelectSpawnPoint::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00008C, "Member 'TileUtilities_C_SelectSpawnPoint::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, Temp_int_Loop_Counter_Variable_2) == 0x000090, "Member 'TileUtilities_C_SelectSpawnPoint::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, CallFunc_Add_FloatFloat_ReturnValue) == 0x000094, "Member 'TileUtilities_C_SelectSpawnPoint::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, CallFunc_Less_IntInt_ReturnValue_2) == 0x000098, "Member 'TileUtilities_C_SelectSpawnPoint::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, CallFunc_BooleanAND_ReturnValue_1) == 0x000099, "Member 'TileUtilities_C_SelectSpawnPoint::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawnPoint, CallFunc_Add_IntInt_ReturnValue_2) == 0x00009C, "Member 'TileUtilities_C_SelectSpawnPoint::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

// Function TileUtilities.TileUtilities_C.SetupGeneratorDrivenElements
// 0x0078 (0x0078 - 0x0000)
struct TileUtilities_C_SetupGeneratorDrivenElements final
{
public:
	TArray<class UChildActorComponent*>           SpawnPoints;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AActor*                                 GeneratorSpawnPoint;                               // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GeneratorId;                                       // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGenerator*                             K2Node_DynamicCast_AsGenerator;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_K2_GetChildActor_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGeneratorDrivenActor*                  K2Node_DynamicCast_AsGenerator_Driven_Actor;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TileUtilities_C_SetupGeneratorDrivenElements) == 0x000008, "Wrong alignment on TileUtilities_C_SetupGeneratorDrivenElements");
static_assert(sizeof(TileUtilities_C_SetupGeneratorDrivenElements) == 0x000078, "Wrong size on TileUtilities_C_SetupGeneratorDrivenElements");
static_assert(offsetof(TileUtilities_C_SetupGeneratorDrivenElements, SpawnPoints) == 0x000000, "Member 'TileUtilities_C_SetupGeneratorDrivenElements::SpawnPoints' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SetupGeneratorDrivenElements, GeneratorSpawnPoint) == 0x000010, "Member 'TileUtilities_C_SetupGeneratorDrivenElements::GeneratorSpawnPoint' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SetupGeneratorDrivenElements, GeneratorId) == 0x000018, "Member 'TileUtilities_C_SetupGeneratorDrivenElements::GeneratorId' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SetupGeneratorDrivenElements, __WorldContext) == 0x000020, "Member 'TileUtilities_C_SetupGeneratorDrivenElements::__WorldContext' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SetupGeneratorDrivenElements, Temp_int_Array_Index_Variable) == 0x000028, "Member 'TileUtilities_C_SetupGeneratorDrivenElements::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SetupGeneratorDrivenElements, K2Node_DynamicCast_AsGenerator) == 0x000030, "Member 'TileUtilities_C_SetupGeneratorDrivenElements::K2Node_DynamicCast_AsGenerator' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SetupGeneratorDrivenElements, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'TileUtilities_C_SetupGeneratorDrivenElements::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SetupGeneratorDrivenElements, CallFunc_Array_Get_Item) == 0x000040, "Member 'TileUtilities_C_SetupGeneratorDrivenElements::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SetupGeneratorDrivenElements, CallFunc_K2_GetChildActor_ReturnValue) == 0x000048, "Member 'TileUtilities_C_SetupGeneratorDrivenElements::CallFunc_K2_GetChildActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SetupGeneratorDrivenElements, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'TileUtilities_C_SetupGeneratorDrivenElements::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SetupGeneratorDrivenElements, K2Node_DynamicCast_AsGenerator_Driven_Actor) == 0x000058, "Member 'TileUtilities_C_SetupGeneratorDrivenElements::K2Node_DynamicCast_AsGenerator_Driven_Actor' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SetupGeneratorDrivenElements, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'TileUtilities_C_SetupGeneratorDrivenElements::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SetupGeneratorDrivenElements, CallFunc_IsValid_ReturnValue_1) == 0x000061, "Member 'TileUtilities_C_SetupGeneratorDrivenElements::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SetupGeneratorDrivenElements, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'TileUtilities_C_SetupGeneratorDrivenElements::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SetupGeneratorDrivenElements, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'TileUtilities_C_SetupGeneratorDrivenElements::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SetupGeneratorDrivenElements, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'TileUtilities_C_SetupGeneratorDrivenElements::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SetupGeneratorDrivenElements, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'TileUtilities_C_SetupGeneratorDrivenElements::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function TileUtilities.TileUtilities_C.SelectSpawner
// 0x00B0 (0x00B0 - 0x0000)
struct TileUtilities_C_SelectSpawner final
{
public:
	TArray<class UActorSpawner*>                  spawners;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FRandomStream                          Stream;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalWeight;                                       // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SelectedWeight;                                    // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          SelectedSpawner;                                   // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewLocalVar_0;                                     // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatFromStream_ReturnValue;        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorSpawner*                          CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorSpawner*                          CallFunc_Array_Get_Item_2;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TileUtilities_C_SelectSpawner) == 0x000008, "Wrong alignment on TileUtilities_C_SelectSpawner");
static_assert(sizeof(TileUtilities_C_SelectSpawner) == 0x0000B0, "Wrong size on TileUtilities_C_SelectSpawner");
static_assert(offsetof(TileUtilities_C_SelectSpawner, spawners) == 0x000000, "Member 'TileUtilities_C_SelectSpawner::spawners' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, Stream) == 0x000010, "Member 'TileUtilities_C_SelectSpawner::Stream' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, __WorldContext) == 0x000018, "Member 'TileUtilities_C_SelectSpawner::__WorldContext' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, TotalWeight) == 0x000020, "Member 'TileUtilities_C_SelectSpawner::TotalWeight' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, SelectedWeight) == 0x000024, "Member 'TileUtilities_C_SelectSpawner::SelectedWeight' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, SelectedSpawner) == 0x000028, "Member 'TileUtilities_C_SelectSpawner::SelectedSpawner' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, NewLocalVar_0) == 0x000030, "Member 'TileUtilities_C_SelectSpawner::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, Temp_int_Array_Index_Variable) == 0x000034, "Member 'TileUtilities_C_SelectSpawner::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, CallFunc_RandomFloatFromStream_ReturnValue) == 0x000038, "Member 'TileUtilities_C_SelectSpawner::CallFunc_RandomFloatFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, CallFunc_Array_Get_Item) == 0x000040, "Member 'TileUtilities_C_SelectSpawner::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'TileUtilities_C_SelectSpawner::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, CallFunc_Array_Length_ReturnValue_1) == 0x00004C, "Member 'TileUtilities_C_SelectSpawner::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, CallFunc_Array_Length_ReturnValue_2) == 0x000050, "Member 'TileUtilities_C_SelectSpawner::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'TileUtilities_C_SelectSpawner::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'TileUtilities_C_SelectSpawner::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'TileUtilities_C_SelectSpawner::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, Temp_int_Array_Index_Variable_1) == 0x000060, "Member 'TileUtilities_C_SelectSpawner::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, Temp_int_Loop_Counter_Variable_1) == 0x000064, "Member 'TileUtilities_C_SelectSpawner::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'TileUtilities_C_SelectSpawner::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, CallFunc_Less_IntInt_ReturnValue_1) == 0x000070, "Member 'TileUtilities_C_SelectSpawner::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, CallFunc_Add_IntInt_ReturnValue_1) == 0x000074, "Member 'TileUtilities_C_SelectSpawner::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, Temp_int_Array_Index_Variable_2) == 0x000078, "Member 'TileUtilities_C_SelectSpawner::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, CallFunc_Array_Get_Item_2) == 0x000080, "Member 'TileUtilities_C_SelectSpawner::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000088, "Member 'TileUtilities_C_SelectSpawner::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x00008C, "Member 'TileUtilities_C_SelectSpawner::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, CallFunc_Add_FloatFloat_ReturnValue) == 0x000090, "Member 'TileUtilities_C_SelectSpawner::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000094, "Member 'TileUtilities_C_SelectSpawner::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, Temp_bool_True_if_break_was_hit_Variable) == 0x000098, "Member 'TileUtilities_C_SelectSpawner::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000099, "Member 'TileUtilities_C_SelectSpawner::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, CallFunc_BooleanAND_ReturnValue) == 0x00009A, "Member 'TileUtilities_C_SelectSpawner::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, CallFunc_Not_PreBool_ReturnValue) == 0x00009B, "Member 'TileUtilities_C_SelectSpawner::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, CallFunc_BooleanAND_ReturnValue_1) == 0x00009C, "Member 'TileUtilities_C_SelectSpawner::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00009D, "Member 'TileUtilities_C_SelectSpawner::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, Temp_int_Loop_Counter_Variable_2) == 0x0000A0, "Member 'TileUtilities_C_SelectSpawner::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000A4, "Member 'TileUtilities_C_SelectSpawner::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawner, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000A8, "Member 'TileUtilities_C_SelectSpawner::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

// Function TileUtilities.TileUtilities_C.SelectSpawners
// 0x0050 (0x0050 - 0x0000)
struct TileUtilities_C_SelectSpawners final
{
public:
	TArray<class UActorSpawner*>                  Spawners;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	int32                                         MinCount;                                          // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxCount;                                          // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          Stream;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TileUtilities_C_SelectSpawners) == 0x000008, "Wrong alignment on TileUtilities_C_SelectSpawners");
static_assert(sizeof(TileUtilities_C_SelectSpawners) == 0x000050, "Wrong size on TileUtilities_C_SelectSpawners");
static_assert(offsetof(TileUtilities_C_SelectSpawners, Spawners) == 0x000000, "Member 'TileUtilities_C_SelectSpawners::Spawners' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawners, MinCount) == 0x000010, "Member 'TileUtilities_C_SelectSpawners::MinCount' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawners, MaxCount) == 0x000014, "Member 'TileUtilities_C_SelectSpawners::MaxCount' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawners, Stream) == 0x000018, "Member 'TileUtilities_C_SelectSpawners::Stream' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawners, __WorldContext) == 0x000020, "Member 'TileUtilities_C_SelectSpawners::__WorldContext' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawners, Temp_int_Array_Index_Variable) == 0x000028, "Member 'TileUtilities_C_SelectSpawners::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawners, CallFunc_RandomIntegerInRange_ReturnValue) == 0x00002C, "Member 'TileUtilities_C_SelectSpawners::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawners, CallFunc_Array_Get_Item) == 0x000030, "Member 'TileUtilities_C_SelectSpawners::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawners, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000038, "Member 'TileUtilities_C_SelectSpawners::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawners, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'TileUtilities_C_SelectSpawners::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawners, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'TileUtilities_C_SelectSpawners::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawners, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'TileUtilities_C_SelectSpawners::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_SelectSpawners, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'TileUtilities_C_SelectSpawners::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function TileUtilities.TileUtilities_C.CallForSpawn
// 0x0068 (0x0068 - 0x0000)
struct TileUtilities_C_CallForSpawn final
{
public:
	class UActorSpawner*                          ActorSpawner;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseActivatedElement_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActorSpawnerProperties                K2Node_MakeStruct_ActorSpawnerProperties;          // 0x0018(0x0038)()
	TArray<struct FActorSpawnerProperties>        K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TileUtilities_C_CallForSpawn) == 0x000008, "Wrong alignment on TileUtilities_C_CallForSpawn");
static_assert(sizeof(TileUtilities_C_CallForSpawn) == 0x000068, "Wrong size on TileUtilities_C_CallForSpawn");
static_assert(offsetof(TileUtilities_C_CallForSpawn, ActorSpawner) == 0x000000, "Member 'TileUtilities_C_CallForSpawn::ActorSpawner' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_CallForSpawn, __WorldContext) == 0x000008, "Member 'TileUtilities_C_CallForSpawn::__WorldContext' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_CallForSpawn, CallFunc_UseActivatedElement_ReturnValue) == 0x000010, "Member 'TileUtilities_C_CallForSpawn::CallFunc_UseActivatedElement_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_CallForSpawn, K2Node_MakeStruct_ActorSpawnerProperties) == 0x000018, "Member 'TileUtilities_C_CallForSpawn::K2Node_MakeStruct_ActorSpawnerProperties' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_CallForSpawn, K2Node_MakeArray_Array) == 0x000050, "Member 'TileUtilities_C_CallForSpawn::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_CallForSpawn, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'TileUtilities_C_CallForSpawn::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function TileUtilities.TileUtilities_C.CheckGenerator
// 0x0020 (0x0020 - 0x0000)
struct TileUtilities_C_CheckGenerator final
{
public:
	class UTileSpawnPoint*                        SpawnPoint;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 SpawnedObject;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Initialized;                                       // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ComponentHasTag_ReturnValue;              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TileUtilities_C_CheckGenerator) == 0x000008, "Wrong alignment on TileUtilities_C_CheckGenerator");
static_assert(sizeof(TileUtilities_C_CheckGenerator) == 0x000020, "Wrong size on TileUtilities_C_CheckGenerator");
static_assert(offsetof(TileUtilities_C_CheckGenerator, SpawnPoint) == 0x000000, "Member 'TileUtilities_C_CheckGenerator::SpawnPoint' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_CheckGenerator, SpawnedObject) == 0x000008, "Member 'TileUtilities_C_CheckGenerator::SpawnedObject' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_CheckGenerator, __WorldContext) == 0x000010, "Member 'TileUtilities_C_CheckGenerator::__WorldContext' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_CheckGenerator, Initialized) == 0x000018, "Member 'TileUtilities_C_CheckGenerator::Initialized' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_CheckGenerator, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'TileUtilities_C_CheckGenerator::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_CheckGenerator, CallFunc_ComponentHasTag_ReturnValue) == 0x00001A, "Member 'TileUtilities_C_CheckGenerator::CallFunc_ComponentHasTag_ReturnValue' has a wrong offset!");

// Function TileUtilities.TileUtilities_C.CheckBasement
// 0x0020 (0x0020 - 0x0000)
struct TileUtilities_C_CheckBasement final
{
public:
	class UTileSpawnPoint*                        SpawnPoint;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 SpawnedObject;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Initialized2;                                      // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Initialized;                                       // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ComponentHasTag_ReturnValue;              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TileUtilities_C_CheckBasement) == 0x000008, "Wrong alignment on TileUtilities_C_CheckBasement");
static_assert(sizeof(TileUtilities_C_CheckBasement) == 0x000020, "Wrong size on TileUtilities_C_CheckBasement");
static_assert(offsetof(TileUtilities_C_CheckBasement, SpawnPoint) == 0x000000, "Member 'TileUtilities_C_CheckBasement::SpawnPoint' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_CheckBasement, SpawnedObject) == 0x000008, "Member 'TileUtilities_C_CheckBasement::SpawnedObject' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_CheckBasement, __WorldContext) == 0x000010, "Member 'TileUtilities_C_CheckBasement::__WorldContext' has a wrong offset!");
static_assert(offsetof(TileUtilities_C_CheckBasement, Initialized2) == 0x000018, "Member 'TileUtilities_C_CheckBasement::Initialized2' has a wrong offset!");
