#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ExportLevelsList

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ExportLevelsList.WBP_ExportLevelsList_C.ExecuteUbergraph_WBP_ExportLevelsList
// 0x0070 (0x0070 - 0x0000)
struct WBP_ExportLevelsList_C_ExecuteUbergraph_WBP_ExportLevelsList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0008(0x0018)()
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0020(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WasInputKeyJustPressed_ReturnValue;       // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ExportLevelsList_C_ExecuteUbergraph_WBP_ExportLevelsList) == 0x000008, "Wrong alignment on WBP_ExportLevelsList_C_ExecuteUbergraph_WBP_ExportLevelsList");
static_assert(sizeof(WBP_ExportLevelsList_C_ExecuteUbergraph_WBP_ExportLevelsList) == 0x000070, "Wrong size on WBP_ExportLevelsList_C_ExecuteUbergraph_WBP_ExportLevelsList");
static_assert(offsetof(WBP_ExportLevelsList_C_ExecuteUbergraph_WBP_ExportLevelsList, EntryPoint) == 0x000000, "Member 'WBP_ExportLevelsList_C_ExecuteUbergraph_WBP_ExportLevelsList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ExportLevelsList_C_ExecuteUbergraph_WBP_ExportLevelsList, CallFunc_Conv_StringToText_ReturnValue) == 0x000008, "Member 'WBP_ExportLevelsList_C_ExecuteUbergraph_WBP_ExportLevelsList::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ExportLevelsList_C_ExecuteUbergraph_WBP_ExportLevelsList, K2Node_Event_MyGeometry) == 0x000020, "Member 'WBP_ExportLevelsList_C_ExecuteUbergraph_WBP_ExportLevelsList::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ExportLevelsList_C_ExecuteUbergraph_WBP_ExportLevelsList, K2Node_Event_InDeltaTime) == 0x000058, "Member 'WBP_ExportLevelsList_C_ExecuteUbergraph_WBP_ExportLevelsList::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_ExportLevelsList_C_ExecuteUbergraph_WBP_ExportLevelsList, CallFunc_GetPlayerController_ReturnValue) == 0x000060, "Member 'WBP_ExportLevelsList_C_ExecuteUbergraph_WBP_ExportLevelsList::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ExportLevelsList_C_ExecuteUbergraph_WBP_ExportLevelsList, CallFunc_IsInputKeyDown_ReturnValue) == 0x000068, "Member 'WBP_ExportLevelsList_C_ExecuteUbergraph_WBP_ExportLevelsList::CallFunc_IsInputKeyDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ExportLevelsList_C_ExecuteUbergraph_WBP_ExportLevelsList, CallFunc_WasInputKeyJustPressed_ReturnValue) == 0x000069, "Member 'WBP_ExportLevelsList_C_ExecuteUbergraph_WBP_ExportLevelsList::CallFunc_WasInputKeyJustPressed_ReturnValue' has a wrong offset!");

// Function WBP_ExportLevelsList.WBP_ExportLevelsList_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_ExportLevelsList_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ExportLevelsList_C_Tick) == 0x000004, "Wrong alignment on WBP_ExportLevelsList_C_Tick");
static_assert(sizeof(WBP_ExportLevelsList_C_Tick) == 0x00003C, "Wrong size on WBP_ExportLevelsList_C_Tick");
static_assert(offsetof(WBP_ExportLevelsList_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_ExportLevelsList_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ExportLevelsList_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_ExportLevelsList_C_Tick::InDeltaTime' has a wrong offset!");

}

