#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LevelsList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LevelsList.WBP_LevelsList_C
// 0x0088 (0x0320 - 0x0298)
class UWBP_LevelsList_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_LevelsList;                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_LevelsList;                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_LevelPersistent;                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class USWBP_LevelInfo_C*>              SubWidgetsArray;                                   // 0x02B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          bSortLevelsByStreamedIn;                           // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULevelStreaming*>                StreamingLevels_Main;                              // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class ULevelStreaming*>                StreamingLevels_Ready;                             // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class ULevelStreaming*>                StreamingLevels_Awaits;                            // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class ULevelStreaming*>                StreamingLevels_Unloaded;                          // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class ULevelStreaming*>                StreamingLevels_Result;                            // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_LevelsList(int32 EntryPoint);
	void Destruct();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LevelsList_C">();
	}
	static class UWBP_LevelsList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LevelsList_C>();
	}
};
static_assert(alignof(UWBP_LevelsList_C) == 0x000008, "Wrong alignment on UWBP_LevelsList_C");
static_assert(sizeof(UWBP_LevelsList_C) == 0x000320, "Wrong size on UWBP_LevelsList_C");
static_assert(offsetof(UWBP_LevelsList_C, UberGraphFrame) == 0x000298, "Member 'UWBP_LevelsList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LevelsList_C, CanvasPanel_LevelsList) == 0x0002A0, "Member 'UWBP_LevelsList_C::CanvasPanel_LevelsList' has a wrong offset!");
static_assert(offsetof(UWBP_LevelsList_C, ScrollBox_LevelsList) == 0x0002A8, "Member 'UWBP_LevelsList_C::ScrollBox_LevelsList' has a wrong offset!");
static_assert(offsetof(UWBP_LevelsList_C, TextBlock_LevelPersistent) == 0x0002B0, "Member 'UWBP_LevelsList_C::TextBlock_LevelPersistent' has a wrong offset!");
static_assert(offsetof(UWBP_LevelsList_C, SubWidgetsArray) == 0x0002B8, "Member 'UWBP_LevelsList_C::SubWidgetsArray' has a wrong offset!");
static_assert(offsetof(UWBP_LevelsList_C, bSortLevelsByStreamedIn) == 0x0002C8, "Member 'UWBP_LevelsList_C::bSortLevelsByStreamedIn' has a wrong offset!");
static_assert(offsetof(UWBP_LevelsList_C, StreamingLevels_Main) == 0x0002D0, "Member 'UWBP_LevelsList_C::StreamingLevels_Main' has a wrong offset!");
static_assert(offsetof(UWBP_LevelsList_C, StreamingLevels_Ready) == 0x0002E0, "Member 'UWBP_LevelsList_C::StreamingLevels_Ready' has a wrong offset!");
static_assert(offsetof(UWBP_LevelsList_C, StreamingLevels_Awaits) == 0x0002F0, "Member 'UWBP_LevelsList_C::StreamingLevels_Awaits' has a wrong offset!");
static_assert(offsetof(UWBP_LevelsList_C, StreamingLevels_Unloaded) == 0x000300, "Member 'UWBP_LevelsList_C::StreamingLevels_Unloaded' has a wrong offset!");
static_assert(offsetof(UWBP_LevelsList_C, StreamingLevels_Result) == 0x000310, "Member 'UWBP_LevelsList_C::StreamingLevels_Result' has a wrong offset!");

}

