#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ActorWaypoint

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_ActorWaypoint.WBP_ActorWaypoint_C.UpdateDistance
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_ActorWaypoint_C_UpdateDistance final
{
public:
	struct FVector                                Actor_Location;                                    // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_Get_RunningPC_Running_Player_Controller;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetFocalLocation_ReturnValue;             // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0030(0x0018)()
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A0(0x0018)()
};
static_assert(alignof(WBP_ActorWaypoint_C_UpdateDistance) == 0x000008, "Wrong alignment on WBP_ActorWaypoint_C_UpdateDistance");
static_assert(sizeof(WBP_ActorWaypoint_C_UpdateDistance) == 0x0000B8, "Wrong size on WBP_ActorWaypoint_C_UpdateDistance");
static_assert(offsetof(WBP_ActorWaypoint_C_UpdateDistance, Actor_Location) == 0x000000, "Member 'WBP_ActorWaypoint_C_UpdateDistance::Actor_Location' has a wrong offset!");
static_assert(offsetof(WBP_ActorWaypoint_C_UpdateDistance, CallFunc_Get_RunningPC_Running_Player_Controller) == 0x000010, "Member 'WBP_ActorWaypoint_C_UpdateDistance::CallFunc_Get_RunningPC_Running_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_ActorWaypoint_C_UpdateDistance, CallFunc_GetFocalLocation_ReturnValue) == 0x000018, "Member 'WBP_ActorWaypoint_C_UpdateDistance::CallFunc_GetFocalLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActorWaypoint_C_UpdateDistance, CallFunc_Vector_Distance_ReturnValue) == 0x000024, "Member 'WBP_ActorWaypoint_C_UpdateDistance::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActorWaypoint_C_UpdateDistance, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000028, "Member 'WBP_ActorWaypoint_C_UpdateDistance::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActorWaypoint_C_UpdateDistance, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x00002C, "Member 'WBP_ActorWaypoint_C_UpdateDistance::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActorWaypoint_C_UpdateDistance, CallFunc_Conv_FloatToText_ReturnValue) == 0x000030, "Member 'WBP_ActorWaypoint_C_UpdateDistance::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActorWaypoint_C_UpdateDistance, CallFunc_Add_FloatFloat_ReturnValue) == 0x000048, "Member 'WBP_ActorWaypoint_C_UpdateDistance::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActorWaypoint_C_UpdateDistance, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'WBP_ActorWaypoint_C_UpdateDistance::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_ActorWaypoint_C_UpdateDistance, K2Node_MakeArray_Array) == 0x000090, "Member 'WBP_ActorWaypoint_C_UpdateDistance::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ActorWaypoint_C_UpdateDistance, CallFunc_Format_ReturnValue) == 0x0000A0, "Member 'WBP_ActorWaypoint_C_UpdateDistance::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_ActorWaypoint.WBP_ActorWaypoint_C.OnActorDestroyed
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_ActorWaypoint_C_OnActorDestroyed final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0028)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0028(0x0090)()
};
static_assert(alignof(WBP_ActorWaypoint_C_OnActorDestroyed) == 0x000008, "Wrong alignment on WBP_ActorWaypoint_C_OnActorDestroyed");
static_assert(sizeof(WBP_ActorWaypoint_C_OnActorDestroyed) == 0x0000B8, "Wrong size on WBP_ActorWaypoint_C_OnActorDestroyed");
static_assert(offsetof(WBP_ActorWaypoint_C_OnActorDestroyed, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'WBP_ActorWaypoint_C_OnActorDestroyed::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_ActorWaypoint_C_OnActorDestroyed, K2Node_MakeStruct_SlateBrush) == 0x000028, "Member 'WBP_ActorWaypoint_C_OnActorDestroyed::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

// Function WBP_ActorWaypoint.WBP_ActorWaypoint_C.Get_RunningPC
// 0x0010 (0x0010 - 0x0000)
struct WBP_ActorWaypoint_C_Get_RunningPC final
{
public:
	class APlayerController*                      Running_Player_Controller;                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActorWaypoint_C_Get_RunningPC) == 0x000008, "Wrong alignment on WBP_ActorWaypoint_C_Get_RunningPC");
static_assert(sizeof(WBP_ActorWaypoint_C_Get_RunningPC) == 0x000010, "Wrong size on WBP_ActorWaypoint_C_Get_RunningPC");
static_assert(offsetof(WBP_ActorWaypoint_C_Get_RunningPC, Running_Player_Controller) == 0x000000, "Member 'WBP_ActorWaypoint_C_Get_RunningPC::Running_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_ActorWaypoint_C_Get_RunningPC, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WBP_ActorWaypoint_C_Get_RunningPC::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

}

