#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ExportLevelsList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ExportLevelsList.WBP_ExportLevelsList_C
// 0x0028 (0x02C0 - 0x0298)
class UWBP_ExportLevelsList_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_WidgetClose;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMultiLineEditableTextBox*              MultiLineEditableTextBox_ExportedLevelsList;       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 ExportedLevelsListString;                          // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ExportLevelsList(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__WBP_ExportLevelsList_Button_WidgetClose_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ExportLevelsList_C">();
	}
	static class UWBP_ExportLevelsList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ExportLevelsList_C>();
	}
};
static_assert(alignof(UWBP_ExportLevelsList_C) == 0x000008, "Wrong alignment on UWBP_ExportLevelsList_C");
static_assert(sizeof(UWBP_ExportLevelsList_C) == 0x0002C0, "Wrong size on UWBP_ExportLevelsList_C");
static_assert(offsetof(UWBP_ExportLevelsList_C, UberGraphFrame) == 0x000298, "Member 'UWBP_ExportLevelsList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ExportLevelsList_C, Button_WidgetClose) == 0x0002A0, "Member 'UWBP_ExportLevelsList_C::Button_WidgetClose' has a wrong offset!");
static_assert(offsetof(UWBP_ExportLevelsList_C, MultiLineEditableTextBox_ExportedLevelsList) == 0x0002A8, "Member 'UWBP_ExportLevelsList_C::MultiLineEditableTextBox_ExportedLevelsList' has a wrong offset!");
static_assert(offsetof(UWBP_ExportLevelsList_C, ExportedLevelsListString) == 0x0002B0, "Member 'UWBP_ExportLevelsList_C::ExportedLevelsListString' has a wrong offset!");

}

