#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameStateController

#include "Basic.hpp"

#include "E_DBDGameState_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_GameStateController.WBP_GameStateController_C.ExecuteUbergraph_WBP_GameStateController
// 0x0120 (0x0120 - 0x0000)
struct WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameStateController_C> K2Node_DynamicCast_AsBPI_Game_State_Controller; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameStateController_C> K2Node_DynamicCast_AsBPI_Game_State_Controller_1; // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0064(0x0014)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameStateController_C> K2Node_DynamicCast_AsBPI_Game_State_Controller_2; // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameStateController_C> K2Node_DynamicCast_AsBPI_Game_State_Controller_3; // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameStateController_C> K2Node_DynamicCast_AsBPI_Game_State_Controller_4; // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue_1;        // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameStateController_C> K2Node_DynamicCast_AsBPI_Game_State_Controller_5; // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameStateController_C> K2Node_DynamicCast_AsBPI_Game_State_Controller_6; // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController) == 0x000008, "Wrong alignment on WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController");
static_assert(sizeof(WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController) == 0x000120, "Wrong size on WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController");
static_assert(offsetof(WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController, EntryPoint) == 0x000000, "Member 'WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000020, "Member 'WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController, K2Node_SwitchString_CmpSuccess) == 0x000030, "Member 'WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController, K2Node_DynamicCast_AsBPI_Game_State_Controller) == 0x000038, "Member 'WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController::K2Node_DynamicCast_AsBPI_Game_State_Controller' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController, K2Node_DynamicCast_AsBPI_Game_State_Controller_1) == 0x000050, "Member 'WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController::K2Node_DynamicCast_AsBPI_Game_State_Controller_1' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController, K2Node_CreateDelegate_OutputDelegate_1) == 0x000064, "Member 'WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000078, "Member 'WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController, K2Node_DynamicCast_AsBPI_Game_State_Controller_2) == 0x000080, "Member 'WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController::K2Node_DynamicCast_AsBPI_Game_State_Controller_2' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController, K2Node_DynamicCast_bSuccess_2) == 0x000090, "Member 'WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController, K2Node_DynamicCast_AsBPI_Game_State_Controller_3) == 0x000098, "Member 'WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController::K2Node_DynamicCast_AsBPI_Game_State_Controller_3' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController, K2Node_DynamicCast_bSuccess_3) == 0x0000A8, "Member 'WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController, K2Node_DynamicCast_AsBPI_Game_State_Controller_4) == 0x0000B0, "Member 'WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController::K2Node_DynamicCast_AsBPI_Game_State_Controller_4' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController, K2Node_DynamicCast_bSuccess_4) == 0x0000C0, "Member 'WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController, CallFunc_GetCurrentLevelName_ReturnValue_1) == 0x0000C8, "Member 'WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController::CallFunc_GetCurrentLevelName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x0000D8, "Member 'WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController, CallFunc_GetPlayerController_ReturnValue) == 0x0000E0, "Member 'WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController, CallFunc_IsValid_ReturnValue) == 0x0000E8, "Member 'WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController, K2Node_DynamicCast_AsBPI_Game_State_Controller_5) == 0x0000F0, "Member 'WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController::K2Node_DynamicCast_AsBPI_Game_State_Controller_5' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController, K2Node_DynamicCast_bSuccess_5) == 0x000100, "Member 'WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController, K2Node_DynamicCast_AsBPI_Game_State_Controller_6) == 0x000108, "Member 'WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController::K2Node_DynamicCast_AsBPI_Game_State_Controller_6' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController, K2Node_DynamicCast_bSuccess_6) == 0x000118, "Member 'WBP_GameStateController_C_ExecuteUbergraph_WBP_GameStateController::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");

// Function WBP_GameStateController.WBP_GameStateController_C.DebugConsolePrint
// 0x03E0 (0x03E0 - 0x0000)
struct WBP_GameStateController_C_DebugConsolePrint final
{
public:
	E_DBDGameState                                DBDGameState;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0080(0x0018)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A0(0x0040)(HasGetValueTypeHash)
	class FString                                 CallFunc_Get_DateTime_Year;                        // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_DateTime_Month;                       // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_DateTime_Day;                         // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_DateTime_Hour;                        // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_DateTime_Minute;                      // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_DateTime_Second;                      // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_DateTime_Millisecond;                 // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0150(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0168(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0180(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01C0(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0200(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_5;          // 0x0218(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0230(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0270(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_6;          // 0x02B0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_7;          // 0x02C8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x02E0(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x0320(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_8;          // 0x0360(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_8;            // 0x0378(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x03B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x03C8(0x0018)()
};
static_assert(alignof(WBP_GameStateController_C_DebugConsolePrint) == 0x000008, "Wrong alignment on WBP_GameStateController_C_DebugConsolePrint");
static_assert(sizeof(WBP_GameStateController_C_DebugConsolePrint) == 0x0003E0, "Wrong size on WBP_GameStateController_C_DebugConsolePrint");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, DBDGameState) == 0x000000, "Member 'WBP_GameStateController_C_DebugConsolePrint::DBDGameState' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'WBP_GameStateController_C_DebugConsolePrint::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WBP_GameStateController_C_DebugConsolePrint::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000030, "Member 'WBP_GameStateController_C_DebugConsolePrint::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'WBP_GameStateController_C_DebugConsolePrint::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000080, "Member 'WBP_GameStateController_C_DebugConsolePrint::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, CallFunc_GetPlayerController_ReturnValue) == 0x000098, "Member 'WBP_GameStateController_C_DebugConsolePrint::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A0, "Member 'WBP_GameStateController_C_DebugConsolePrint::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, CallFunc_Get_DateTime_Year) == 0x0000E0, "Member 'WBP_GameStateController_C_DebugConsolePrint::CallFunc_Get_DateTime_Year' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, CallFunc_Get_DateTime_Month) == 0x0000F0, "Member 'WBP_GameStateController_C_DebugConsolePrint::CallFunc_Get_DateTime_Month' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, CallFunc_Get_DateTime_Day) == 0x000100, "Member 'WBP_GameStateController_C_DebugConsolePrint::CallFunc_Get_DateTime_Day' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, CallFunc_Get_DateTime_Hour) == 0x000110, "Member 'WBP_GameStateController_C_DebugConsolePrint::CallFunc_Get_DateTime_Hour' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, CallFunc_Get_DateTime_Minute) == 0x000120, "Member 'WBP_GameStateController_C_DebugConsolePrint::CallFunc_Get_DateTime_Minute' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, CallFunc_Get_DateTime_Second) == 0x000130, "Member 'WBP_GameStateController_C_DebugConsolePrint::CallFunc_Get_DateTime_Second' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, CallFunc_Get_DateTime_Millisecond) == 0x000140, "Member 'WBP_GameStateController_C_DebugConsolePrint::CallFunc_Get_DateTime_Millisecond' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000150, "Member 'WBP_GameStateController_C_DebugConsolePrint::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000168, "Member 'WBP_GameStateController_C_DebugConsolePrint::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, K2Node_MakeStruct_FormatArgumentData_2) == 0x000180, "Member 'WBP_GameStateController_C_DebugConsolePrint::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, K2Node_MakeStruct_FormatArgumentData_3) == 0x0001C0, "Member 'WBP_GameStateController_C_DebugConsolePrint::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, CallFunc_Conv_StringToText_ReturnValue_4) == 0x000200, "Member 'WBP_GameStateController_C_DebugConsolePrint::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, CallFunc_Conv_StringToText_ReturnValue_5) == 0x000218, "Member 'WBP_GameStateController_C_DebugConsolePrint::CallFunc_Conv_StringToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, K2Node_MakeStruct_FormatArgumentData_4) == 0x000230, "Member 'WBP_GameStateController_C_DebugConsolePrint::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, K2Node_MakeStruct_FormatArgumentData_5) == 0x000270, "Member 'WBP_GameStateController_C_DebugConsolePrint::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, CallFunc_Conv_StringToText_ReturnValue_6) == 0x0002B0, "Member 'WBP_GameStateController_C_DebugConsolePrint::CallFunc_Conv_StringToText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, CallFunc_Conv_StringToText_ReturnValue_7) == 0x0002C8, "Member 'WBP_GameStateController_C_DebugConsolePrint::CallFunc_Conv_StringToText_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, K2Node_MakeStruct_FormatArgumentData_6) == 0x0002E0, "Member 'WBP_GameStateController_C_DebugConsolePrint::K2Node_MakeStruct_FormatArgumentData_6' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, K2Node_MakeStruct_FormatArgumentData_7) == 0x000320, "Member 'WBP_GameStateController_C_DebugConsolePrint::K2Node_MakeStruct_FormatArgumentData_7' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, CallFunc_Conv_StringToText_ReturnValue_8) == 0x000360, "Member 'WBP_GameStateController_C_DebugConsolePrint::CallFunc_Conv_StringToText_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, K2Node_MakeStruct_FormatArgumentData_8) == 0x000378, "Member 'WBP_GameStateController_C_DebugConsolePrint::K2Node_MakeStruct_FormatArgumentData_8' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, K2Node_MakeArray_Array) == 0x0003B8, "Member 'WBP_GameStateController_C_DebugConsolePrint::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_GameStateController_C_DebugConsolePrint, CallFunc_Format_ReturnValue) == 0x0003C8, "Member 'WBP_GameStateController_C_DebugConsolePrint::CallFunc_Format_ReturnValue' has a wrong offset!");

}

