#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameStateController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "E_DBDGameState_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GameStateController.WBP_GameStateController_C
// 0x0018 (0x02B0 - 0x0298)
class UWBP_GameStateController_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class BP_DBDGameInstance::UBP_DBDGameInstance_C* DBDGameInstanceReference;                       // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bEnableConsoleDebugging;                           // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_GameStateController(int32 EntryPoint);
	void Event_T__LookingForPlayerController();
	void Event_StartLookingForPlayerController();
	void Event_T__LookingForMatch();
	void Event_StartLookingForMatch();
	void Force_Event_Destruct();
	void Destruct();
	void Construct();
	void DebugConsolePrint(E_DBDGameState DBDGameState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GameStateController_C">();
	}
	static class UWBP_GameStateController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GameStateController_C>();
	}
};
static_assert(alignof(UWBP_GameStateController_C) == 0x000008, "Wrong alignment on UWBP_GameStateController_C");
static_assert(sizeof(UWBP_GameStateController_C) == 0x0002B0, "Wrong size on UWBP_GameStateController_C");
static_assert(offsetof(UWBP_GameStateController_C, UberGraphFrame) == 0x000298, "Member 'UWBP_GameStateController_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GameStateController_C, DBDGameInstanceReference) == 0x0002A0, "Member 'UWBP_GameStateController_C::DBDGameInstanceReference' has a wrong offset!");
static_assert(offsetof(UWBP_GameStateController_C, bEnableConsoleDebugging) == 0x0002A8, "Member 'UWBP_GameStateController_C::bEnableConsoleDebugging' has a wrong offset!");

}

