#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ControlledActorStats

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ControlledActorStats.WBP_ControlledActorStats_C
// 0x0030 (0x02C8 - 0x0298)
class UWBP_ControlledActorStats_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_ActorStatsSection;                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_ActorLocation;                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_ActorRotation;                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ActorName;                               // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AActor*                                 ActorReference;                                    // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ControlledActorStats(int32 EntryPoint);
	void Event_UpdateActorLocation_Rotation();
	void Construct();
	class FText GetText_ActorLocation();
	class FText GetText_ActorRotation();
	class FText GetRichText_FormatPositiveNegativeValue(float Value, int32 Maximum_Fractional_Digits);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ControlledActorStats_C">();
	}
	static class UWBP_ControlledActorStats_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ControlledActorStats_C>();
	}
};
static_assert(alignof(UWBP_ControlledActorStats_C) == 0x000008, "Wrong alignment on UWBP_ControlledActorStats_C");
static_assert(sizeof(UWBP_ControlledActorStats_C) == 0x0002C8, "Wrong size on UWBP_ControlledActorStats_C");
static_assert(offsetof(UWBP_ControlledActorStats_C, UberGraphFrame) == 0x000298, "Member 'UWBP_ControlledActorStats_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ControlledActorStats_C, CanvasPanel_ActorStatsSection) == 0x0002A0, "Member 'UWBP_ControlledActorStats_C::CanvasPanel_ActorStatsSection' has a wrong offset!");
static_assert(offsetof(UWBP_ControlledActorStats_C, RichTextBlock_ActorLocation) == 0x0002A8, "Member 'UWBP_ControlledActorStats_C::RichTextBlock_ActorLocation' has a wrong offset!");
static_assert(offsetof(UWBP_ControlledActorStats_C, RichTextBlock_ActorRotation) == 0x0002B0, "Member 'UWBP_ControlledActorStats_C::RichTextBlock_ActorRotation' has a wrong offset!");
static_assert(offsetof(UWBP_ControlledActorStats_C, TextBlock_ActorName) == 0x0002B8, "Member 'UWBP_ControlledActorStats_C::TextBlock_ActorName' has a wrong offset!");
static_assert(offsetof(UWBP_ControlledActorStats_C, ActorReference) == 0x0002C0, "Member 'UWBP_ControlledActorStats_C::ActorReference' has a wrong offset!");

}

