#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ControlledActorStats

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_ControlledActorStats.WBP_ControlledActorStats_C.ExecuteUbergraph_WBP_ControlledActorStats
// 0x0080 (0x0080 - 0x0000)
struct WBP_ControlledActorStats_C_ExecuteUbergraph_WBP_ControlledActorStats final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ActorRotation_ReturnValue;        // 0x0008(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ObjectToString_ReturnValue;          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
	class FText                                   CallFunc_GetText_ActorLocation_ReturnValue;        // 0x0068(0x0018)()
};
static_assert(alignof(WBP_ControlledActorStats_C_ExecuteUbergraph_WBP_ControlledActorStats) == 0x000008, "Wrong alignment on WBP_ControlledActorStats_C_ExecuteUbergraph_WBP_ControlledActorStats");
static_assert(sizeof(WBP_ControlledActorStats_C_ExecuteUbergraph_WBP_ControlledActorStats) == 0x000080, "Wrong size on WBP_ControlledActorStats_C_ExecuteUbergraph_WBP_ControlledActorStats");
static_assert(offsetof(WBP_ControlledActorStats_C_ExecuteUbergraph_WBP_ControlledActorStats, EntryPoint) == 0x000000, "Member 'WBP_ControlledActorStats_C_ExecuteUbergraph_WBP_ControlledActorStats::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_ExecuteUbergraph_WBP_ControlledActorStats, CallFunc_GetText_ActorRotation_ReturnValue) == 0x000008, "Member 'WBP_ControlledActorStats_C_ExecuteUbergraph_WBP_ControlledActorStats::CallFunc_GetText_ActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_ExecuteUbergraph_WBP_ControlledActorStats, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WBP_ControlledActorStats_C_ExecuteUbergraph_WBP_ControlledActorStats::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_ExecuteUbergraph_WBP_ControlledActorStats, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'WBP_ControlledActorStats_C_ExecuteUbergraph_WBP_ControlledActorStats::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_ExecuteUbergraph_WBP_ControlledActorStats, CallFunc_Conv_ObjectToString_ReturnValue) == 0x000040, "Member 'WBP_ControlledActorStats_C_ExecuteUbergraph_WBP_ControlledActorStats::CallFunc_Conv_ObjectToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_ExecuteUbergraph_WBP_ControlledActorStats, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'WBP_ControlledActorStats_C_ExecuteUbergraph_WBP_ControlledActorStats::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_ExecuteUbergraph_WBP_ControlledActorStats, CallFunc_GetText_ActorLocation_ReturnValue) == 0x000068, "Member 'WBP_ControlledActorStats_C_ExecuteUbergraph_WBP_ControlledActorStats::CallFunc_GetText_ActorLocation_ReturnValue' has a wrong offset!");

// Function WBP_ControlledActorStats.WBP_ControlledActorStats_C.GetText_ActorLocation
// 0x0168 (0x0168 - 0x0000)
struct WBP_ControlledActorStats_C_GetText_ActorLocation final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetRichText_FormatPositiveNegativeValue_ReturnValue; // 0x0038(0x0018)()
	class FText                                   CallFunc_GetRichText_FormatPositiveNegativeValue_ReturnValue_1; // 0x0050(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A8(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetRichText_FormatPositiveNegativeValue_ReturnValue_2; // 0x00E8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0100(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0140(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0150(0x0018)()
};
static_assert(alignof(WBP_ControlledActorStats_C_GetText_ActorLocation) == 0x000008, "Wrong alignment on WBP_ControlledActorStats_C_GetText_ActorLocation");
static_assert(sizeof(WBP_ControlledActorStats_C_GetText_ActorLocation) == 0x000168, "Wrong size on WBP_ControlledActorStats_C_GetText_ActorLocation");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorLocation, ReturnValue) == 0x000000, "Member 'WBP_ControlledActorStats_C_GetText_ActorLocation::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorLocation, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_ControlledActorStats_C_GetText_ActorLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00001C, "Member 'WBP_ControlledActorStats_C_GetText_ActorLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorLocation, CallFunc_BreakVector_X) == 0x000028, "Member 'WBP_ControlledActorStats_C_GetText_ActorLocation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorLocation, CallFunc_BreakVector_Y) == 0x00002C, "Member 'WBP_ControlledActorStats_C_GetText_ActorLocation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorLocation, CallFunc_BreakVector_Z) == 0x000030, "Member 'WBP_ControlledActorStats_C_GetText_ActorLocation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorLocation, CallFunc_GetRichText_FormatPositiveNegativeValue_ReturnValue) == 0x000038, "Member 'WBP_ControlledActorStats_C_GetText_ActorLocation::CallFunc_GetRichText_FormatPositiveNegativeValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorLocation, CallFunc_GetRichText_FormatPositiveNegativeValue_ReturnValue_1) == 0x000050, "Member 'WBP_ControlledActorStats_C_GetText_ActorLocation::CallFunc_GetRichText_FormatPositiveNegativeValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorLocation, K2Node_MakeStruct_FormatArgumentData) == 0x000068, "Member 'WBP_ControlledActorStats_C_GetText_ActorLocation::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorLocation, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A8, "Member 'WBP_ControlledActorStats_C_GetText_ActorLocation::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorLocation, CallFunc_GetRichText_FormatPositiveNegativeValue_ReturnValue_2) == 0x0000E8, "Member 'WBP_ControlledActorStats_C_GetText_ActorLocation::CallFunc_GetRichText_FormatPositiveNegativeValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorLocation, K2Node_MakeStruct_FormatArgumentData_2) == 0x000100, "Member 'WBP_ControlledActorStats_C_GetText_ActorLocation::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorLocation, K2Node_MakeArray_Array) == 0x000140, "Member 'WBP_ControlledActorStats_C_GetText_ActorLocation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorLocation, CallFunc_Format_ReturnValue) == 0x000150, "Member 'WBP_ControlledActorStats_C_GetText_ActorLocation::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_ControlledActorStats.WBP_ControlledActorStats_C.GetText_ActorRotation
// 0x0168 (0x0168 - 0x0000)
struct WBP_ControlledActorStats_C_GetText_ActorRotation final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetRichText_FormatPositiveNegativeValue_ReturnValue; // 0x0038(0x0018)()
	class FText                                   CallFunc_GetRichText_FormatPositiveNegativeValue_ReturnValue_1; // 0x0050(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A8(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetRichText_FormatPositiveNegativeValue_ReturnValue_2; // 0x00E8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0100(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0140(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0150(0x0018)()
};
static_assert(alignof(WBP_ControlledActorStats_C_GetText_ActorRotation) == 0x000008, "Wrong alignment on WBP_ControlledActorStats_C_GetText_ActorRotation");
static_assert(sizeof(WBP_ControlledActorStats_C_GetText_ActorRotation) == 0x000168, "Wrong size on WBP_ControlledActorStats_C_GetText_ActorRotation");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorRotation, ReturnValue) == 0x000000, "Member 'WBP_ControlledActorStats_C_GetText_ActorRotation::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorRotation, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_ControlledActorStats_C_GetText_ActorRotation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorRotation, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00001C, "Member 'WBP_ControlledActorStats_C_GetText_ActorRotation::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorRotation, CallFunc_BreakRotator_Roll) == 0x000028, "Member 'WBP_ControlledActorStats_C_GetText_ActorRotation::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorRotation, CallFunc_BreakRotator_Pitch) == 0x00002C, "Member 'WBP_ControlledActorStats_C_GetText_ActorRotation::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorRotation, CallFunc_BreakRotator_Yaw) == 0x000030, "Member 'WBP_ControlledActorStats_C_GetText_ActorRotation::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorRotation, CallFunc_GetRichText_FormatPositiveNegativeValue_ReturnValue) == 0x000038, "Member 'WBP_ControlledActorStats_C_GetText_ActorRotation::CallFunc_GetRichText_FormatPositiveNegativeValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorRotation, CallFunc_GetRichText_FormatPositiveNegativeValue_ReturnValue_1) == 0x000050, "Member 'WBP_ControlledActorStats_C_GetText_ActorRotation::CallFunc_GetRichText_FormatPositiveNegativeValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorRotation, K2Node_MakeStruct_FormatArgumentData) == 0x000068, "Member 'WBP_ControlledActorStats_C_GetText_ActorRotation::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorRotation, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A8, "Member 'WBP_ControlledActorStats_C_GetText_ActorRotation::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorRotation, CallFunc_GetRichText_FormatPositiveNegativeValue_ReturnValue_2) == 0x0000E8, "Member 'WBP_ControlledActorStats_C_GetText_ActorRotation::CallFunc_GetRichText_FormatPositiveNegativeValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorRotation, K2Node_MakeStruct_FormatArgumentData_2) == 0x000100, "Member 'WBP_ControlledActorStats_C_GetText_ActorRotation::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorRotation, K2Node_MakeArray_Array) == 0x000140, "Member 'WBP_ControlledActorStats_C_GetText_ActorRotation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetText_ActorRotation, CallFunc_Format_ReturnValue) == 0x000150, "Member 'WBP_ControlledActorStats_C_GetText_ActorRotation::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_ControlledActorStats.WBP_ControlledActorStats_C.GetRichText_FormatPositiveNegativeValue
// 0x0130 (0x0130 - 0x0000)
struct WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Maximum_Fractional_Digits;                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0028(0x0018)()
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0098(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D8(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00F0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0100(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0118(0x0018)()
};
static_assert(alignof(WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue) == 0x000008, "Wrong alignment on WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue");
static_assert(sizeof(WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue) == 0x000130, "Wrong size on WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue");
static_assert(offsetof(WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue, Value) == 0x000000, "Member 'WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue::Value' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue, Maximum_Fractional_Digits) == 0x000004, "Member 'WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue::Maximum_Fractional_Digits' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue, ReturnValue) == 0x000008, "Member 'WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue, Temp_bool_Variable) == 0x000020, "Member 'WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue, CallFunc_Conv_FloatToText_ReturnValue) == 0x000028, "Member 'WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000040, "Member 'WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue, K2Node_MakeArray_Array) == 0x000088, "Member 'WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue, K2Node_MakeStruct_FormatArgumentData_1) == 0x000098, "Member 'WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue, CallFunc_Format_ReturnValue) == 0x0000D8, "Member 'WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue, K2Node_MakeArray_Array_1) == 0x0000F0, "Member 'WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue, CallFunc_Format_ReturnValue_1) == 0x000100, "Member 'WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue, K2Node_Select_Default) == 0x000118, "Member 'WBP_ControlledActorStats_C_GetRichText_FormatPositiveNegativeValue::K2Node_Select_Default' has a wrong offset!");

}

